export const addressRelationships = {
    communes: {
        "បន្ទាយនាង": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "បត់ត្រង់": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ចំណោម": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "គោកបល្ល័ង្គ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "គយម៉ែង": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "អូរប្រាសាទ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ភ្នំតូច": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "រហាត់ទឹក": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ឫស្សីក្រោក": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "សំបួរ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "សឿ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ស្រះរាំង": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "តាឡំ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ណាំតៅ": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ប៉ោយចារ": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ពន្លៃ": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ស្ពានស្រែង": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ស្រះជីក": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ភ្នំដី": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ឈ្នួរមានជ័យ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ជប់វារី": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ឃុំភ្នំលៀប": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ប្រាសាទ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ព្រះនេត្រព្រះ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "រហាល": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ទានកាំ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },                  //    "បន្ទាយមានជ័យ" (2)
        "ទឹកជោរ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ចង្ហា": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "កូប": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "គុត្តសត": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "និមិត្ត": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "សំរោង": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "សូភី": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "សឹង្ហ": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "ប៉ោយប៉ែត": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "អូរបីជាន់": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "បុស្បូវ": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "កំពង់ស្វាយ": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "កោះពងសត្វ": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ម្កាក": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "អូរអំបិល": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ភ្នៀត": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ឃុំព្រះពន្លា": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ទឹកថ្លា": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "បន្ទាយឆ្មារ": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "គោករមៀត": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "ថ្មពួក": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "គោកកឋិន": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "គំរូ": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "ភូមិថ្មី": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "ផ្គាំ": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "សារង្គ": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "ស្លក្រាម": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "ស្វាយចេក": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "តាបែន": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "តាផូ": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "ទ្រាស": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "រលួស": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "បឹងបេង": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "ម៉ាឡៃ": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "អូរសំព័រ": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "អូរស្រឡៅ": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "ទួលពង្រ": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "តាគង់": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "និមិត្ត": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },
        "ប៉ោយប៉ែត": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },
        "ផ្សារកណ្ដាល": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },
        "អូរជ្រៅ": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },
        "អូរឬស្សី": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },

        
        "កន្ទឺ ១": { district: "បាណន់", province: "បាត់ដំបង" },
        "កន្ទឺ ២": { district: "បាណន់", province: "បាត់ដំបង" },
        "បាយដំរាំ": { district: "បាណន់", province: "បាត់ដំបង" },
        "ឈើទាល": { district: "បាណន់", province: "បាត់ដំបង" },
        "ចែងមានជ័យ": { district: "បាណន់", province: "បាត់ដំបង" },
        "ភ្នំសំពៅ": { district: "បាណន់", province: "បាត់ដំបង" },
        "ស្នឹង": { district: "បាណន់", province: "បាត់ដំបង" },
        "តាគ្រាម": { district: "បាណន់", province: "បាត់ដំបង" },
        "តាពូង": { district: "ថ្មគោល", province: "បាត់ដំបង" },
        "តាម៉ឺន": { district: "ថ្មគោល", province: "បាត់ដំបង" },
        "អូរតាគី": { district: "ថ្មគោល", province: "បាត់ដំបង" },
        "ជ្រៃ": { district: "ថ្មគោល", province: "បាត់ដំបង" },
        "អន្លង់រុន": { district: "រុក្ខគីរី", province: "បាត់ដំបង" },
        "ជ្រោយស្តៅ": { district: "រុក្ខគីរី", province: "បាត់ដំបង" },
        "បឹងព្រីង": { district: "រុក្ខគីរី", province: "បាត់ដំបង" },
        "គោកឃ្មុំ": { district: "រុក្ខគីរី", province: "បាត់ដំបង" },
        "បន្សាយត្រែង": { district: "រុក្ខគីរី", province: "បាត់ដំបង" },
        "រូងជ្រៃ": { district: "រុក្ខគីរី", province: "បាត់ដំបង" },
        "បវេល": { district: "បវេល", province: "បាត់ដំបង" },
        "ខ្នាចរមាស": { district: "បវេល", province: "បាត់ដំបង" },
        "ល្វា": { district: "បវេល", province: "បាត់ដំបង" },
        "ព្រៃខ្ពស់": { district: "បវេល", province: "បាត់ដំបង" },
        "អំពិលប្រាំដើម": { district: "បវេល", province: "បាត់ដំបង" },
        "ក្តុលតាហែន": { district: "បវេល", province: "បាត់ដំបង" },
        "បឹងប្រាំ": { district: "បវេល", province: "បាត់ដំបង" },
        "ឃ្លាំងមាស": { district: "បវេល", province: "បាត់ដំបង" },
        "ព្រែកនរិន្ទ": { district: "ឯកភ្នំ", province: "បាត់ដំបង" },
        "សំរោងក្នុង": { district: "ឯកភ្នំ", province: "បាត់ដំបង" },
        "ព្រែកខ្ពប": { district: "ឯកភ្នំ", province: "បាត់ដំបង" },
        "ព្រែកហ្លួង": { district: "ឯកភ្នំ", province: "បាត់ដំបង" },
        "ពាមឯក": { district: "ឯកភ្នំ", province: "បាត់ដំបង" },
        "ព្រៃចាស់": { district: "ឯកភ្នំ", province: "បាត់ដំបង" },
        "កោះជីវាំង": { district: "ឯកភ្នំ", province: "បាត់ដំបង" },
        "ម៉ោង": { district: "ម៉ោងឫស្សី", province: "បាត់ដំបង" },
        "គារ": { district: "ម៉ោងឫស្សី", province: "បាត់ដំបង" },
        "ព្រៃស្វាយ": { district: "ម៉ោងឫស្សី", province: "បាត់ដំបង" },              //បាត់ដំបង (2)
        "ឫស្សីក្រាំង": { district: "ម៉ោងឫស្សី", province: "បាត់ដំបង" },
        "ជ្រៃ": { district: "ម៉ោងឫស្សី", province: "បាត់ដំបង" },
        "តាលាស់": { district: "ម៉ោងឫស្សី", province: "បាត់ដំបង" },
        "កកោះ": { district: "ម៉ោងឫស្សី", province: "បាត់ដំបង" },
        "ព្រៃតូច": { district: "ម៉ោងឫស្សី", province: "បាត់ដំបង" },
        "របស់មង្គល": { district: "ម៉ោងឫស្សី", province: "បាត់ដំបង" },
        "ស្ដៅ": { district: "រតនមណ្ឌល", province: "បាត់ដំបង" },
        "អណ្ដើកហែប": { district: "រតនមណ្ឌល", province: "បាត់ដំបង" },
        "ផ្លូវមាស": { district: "រតនមណ្ឌល", province: "បាត់ដំបង" },
        "ត្រែង": { district: "រតនមណ្ឌល", province: "បាត់ដំបង" },
        "រស្មីសង្ហារ": { district: "រតនមណ្ឌល", province: "បាត់ដំបង" },
        "អន្លង់វិល": { district: "សង្កែ", province: "បាត់ដំបង" },
        "នរា": { district: "សង្កែ", province: "បាត់ដំបង" },
        "តាប៉ុន": { district: "សង្កែ", province: "បាត់ដំបង" },
        "រកា": { district: "សង្កែ", province: "បាត់ដំបង" },
        "កំពង់ព្រះ": { district: "សង្កែ", province: "បាត់ដំបង" },
        "កំពង់ព្រៀង": { district: "សង្កែ", province: "បាត់ដំបង" },
        "រាំងកេសី": { district: "សង្កែ", province: "បាត់ដំបង" },
        "អូរដំបង ១": { district: "សង្កែ", province: "បាត់ដំបង" },
        "អូរដំបង ២": { district: "សង្កែ", province: "បាត់ដំបង" },
        "វត្តតាមិម": { district: "សង្កែ", province: "បាត់ដំបង" },
        "ស៊ុង": { district: "សំឡូត", province: "បាត់ដំបង" },
        "មានជ័យ": { district: "សំឡូត", province: "បាត់ដំបង" },
        "សំឡូត": { district: "សំឡូត", province: "បាត់ដំបង" },
        "កំពង់ល្ពៅ": { district: "សំឡូត", province: "បាត់ដំបង" },
        "អូរសំរិល": { district: "សំឡូត", province: "បាត់ដំបង" },
        "តាតោក": { district: "សំឡូត", province: "បាត់ដំបង" },
        "តាសាញ": { district: "សំឡូត", province: "បាត់ដំបង" },
        "អង្គរបាន": { district: "សំពៅលូន", province: "បាត់ដំបង" },
        "សិរីមានជ័យ": { district: "សំពៅលូន", province: "បាត់ដំបង" },
        "សន្តិភាព": { district: "សំពៅលូន", province: "បាត់ដំបង" },
        "តាសា្ត": { district: "សំពៅលូន", province: "បាត់ដំបង" },
        "សំពៅលូន": { district: "សំពៅលូន", province: "បាត់ដំបង" },
        "ជ្រៃសីមា": { district: "សំពៅលូន", province: "បាត់ដំបង" },
        "ភ្នំព្រឹក": { district: "ភ្នំព្រឹក", province: "បាត់ដំបង" },
        "ពេជ្រចិន្ដា": { district: "ភ្នំព្រឹក", province: "បាត់ដំបង" },
        "បួរ": { district: "ភ្នំព្រឹក", province: "បាត់ដំបង" },
        "បារាំងធ្លាក់": { district: "ភ្នំព្រឹក", province: "បាត់ដំបង" },
        "អូររំដួល": { district: "ភ្នំព្រឹក", province: "បាត់ដំបង" },
        "កំរៀង": { district: "កំរៀង", province: "បាត់ដំបង" },
        "អូរដា": { district: "កំរៀង", province: "បាត់ដំបង" },
        "បឹងរាំង": { district: "កំរៀង", province: "បាត់ដំបង" },
        "ត្រាង": { district: "កំរៀង", province: "បាត់ដំបង" },
        "តាសែន": { district: "កំរៀង", province: "បាត់ដំបង" },
        "តាក្រី": { district: "កំរៀង", province: "បាត់ដំបង" },
        "ឆ្នាល់មាន់": { district: "គាស់ក្រឡ", province: "បាត់ដំបង" },
        "ដូនបា": { district: "គាស់ក្រឡ", province: "បាត់ដំបង" },
        "ហប់": { district: "គាស់ក្រឡ", province: "បាត់ដំបង" },
        "គាស់ក្រឡ": { district: "គាស់ក្រឡ", province: "បាត់ដំបង" },
        "ព្រះផុស": { district: "គាស់ក្រឡ", province: "បាត់ដំបង" },
        "ធិបតី": { district: "គាស់ក្រឡ", province: "បាត់ដំបង" },



        'បាធាយ': {'district': 'បាធាយ', 'province': 'កំពង់ចាម'},
        'ច្បារអំពៅ': {'district': 'បាធាយ', 'province': 'កំពង់ចាម'},
        'ជាលា': {'district': 'បាធាយ', 'province': 'កំពង់ចាម'},
        'ជើងព្រៃ': {'district': 'បាធាយ', 'province': 'កំពង់ចាម'},
        'មេព្រីង': {'district': 'បាធាយ', 'province': 'កំពង់ចាម'},
        'ផ្អាវ': {'district': 'បាធាយ', 'province': 'កំពង់ចាម'},
        'សំបូរ': {'district': 'បាធាយ', 'province': 'កំពង់ចាម'},
        'សណ្ដែក': {'district': 'បាធាយ', 'province': 'កំពង់ចាម'},
        'តាំងក្រាំង': {'district': 'បាធាយ', 'province': 'កំពង់ចាម'},
        'តាំងក្រសាំង': {'district': 'បាធាយ', 'province': 'កំពង់ចាម'},
        'ត្រប់': {'district': 'បាធាយ', 'province': 'កំពង់ចាម'},
        'ទំនប់': {'district': 'បាធាយ', 'province': 'កំពង់ចាម'},
        'បុសខ្នុរ': {'district': 'ចំការលើ', 'province': 'កំពង់ចាម'},
        'ចំការអណ្តូង': {'district': 'ចំការលើ', 'province': 'កំពង់ចាម'},
        'ជយោ': {'district': 'ចំការលើ', 'province': 'កំពង់ចាម'},
        'ល្វាលើ': {'district': 'ចំការលើ', 'province': 'កំពង់ចាម'},
        'ស្ពឺ': {'district': 'ចំការលើ', 'province': 'កំពង់ចាម'},
        'ស្វាយទាប': {'district': 'ចំការលើ', 'province': 'កំពង់ចាម'},
        'តាអុង': {'district': 'ចំការលើ', 'province': 'កំពង់ចាម'},
        'តាប្រុក': {'district': 'ចំការលើ', 'province': 'កំពង់ចាម'},
        'ខ្នុរដំបង': {'district': 'ជើងព្រៃ', 'province': 'កំពង់ចាម'},
        'គោករវៀង': {'district': 'ជើងព្រៃ', 'province': 'កំពង់ចាម'},
        'ផ្តៅជុំ': {'district': 'ជើងព្រៃ', 'province': 'កំពង់ចាម'},
        'ព្រៃចារ': {'district': 'ជើងព្រៃ', 'province': 'កំពង់ចាម'},
        'ព្រីងជ្រំ': {'district': 'ជើងព្រៃ', 'province': 'កំពង់ចាម'},
        'សំពងជ័យ': {'district': 'ជើងព្រៃ', 'province': 'កំពង់ចាម'},
        'ស្តើងជ័យ': {'district': 'ជើងព្រៃ', 'province': 'កំពង់ចាម'},
        'សូទិប': {'district': 'ជើងព្រៃ', 'province': 'កំពង់ចាម'},
        'ស្រម៉រ': {'district': 'ជើងព្រៃ', 'province': 'កំពង់ចាម'},
        'ត្រពាំងគរ': {'district': 'ជើងព្រៃ', 'province': 'កំពង់ចាម'},
        'បឹងកុក': {'district': 'កំពង់ចាម', 'province': 'កំពង់ចាម'},
        'កំពង់ចាម': {'district': 'កំពង់ចាម', 'province': 'កំពង់ចាម'},
        'សំបួរមាស': {'district': 'កំពង់ចាម', 'province': 'កំពង់ចាម'},
        'វាលវង់': {'district': 'កំពង់ចាម', 'province': 'កំពង់ចាម'},
        'អំពិល': {'district': 'កំពង់សៀម', 'province': 'កំពង់ចាម'},
        'ហាន់ជ័យ': {'district': 'កំពង់សៀម', 'province': 'កំពង់ចាម'},
        'កៀនជ្រៃ': {'district': 'កំពង់សៀម', 'province': 'កំពង់ចាម'},
        'គគរ': {'district': 'កំពង់សៀម', 'province': 'កំពង់ចាម'},
        'កោះមិត្ត': {'district': 'កំពង់សៀម', 'province': 'កំពង់ចាម'},
        'កោះរកា': {'district': 'កំពង់សៀម', 'province': 'កំពង់ចាម'},
        'កោះសំរោង': {'district': 'កំពង់សៀម', 'province': 'កំពង់ចាម'},
        'កោះទន្ទឹម': {'district': 'កំពង់សៀម', 'province': 'កំពង់ចាម'},
        'ក្រឡា': {'district': 'កំពង់សៀម', 'province': 'កំពង់ចាម'},
        'អូរស្វាយ': {'district': 'កំពង់សៀម', 'province': 'កំពង់ចាម'},
        'រអាង': {'district': 'កំពង់សៀម', 'province': 'កំពង់ចាម'},
        'រំចេក': {'district': 'កំពង់សៀម', 'province': 'កំពង់ចាម'},
        'ស្រក': {'district': 'កំពង់សៀម', 'province': 'កំពង់ចាម'},
        'ប្រទាន': {'district': 'កំពង់សៀម', 'province': 'កំពង់ចាម'},
        'វិហារធំ': {'district': 'កំពង់សៀម', 'province': 'កំពង់ចាម'},
        'អង្គរបាន': {'district': 'កងមាស', 'province': 'កំពង់ចាម'},
        'កងតាណឹង': {'district': 'កងមាស', 'province': 'កំពង់ចាម'},
        'ខ្ចៅ': {'district': 'កងមាស', 'province': 'កំពង់ចាម'},
        'ពាមជីកង': {'district': 'កងមាស', 'province': 'កំពង់ចាម'},
        'ព្រែកកុយ': {'district': 'កងមាស', 'province': 'កំពង់ចាម'},
        'ព្រែកក្របៅ': {'district': 'កងមាស', 'province': 'កំពង់ចាម'},
        'រាយប៉ាយ': {'district': 'កងមាស', 'province': 'កំពង់ចាម'},
        'រកាអារ': {'district': 'កងមាស', 'province': 'កំពង់ចាម'},
        'រកាគយ': {'district': 'កងមាស', 'province': 'កំពង់ចាម'},
        'ស្តៅ': {'district': 'កងមាស', 'province': 'កំពង់ចាម'},
        'សូរគង': {'district': 'កងមាស', 'province': 'កំពង់ចាម'},
        'កំពង់រាប': {'district': 'កោះសូទិន', 'province': 'កំពង់ចាម'},
        'កោះសូទិន': {'district': 'កោះសូទិន', 'province': 'កំពង់ចាម'},
        'ល្វេ': {'district': 'កោះសូទិន', 'province': 'កំពង់ចាម'},
        'មហាលាភ': {'district': 'កោះសូទិន', 'province': 'កំពង់ចាម'},
        'មហាខ្ញូង': {'district': 'កោះសូទិន', 'province': 'កំពង់ចាម'},
        'ពាមប្រធ្នោះ': {'district': 'កោះសូទិន', 'province': 'កំពង់ចាម'},
        'ពង្រ': {'district': 'កោះសូទិន', 'province': 'កំពង់ចាម'},
        'ព្រែកតានង់': {'district': 'កោះសូទិន', 'province': 'កំពង់ចាម'},
        'បារាយណ៍': {'district': 'ស្រីសន្ធរ', 'province': 'កំពង់ចាម'},                                      //កំពង់ចាម (3)
        'បឹងណាយ': {'district': 'ព្រៃឈរ', 'province': 'កំពង់ចាម'},
        'ជ្រៃវៀន': {'district': 'ព្រៃឈរ', 'province': 'កំពង់ចាម'},
        'ខ្វិតធំ': {'district': 'ព្រៃឈរ', 'province': 'កំពង់ចាម'},
        'គរ': {'district': 'ព្រៃឈរ', 'province': 'កំពង់ចាម'},
        'ក្រូច': {'district': 'ព្រៃឈរ', 'province': 'កំពង់ចាម'},
        'ល្វា': {'district': 'ព្រៃឈរ', 'province': 'កំពង់ចាម'},
        'មៀន': {'district': 'ព្រៃឈរ', 'province': 'កំពង់ចាម'},
        'ព្រៃឈរ': {'district': 'ព្រៃឈរ', 'province': 'កំពង់ចាម'},
        'សូរ្យសែន': {'district': 'ព្រៃឈរ', 'province': 'កំពង់ចាម'},
        'សំរោង': {'district': 'ព្រៃឈរ', 'province': 'កំពង់ចាម'},
        'ស្រង៉ែ': {'district': 'ព្រៃឈរ', 'province': 'កំពង់ចាម'},
        'ថ្មពូន': {'district': 'ព្រៃឈរ', 'province': 'កំពង់ចាម'},
        'តុងរ៉ុង': {'district': 'ព្រៃឈរ', 'province': 'កំពង់ចាម'},
        'ត្រពាំងព្រះ': {'district': 'ព្រៃឈរ', 'province': 'កំពង់ចាម'},
        'ជីបាល': {'district': 'ស្រីសន្ធរ', 'province': 'កំពង់ចាម'},
        'ខ្នារស': {'district': 'ស្រីសន្ធរ', 'province': 'កំពង់ចាម'},
        'កោះអណ្តែត': {'district': 'ស្រីសន្ធរ', 'province': 'កំពង់ចាម'},
        'មានជ័យ': {'district': 'ស្រីសន្ធរ', 'province': 'កំពង់ចាម'},
        'ផ្ទះកណ្តាល': {'district': 'ស្រីសន្ធរ', 'province': 'កំពង់ចាម'},
        'ប្រាំយ៉ាម': {'district': 'ស្រីសន្ធរ', 'province': 'កំពង់ចាម'},
        'ព្រែកដំបូក': {'district': 'ស្រីសន្ធរ', 'province': 'កំពង់ចាម'},
        'ព្រែកពោធិ': {'district': 'ស្រីសន្ធរ', 'province': 'កំពង់ចាម'},
        'ព្រែករំដេង': {'district': 'ស្រីសន្ធរ', 'province': 'កំពង់ចាម'},
        'ឫស្សីស្រុក': {'district': 'ស្រីសន្ធរ', 'province': 'កំពង់ចាម'},
        'ស្វាយពោធិ': {'district': 'ស្រីសន្ធរ', 'province': 'កំពង់ចាម'},
        'ស្វាយសាច់ភ្នំ': {'district': 'ស្រីសន្ធរ', 'province': 'កំពង់ចាម'},
        'ទងត្រឡាច': {'district': 'ស្រីសន្ធរ', 'province': 'កំពង់ចាម'},
        'អារក្សត្នោត': {'district': 'ស្ទឹងត្រង់', 'province': 'កំពង់ចាម'},
        'ដងក្តារ': {'district': 'ស្ទឹងត្រង់', 'province': 'កំពង់ចាម'},
        'ខ្ពបតាងួន': {'district': 'ស្ទឹងត្រង់', 'province': 'កំពង់ចាម'},
        'មេសរជ្រៃ': {'district': 'ស្ទឹងត្រង់', 'province': 'កំពង់ចាម'},
        'អូរម្លូ': {'district': 'ស្ទឹងត្រង់', 'province': 'កំពង់ចាម'},
        'ពាមកោះស្នា': {'district': 'ស្ទឹងត្រង់', 'province': 'កំពង់ចាម'},
        'ព្រះអណ្តូង': {'district': 'ស្ទឹងត្រង់', 'province': 'កំពង់ចាម'},
        'ព្រែកបាក់': {'district': 'ស្ទឹងត្រង់', 'province': 'កំពង់ចាម'},
        'ព្រែកកក់': {'district': 'ស្ទឹងត្រង់', 'province': 'កំពង់ចាម'},
        'សូភាស': {'district': 'ស្ទឹងត្រង់', 'province': 'កំពង់ចាម'},
        'ទួលព្រះឃ្លាំង': {'district': 'ស្ទឹងត្រង់', 'province': 'កំពង់ចាម'},
        'ទួលសំបួរ': {'district': 'ស្ទឹងត្រង់', 'province': 'កំពង់ចាម'},



            'អញ្ចាញរូង': {'district': 'បរិបូណ៍', 'province': 'កំពង់ឆ្នាំង'},
            'ឆ្នុកទ្រូ': {'district': 'បរិបូណ៍', 'province': 'កំពង់ឆ្នាំង'},
            'ចក': {'district': 'បរិបូណ៍', 'province': 'កំពង់ឆ្នាំង'},
            'ខុនរ៉ង': {'district': 'បរិបូណ៍', 'province': 'កំពង់ឆ្នាំង'},
            'កំពង់ព្រះគគីរ': {'district': 'បរិបូណ៍', 'province': 'កំពង់ឆ្នាំង'},
            'មេលំ': {'district': 'បរិបូណ៍', 'province': 'កំពង់ឆ្នាំង'},
            'ផ្សារ': {'district': 'បរិបូណ៍', 'province': 'កំពង់ឆ្នាំង'},
            'ពេជ្រចង្វារ': {'district': 'បរិបូណ៍', 'province': 'កំពង់ឆ្នាំង'},
            'ពពេល': {'district': 'បរិបូណ៍', 'province': 'កំពង់ឆ្នាំង'},
            'ពន្លៃ': {'district': 'បរិបូណ៍', 'province': 'កំពង់ឆ្នាំង'},
            'ត្រពាំងចាន់': {'district': 'បរិបូណ៍', 'province': 'កំពង់ឆ្នាំង'},

        'ជលសា': {'district': 'ជលគីរី', 'province': 'កំពង់ឆ្នាំង'},
        'កោះថ្កូវ': {'district': 'ជលគីរី', 'province': 'កំពង់ឆ្នាំង'},
        'កំពង់អុស': {'district': 'ជលគីរី', 'province': 'កំពង់ឆ្នាំង'},
        'ពាមឆ្កោក': {'district': 'ជលគីរី', 'province': 'កំពង់ឆ្នាំង'},
        'ព្រៃគ្រី': {'district': 'ជលគីរី', 'province': 'កំពង់ឆ្នាំង'},

        'ផ្សារឆ្នាំង': {'district': 'កំពង់ឆ្នាំង', 'province': 'កំពង់ឆ្នាំង'},
        'កំពង់ឆ្នាំង': {'district': 'កំពង់ឆ្នាំង', 'province': 'កំពង់ឆ្នាំង'},
        'ប្អេរ': {'district': 'កំពង់ឆ្នាំង', 'province': 'កំពង់ឆ្នាំង'},
        'ខ្សាម': {'district': 'កំពង់ឆ្នាំង', 'province': 'កំពង់ឆ្នាំង'},

        'ច្រណូក': {'district': 'កំពង់លែង', 'province': 'កំពង់ឆ្នាំង'},
        'ដារ': {'district': 'កំពង់លែង', 'province': 'កំពង់ឆ្នាំង'},
        'កំពង់ហៅ': {'district': 'កំពង់លែង', 'province': 'កំពង់ឆ្នាំង'},
        'ផ្លូវទូក': {'district': 'កំពង់លែង', 'province': 'កំពង់ឆ្នាំង'},
        'ពោធិ៍': {'district': 'កំពង់លែង', 'province': 'កំពង់ឆ្នាំង'},
        'ប្រឡាយមាស': {'district': 'កំពង់លែង', 'province': 'កំពង់ឆ្នាំង'},
        'សំរោងសែន': {'district': 'កំពង់លែង', 'province': 'កំពង់ឆ្នាំង'},
        'ស្វាយរំពារ': {'district': 'កំពង់លែង', 'province': 'កំពង់ឆ្នាំង'},
        'ត្រងិល': {'district': 'កំពង់លែង', 'province': 'កំពង់ឆ្នាំង'},

        'អំពិលទឹក': {'district': 'កំពង់ត្រឡាច', 'province': 'កំពង់ឆ្នាំង'},
        'ឈូកស': {'district': 'កំពង់ត្រឡាច', 'province': 'កំពង់ឆ្នាំង'},
        'ច្រេស': {'district': 'កំពង់ត្រឡាច', 'province': 'កំពង់ឆ្នាំង'},
        'កំពង់ត្រឡាច': {'district': 'កំពង់ត្រឡាច', 'province': 'កំពង់ឆ្នាំង'},
        'លង្វែក': {'district': 'កំពង់ត្រឡាច', 'province': 'កំពង់ឆ្នាំង'},
        'អូរឬស្សី': {'district': 'កំពង់ត្រឡាច', 'province': 'កំពង់ឆ្នាំង'},
        'ពានី': {'district': 'កំពង់ត្រឡាច', 'province': 'កំពង់ឆ្នាំង'},
        'សែប': {'district': 'កំពង់ត្រឡាច', 'province': 'កំពង់ឆ្នាំង'},
        'តាជេស': {'district': 'កំពង់ត្រឡាច', 'province': 'កំពង់ឆ្នាំង'},
        'ថ្មឥដ្ឋ': {'district': 'កំពង់ត្រឡាច', 'province': 'កំពង់ឆ្នាំង'},
                                                                                                //កំពង់ឆ្នាំង (4)
        'អណ្ដូងស្នាយ': {'district': 'រលាប្អៀរ', 'province': 'កំពង់ឆ្នាំង'},
        'បន្ទាយព្រាល': {'district': 'រលាប្អៀរ', 'province': 'កំពង់ឆ្នាំង'},
        'ជើងគ្រាវ': {'district': 'រលាប្អៀរ', 'province': 'កំពង់ឆ្នាំង'},
        'ជ្រៃបាក់': {'district': 'រលាប្អៀរ', 'province': 'កំពង់ឆ្នាំង'},
        'គោកបន្ទាយ': {'district': 'រលាប្អៀរ', 'province': 'កំពង់ឆ្នាំង'},
        'ក្រាំងលាវ': {'district': 'រលាប្អៀរ', 'province': 'កំពង់ឆ្នាំង'},
        'ពង្រ': {'district': 'រលាប្អៀរ', 'province': 'កំពង់ឆ្នាំង'},
        'ប្រស្នឹប': {'district': 'រលាប្អៀរ', 'province': 'កំពង់ឆ្នាំង'},
        'ព្រៃមូល': {'district': 'រលាប្អៀរ', 'province': 'កំពង់ឆ្នាំង'},
        'រលាប្អៀរ': {'district': 'រលាប្អៀរ', 'province': 'កំពង់ឆ្នាំង'},
        'ស្រែថ្មី': {'district': 'រលាប្អៀរ', 'province': 'កំពង់ឆ្នាំង'},
        'ស្វាយជ្រុំ': {'district': 'រលាប្អៀរ', 'province': 'កំពង់ឆ្នាំង'},
        'ទឹកហូត': {'district': 'រលាប្អៀរ', 'province': 'កំពង់ឆ្នាំង'},

        'ឈានឡើង': {'district': 'សាមគ្គីមានជ័យ', 'province': 'កំពង់ឆ្នាំង'},
        'ខ្នារឆ្មារ': {'district': 'សាមគ្គីមានជ័យ', 'province': 'កំពង់ឆ្នាំង'},
        'ក្រាំល្វា': {'district': 'សាមគ្គីមានជ័យ', 'province': 'កំពង់ឆ្នាំង'},
        'ពាម': {'district': 'សាមគ្គីមានជ័យ', 'province': 'កំពង់ឆ្នាំង'},
        'សេដ្ឋី': {'district': 'សាមគ្គីមានជ័យ', 'province': 'កំពង់ឆ្នាំង'},
        'ស្វាយ': {'district': 'សាមគ្គីមានជ័យ', 'province': 'កំពង់ឆ្នាំង'},
        'ស្វាយជុក': {'district': 'សាមគ្គីមានជ័យ', 'province': 'កំពង់ឆ្នាំង'},
        'ត្បែងខ្ពស់': {'district': 'សាមគ្គីមានជ័យ', 'province': 'កំពង់ឆ្នាំង'},
        'ធ្លកវៀន': {'district': 'សាមគ្គីមានជ័យ', 'province': 'កំពង់ឆ្នាំង'},

        'អភិវឌ្ឍន៍': {'district': 'ទឹកផុស', 'province': 'កំពង់ឆ្នាំង'},
        'ជៀប': {'district': 'ទឹកផុស', 'province': 'កំពង់ឆ្នាំង'},
        'ចោងម៉ោង': {'district': 'ទឹកផុស', 'province': 'កំពង់ឆ្នាំង'},
        'ក្បាលទឹក': {'district': 'ទឹកផុស', 'province': 'កំពង់ឆ្នាំង'},
        'ខ្លុងពពក': {'district': 'ទឹកផុស', 'province': 'កំពង់ឆ្នាំង'},
        'ក្រាំងស្គារ': {'district': 'ទឹកផុស', 'province': 'កំពង់ឆ្នាំង'},
        'តាំងក្រសាំង': {'district': 'ទឹកផុស', 'province': 'កំពង់ឆ្នាំង'},
        'ទួលខ្ពស់': {'district': 'ទឹកផុស', 'province': 'កំពង់ឆ្នាំង'},
        'ក្តុលសែនជ័យ': {'district': 'ទឹកផុស', 'province': 'កំពង់ឆ្នាំង'},

        
        'បសេដ្ឋ': { district: 'បសេដ្ឋ', province: 'កំពង់ស្ពឺ' },
        'កាត់ភ្លុក': { district: 'បសេដ្ឋ', province: 'កំពង់ស្ពឺ' },
        'និទាន': { district: 'បសេដ្ឋ', province: 'កំពង់ស្ពឺ' },
        'ភក្ដី': { district: 'បសេដ្ឋ', province: 'កំពង់ស្ពឺ' },
        'ភារីមានជ័យ': { district: 'បសេដ្ឋ', province: 'កំពង់ស្ពឺ' },
        'ផុង': { district: 'បសេដ្ឋ', province: 'កំពង់ស្ពឺ' },
        'ពោធិអង្ក្រង': { district: 'បសេដ្ឋ', province: 'កំពង់ស្ពឺ' },
        'ពោធិ៍ចំរើន': { district: 'បសេដ្ឋ', province: 'កំពង់ស្ពឺ' },
        'ពោធិ៍ម្រាល': { district: 'បសេដ្ឋ', province: 'កំពង់ស្ពឺ' },
        'ស្វាយចចិប': { district: 'បសេដ្ឋ', province: 'កំពង់ស្ពឺ' },
        'ទួលអំពិល': { district: 'បសេដ្ឋ', province: 'កំពង់ស្ពឺ' },
        'ទួលសាលា': { district: 'បសេដ្ឋ', province: 'កំពង់ស្ពឺ' },
        'កក់': { district: 'បសេដ្ឋ', province: 'កំពង់ស្ពឺ' },
        'ស្វាយរំពារ': { district: 'បសេដ្ឋ', province: 'កំពង់ស្ពឺ' },
        'ព្រះខែ': { district: 'បសេដ្ឋ', province: 'កំពង់ស្ពឺ' },
      
        // ច្បារមន district
        'ច្បារមន': { district: 'ច្បារមន', province: 'កំពង់ស្ពឺ' },
        'កណ្តោលដុំ': { district: 'ច្បារមន', province: 'កំពង់ស្ពឺ' },
        'រកាធំ': { district: 'ច្បារមន', province: 'កំពង់ស្ពឺ' },
        'ស្វាយក្រវ៉ាន់': { district: 'ច្បារមន', province: 'កំពង់ស្ពឺ' },
        'សុព័រទេព': { district: 'ច្បារមន', province: 'កំពង់ស្ពឺ' },
      
        // គងពិសី district
        'អង្គពពេល': { district: 'គងពិសី', province: 'កំពង់ស្ពឺ' },
        'ជង្រុក': { district: 'គងពិសី', province: 'កំពង់ស្ពឺ' },
        'មហាឫស្សី': { district: 'គងពិសី', province: 'កំពង់ស្ពឺ' },
        'ពេជ្រមុនី': { district: 'គងពិសី', province: 'កំពង់ស្ពឺ' },
        'ព្រះនិព្វាន': { district: 'គងពិសី', province: 'កំពង់ស្ពឺ' },
        'ព្រៃញាតិ': { district: 'គងពិសី', province: 'កំពង់ស្ពឺ' },
        'ព្រៃវិហារ': { district: 'គងពិសី', province: 'កំពង់ស្ពឺ' },
        'រកាកោះ': { district: 'គងពិសី', province: 'កំពង់ស្ពឺ' },
        'ស្ដុក': { district: 'គងពិសី', province: 'កំពង់ស្ពឺ' },
        'ស្នំក្រពើ': { district: 'គងពិសី', province: 'កំពង់ស្ពឺ' },
        'ស្រង់': { district: 'គងពិសី', province: 'កំពង់ស្ពឺ' },
        'ទឹកល្អក់': { district: 'គងពិសី', province: 'កំពង់ស្ពឺ' },
        'វាល': { district: 'គងពិសី', province: 'កំពង់ស្ពឺ' },
      
        // ឱរ៉ាល់ district
        'ហោងសំណំ': { district: 'ឱរ៉ាល់', province: 'កំពង់ស្ពឺ' },
        'រស្មីសាមគ្គី': { district: 'ឱរ៉ាល់', province: 'កំពង់ស្ពឺ' },
        'ត្រពាំងជោ': { district: 'ឱរ៉ាល់', province: 'កំពង់ស្ពឺ' },
        'សង្កែសាទប': { district: 'ឱរ៉ាល់', province: 'កំពង់ស្ពឺ' },
        'តាសាល': { district: 'ឱរ៉ាល់', province: 'កំពង់ស្ពឺ' },
      
        // ក្រុងឧដុង្គម៉ែជ័យ
        'វាំងចាស់': { district: 'ក្រុងឧដុង្គម៉ែជ័យ', province: 'កំពង់ស្ពឺ' },
        'វាលពង់': { district: 'ក្រុងឧដុង្គម៉ែជ័យ', province: 'កំពង់ស្ពឺ' },
        'ត្រាចទង': { district: 'ក្រុងឧដុង្គម៉ែជ័យ', province: 'កំពង់ស្ពឺ' },
        'ព្រះស្រែ': { district: 'ក្រុងឧដុង្គម៉ែជ័យ', province: 'កំពង់ស្ពឺ' },
        'ក្សេមក្សាន្ត': { district: 'ក្រុងឧដុង្គម៉ែជ័យ', province: 'កំពង់ស្ពឺ' },
        'ក្រាំងចេក': { district: 'ក្រុងឧដុង្គម៉ែជ័យ', province: 'កំពង់ស្ពឺ' },
        'ចាន់សែន': { district: 'ក្រុងឧដុង្គម៉ែជ័យ', province: 'កំពង់ស្ពឺ' },
        'ជំពូព្រឹក្ស': { district: 'ក្រុងឧដុង្គម៉ែជ័យ', province: 'កំពង់ស្ពឺ' },
        'ព្រៃក្រសាំង': { district: 'ក្រុងឧដុង្គម៉ែជ័យ', province: 'កំពង់ស្ពឺ' },
        'ភ្នំតូច': { district: 'ក្រុងឧដុង្គម៉ែជ័យ', province: 'កំពង់ស្ពឺ' },
        'យុទ្ធសាមគ្កី': { district: 'ក្រុងឧដុង្គម៉ែជ័យ', province: 'កំពង់ស្ពឺ' },
        'ជើងរាស់': { district: 'ក្រុងឧដុង្គម៉ែជ័យ', province: 'កំពង់ស្ពឺ' },
        'ដំណាក់រាំង': { district: 'ក្រុងឧដុង្គម៉ែជ័យ', province: 'កំពង់ស្ពឺ' },
        'ពាំងល្វា': { district: 'ក្រុងឧដុង្គម៉ែជ័យ', province: 'កំពង់ស្ពឺ' },
        'មានជ័យ': { district: 'ក្រុងឧដុង្គម៉ែជ័យ', province: 'កំពង់ស្ពឺ' },
      
        // ភ្នំស្រួច district
        'ចំបក់': { district: 'ភ្នំស្រួច', province: 'កំពង់ស្ពឺ' },
        'ជាំសង្កែ': { district: 'ភ្នំស្រួច', province: 'កំពង់ស្ពឺ' },
        'ដំបូករូង': { district: 'ភ្នំស្រួច', province: 'កំពង់ស្ពឺ' },
        'គិរីវន្ត': { district: 'ភ្នំស្រួច', province: 'កំពង់ស្ពឺ' },
        'ក្រាំងដីវ៉ាយ': { district: 'ភ្នំស្រួច', province: 'កំពង់ស្ពឺ' },
        'មហាសាំង': { district: 'ភ្នំស្រួច', province: 'កំពង់ស្ពឺ' },
        'អូរ': { district: 'ភ្នំស្រួច', province: 'កំពង់ស្ពឺ' },
        'ព្រៃរំដួល': { district: 'ភ្នំស្រួច', province: 'កំពង់ស្ពឺ' },
        'ព្រៃក្មេង': { district: 'ភ្នំស្រួច', province: 'កំពង់ស្ពឺ' },
        'តាំងសំរោង': { district: 'ភ្នំស្រួច', province: 'កំពង់ស្ពឺ' },
        'តាំងស្យា': { district: 'ភ្នំស្រួច', province: 'កំពង់ស្ពឺ' },
        'ត្រែងត្រយឹង': { district: 'ភ្នំស្រួច', province: 'កំពង់ស្ពឺ' },
      
        // សំរោងទង district
        'រលាំងចក': { district: 'សំរោងទង', province: 'កំពង់ស្ពឺ' },
        'កាហែង': { district: 'សំរោងទង', province: 'កំពង់ស្ពឺ' },
        'ខ្ទុំក្រាំង': { district: 'សំរោងទង', province: 'កំពង់ស្ពឺ' },
        'ក្រាំងអំពិល': { district: 'សំរោងទង', province: 'កំពង់ស្ពឺ' },
        'ព្នាយ': { district: 'សំរោងទង', province: 'កំពង់ស្ពឺ' },
        'រលាំងគ្រើល': { district: 'សំរោងទង', province: 'កំពង់ស្ពឺ' },
        'សំរោងទង': { district: 'សំរោងទង', province: 'កំពង់ស្ពឺ' },
        'សំបូរ': { district: 'សំរោងទង', province: 'កំពង់ស្ពឺ' },
        'សែងដី': { district: 'សំរោងទង', province: 'កំពង់ស្ពឺ' },
        'ស្គុះ': { district: 'សំរោងទង', province: 'កំពង់ស្ពឺ' },
        'តាំងក្រូច': { district: 'សំរោងទង', province: 'កំពង់ស្ពឺ' },
        'ធម្មតាអរ': { district: 'សំរោងទង', province: 'កំពង់ស្ពឺ' },
        'ត្រពាំងគង': { district: 'សំរោងទង', province: 'កំពង់ស្ពឺ' },
        'ទំព័រមាស': { district: 'សំរោងទង', province: 'កំពង់ស្ពឺ' },
        'វល្លិសរ': { district: 'សំរោងទង', province: 'កំពង់ស្ពឺ' },
      
        // ថ្ពង district
        'អមលាំង': { district: 'ថ្ពង', province: 'កំពង់ស្ពឺ' },
        'មនោរម្យ': { district: 'ថ្ពង', province: 'កំពង់ស្ពឺ' },
        'ប្រាំបីមុម': { district: 'ថ្ពង', province: 'កំពង់ស្ពឺ' },
        'រុងរឿង': { district: 'ថ្ពង', province: 'កំពង់ស្ពឺ' },
        'ទ័ពមាន': { district: 'ថ្ពង', province: 'កំពង់ស្ពឺ' },
        'វាលពន់': { district: 'ថ្ពង', province: 'កំពង់ស្ពឺ' },
        'យាអង្គ': { district: 'ថ្ពង', province: 'កំពង់ស្ពឺ' },

        /////កំពង់ស្ពឺ [5]






        'គង់សំរឹទ្ធឧត្ដម': {'district': 'បារាយណ៍', 'province': 'កំពង់ធំ'},
        'បល្ល័ង្ក': {'district': 'បារាយណ៍', 'province': 'កំពង់ធំ'},
        'បឹង': {'district': 'បារាយណ៍', 'province': 'កំពង់ធំ'},
        'ចើងដើង': {'district': 'បារាយណ៍', 'province': 'កំពង់ធំ'},
        'ច្រនាង': {'district': 'តាំងគោក', 'province': 'កំពង់ធំ'},
        'ឈូកខ្សាច់': {'district': 'បារាយណ៍', 'province': 'កំពង់ធំ'},
        'ចុងដូង': {'district': 'បារាយណ៍', 'province': 'កំពង់ធំ'},
        'ជ្រលង': {'district': 'តាំងគោក', 'province': 'កំពង់ធំ'},
        'គគីរធំ': {'district': 'បារាយណ៍', 'province': 'កំពង់ធំ'},
        'ក្រវ៉ា': {'district': 'បារាយណ៍', 'province': 'កំពង់ធំ'},
        'អណ្តូងពោធិ៍': {'district': 'តាំងគោក', 'province': 'កំពង់ធំ'},
        'ពង្រ': {'district': 'តាំងគោក', 'province': 'កំពង់ធំ'},
        'សូយោង': {'district': 'តាំងគោក', 'province': 'កំពង់ធំ'},
        'ស្រឡៅ': {'district': 'តាំងគោក', 'province': 'កំពង់ធំ'},
        'ស្វាយភ្លើង': {'district': 'តាំងគោក', 'province': 'កំពង់ធំ'},
        'ត្នោតជុំ': {'district': 'បារាយណ៍', 'province': 'កំពង់ធំ'},
        'ទ្រៀល': {'district': 'តាំងគោក', 'province': 'កំពង់ធំ'},
        'ជ័យ': {'district': 'កំពង់ស្វាយ', 'province': 'កំពង់ធំ'},
        'ដំរីស្លាប់': {'district': 'កំពង់ស្វាយ', 'province': 'កំពង់ធំ'},
        'កំពង់គោ': {'district': 'កំពង់ស្វាយ', 'province': 'កំពង់ធំ'},
        'កំពង់ស្វាយ': {'district': 'កំពង់ស្វាយ', 'province': 'កំពង់ធំ'},
        'នីពេជ': {'district': 'កំពង់ស្វាយ', 'province': 'កំពង់ធំ'},
        'ផាត់សណ្តាយ': {'district': 'កំពង់ស្វាយ', 'province': 'កំពង់ធំ'},
        'សាន់គ': {'district': 'កំពង់ស្វាយ', 'province': 'កំពង់ធំ'},
        'ត្បែង': {'district': 'កំពង់ស្វាយ', 'province': 'កំពង់ធំ'},
        'ត្រពាំងឫស្សី': {'district': 'កំពង់ស្វាយ', 'province': 'កំពង់ធំ'},
        'ក្ដីដូង': {'district': 'កំពង់ស្វាយ', 'province': 'កំពង់ធំ'},
        'ព្រៃគុយ': {'district': 'កំពង់ស្វាយ', 'province': 'កំពង់ធំ'},
        'ព្រៃតាហ៊ូ': {'district': 'ស្ទឹងសែន', 'province': 'កំពង់ធំ'},
        'អាចារ្យលាក់': {'district': 'ស្ទឹងសែន', 'province': 'កំពង់ធំ'},
        'កំពង់ធំ': {'district': 'ស្ទឹងសែន', 'province': 'កំពង់ធំ'},
        'ដំរីជាន់ខ្លា': {'district': 'ស្ទឹងសែន', 'province': 'កំពង់ធំ'},
        'ស្រយ៉ូវ': {'district': 'ស្ទឹងសែន', 'province': 'កំពង់ធំ'},
        'អូរកន្ធរ': {'district': 'ស្ទឹងសែន', 'province': 'កំពង់ធំ'},
        'ដូង': {'district': 'ប្រាសាទបល្ល័ង្ក', 'province': 'កំពង់ធំ'},
        'ក្រយា': {'district': 'សន្ទុក', 'province': 'កំពង់ធំ'},
        'ផាន់ញើម': {'district': 'ប្រាសាទបល្ល័ង្ក', 'province': 'កំពង់ធំ'},
        'សាគ្រាម': {'district': 'ប្រាសាទបល្ល័ង្ក', 'province': 'កំពង់ធំ'},
        'សាលាវិស័យ': {'district': 'ប្រាសាទបល្ល័ង្ក', 'province': 'កំពង់ធំ'},
        'សាមគ្គី': {'district': 'ប្រាសាទបល្ល័ង្ក', 'province': 'កំពង់ធំ'},
        'ទួលគ្រើល': {'district': 'ប្រាសាទបល្ល័ង្ក', 'province': 'កំពង់ធំ'},
        'ឈូក': {'district': 'ប្រាសាទសំបូរ', 'province': 'កំពង់ធំ'},
        'គោល': {'district': 'ប្រាសាទសំបូរ', 'province': 'កំពង់ធំ'},
        'សំបូរណ៍': {'district': 'ប្រាសាទសំបូរ', 'province': 'កំពង់ធំ'},
        'ស្រើង': {'district': 'ប្រាសាទសំបូរ', 'province': 'កំពង់ធំ'},
        'តាំងក្រសៅ': {'district': 'ប្រាសាទសំបូរ', 'province': 'កំពង់ធំ'},
        'ឈើទាល': {'district': 'សណ្ដាន់', 'province': 'កំពង់ធំ'},
        'ដងកាំបិត': {'district': 'សណ្ដាន់', 'province': 'កំពង់ធំ'},
        'ក្លែង': {'district': 'សណ្ដាន់', 'province': 'កំពង់ធំ'},
        'មានរិទ្ធ': {'district': 'សណ្ដាន់', 'province': 'កំពង់ធំ'},
        'មានជ័យ': {'district': 'សណ្ដាន់', 'province': 'កំពង់ធំ'},
        'ងន': {'district': 'សណ្ដាន់', 'province': 'កំពង់ធំ'},
        'សណ្ដាន់': {'district': 'សណ្ដាន់', 'province': 'កំពង់ធំ'},         
        'សុចិត្រ': {'district': 'សណ្ដាន់', 'province': 'កំពង់ធំ'},
        'ទំរីង': {'district': 'សណ្ដាន់', 'province': 'កំពង់ធំ'},
        'បឹងល្វា': {'district': 'សន្ទុក', 'province': 'កំពង់ធំ'},
        'ជ្រាប់': {'district': 'សន្ទុក', 'province': 'កំពង់ធំ'},
        'កំពង់ថ្ម': {'district': 'សន្ទុក', 'province': 'កំពង់ធំ'},
        'កកោះ': {'district': 'សន្ទុក', 'province': 'កំពង់ធំ'},
        'ព្នៅ': {'district': 'សន្ទុក', 'province': 'កំពង់ធំ'},
        'ប្រាសាទ': {'district': 'សន្ទុក', 'province': 'កំពង់ធំ'},
        'តាំងក្រសាំង': {'district': 'សន្ទុក', 'province': 'កំពង់ធំ'},
        'ទីពោ': {'district': 'សន្ទុក', 'province': 'កំពង់ធំ'},
        'ត្បូងក្រពើ': {'district': 'សន្ទុក', 'province': 'កំពង់ធំ'},
        'បន្ទាយស្ទោង': {'district': 'ស្ទោង', 'province': 'កំពង់ធំ'},
        'ចំណាក្រោម': {'district': 'ស្ទោង', 'province': 'កំពង់ធំ'},
        'ចំណាលើ': {'district': 'ស្ទោង', 'province': 'កំពង់ធំ'},
        'កំពង់ចិនជើង': {'district': 'ស្ទោង', 'province': 'កំពង់ធំ'},
        'កំពង់ចិនត្បូង': {'district': 'ស្ទោង', 'province': 'កំពង់ធំ'},
        'ម្សាក្រង': {'district': 'ស្ទោង', 'province': 'កំពង់ធំ'},
        'ពាមបាង': {'district': 'ស្ទោង', 'province': 'កំពង់ធំ'},
        'ពពក': {'district': 'ស្ទោង', 'province': 'កំពង់ធំ'},
        'ប្រឡាយ': {'district': 'ស្ទោង', 'province': 'កំពង់ធំ'},
        'ព្រះដំរី': {'district': 'ស្ទោង', 'province': 'កំពង់ធំ'},
        'រុងរឿង': {'district': 'ស្ទោង', 'province': 'កំពង់ធំ'},
        'សំព្រោជ': {'district': 'ស្ទោង', 'province': 'កំពង់ធំ'},
        'ទ្រា': {'district': 'ស្ទោង', 'province': 'កំពង់ធំ'},
        "សូយោង": { "district": "តាំងគោក", "province": "កំពង់ធំ" },
        "ច្រនាង": { "district": "តាំងគោក", "province": "កំពង់ធំ" },
        "ជ្រលង": { "district": "តាំងគោក", "province": "កំពង់ធំ" },
        "អណ្តូងពោធិ៍": { "district": "តាំងគោក", "province": "កំពង់ធំ" },
        "ពង្រ": { "district": "តាំងគោក", "province": "កំពង់ធំ" },
        "ស្រឡៅ": { "district": "តាំងគោក", "province": "កំពង់ធំ" },
        "ស្វាយភ្លើង": { "district": "តាំងគោក", "province": "កំពង់ធំ" },
        "ទ្រៀល": { "district": "តាំងគោក", "province": "កំពង់ធំ" },

        /////កំពង់ធំ [6]


        "អង្គភ្នំតូច": { "district": "អង្គរជ័យ", "province": "កំពត" },
        "អង្គរជ័យ": { "district": "អង្គរជ័យ", "province": "កំពត" },
        "ចំប៉ី": { "district": "អង្គរជ័យ", "province": "កំពត" },
        "ដំបូកខ្ពស់": { "district": "អង្គរជ័យ", "province": "កំពត" },
        "ដានគោម": { "district": "អង្គរជ័យ", "province": "កំពត" },
        "ដើមដូង": { "district": "អង្គរជ័យ", "province": "កំពត" },
        "ម្រោម": { "district": "អង្គរជ័យ", "province": "កំពត" },
        "ភ្នំកុង": { "district": "អង្គរជ័យ", "province": "កំពត" },
        "ប្រភ្នំ": { "district": "អង្គរជ័យ", "province": "កំពត" },
        "សំឡាញ": { "district": "អង្គរជ័យ", "province": "កំពត" },
        "តានី": { "district": "អង្គរជ័យ", "province": "កំពត" },
      
        "បន្ទាយមាសខាងកើត": { "district": "បន្ទាយមាស", "province": "កំពត" },
        "បន្ទាយមាសខាងលិច": { "district": "បន្ទាយមាស", "province": "កំពត" },
        "ព្រៃទន្លេ": { "district": "បន្ទាយមាស", "province": "កំពត" },
        "សំរោងក្រោម": { "district": "បន្ទាយមាស", "province": "កំពត" },
        "សំរោងលើ": { "district": "បន្ទាយមាស", "province": "កំពត" },
        "ស្ដេចគង់ខាងជើង": { "district": "បន្ទាយមាស", "province": "កំពត" },
        "ស្ដេចគង់ខាងលិច": { "district": "បន្ទាយមាស", "province": "កំពត" },
        "ស្ដេចគង់ខាងត្បូង": { "district": "បន្ទាយមាស", "province": "កំពត" },
        "ត្នោតចុងស្រង់": { "district": "បន្ទាយមាស", "province": "កំពត" },
        "ត្រពាំងសាលាខាងកើត": { "district": "បន្ទាយមាស", "province": "កំពត" },
        "ត្រពាំងសាលាខាងលិច": { "district": "បន្ទាយមាស", "province": "កំពត" },
        "ទូកមាសខាងកើត": { "district": "បន្ទាយមាស", "province": "កំពត" },
        "ទូកមាសខាងលិច": { "district": "បន្ទាយមាស", "province": "កំពត" },
        "វត្ដអង្គខាងជើង": { "district": "បន្ទាយមាស", "province": "កំពត" },
        "វត្ដអង្គខាងត្បូង": { "district": "បន្ទាយមាស", "province": "កំពត" },
      
        "បានៀវ": { "district": "ឈូក", "province": "កំពត" },
        "តាកែន": { "district": "ឈូក", "province": "កំពត" },
        "បឹងនិមល": { "district": "ឈូក", "province": "កំពត" },
        "ឈូក": { "district": "ឈូក", "province": "កំពត" },
        "ដូនយ៉យ": { "district": "ឈូក", "province": "កំពត" },
        "ក្រាំងស្បូវ": { "district": "ឈូក", "province": "កំពត" },
        "ក្រាំងស្នាយ": { "district": "ឈូក", "province": "កំពត" },
        "ល្បើក": { "district": "ឈូក", "province": "កំពត" },
        "ត្រពាំងភ្លាំង": { "district": "ឈូក", "province": "កំពត" },
        "មានជ័យ": { "district": "ឈូក", "province": "កំពត" },
        "នារាយណ៍": { "district": "ឈូក", "province": "កំពត" },
        "សត្វពង": { "district": "ឈូក", "province": "កំពត" },
        "ត្រពាំងបី": { "district": "ឈូក", "province": "កំពត" },
        "ត្រមែង": { "district": "ឈូក", "province": "កំពត" },
        "តេជោអភិវឌ្ឍន៍": { "district": "ឈូក", "province": "កំពត" },
      
        "ច្រេស": { "district": "ជុំគីរី", "province": "កំពត" },
        "ជំពូវន្ដ": { "district": "ជុំគីរី", "province": "កំពត" },
        "ស្នាយអញ្ជិត": { "district": "ជុំគីរី", "province": "កំពត" },
        "ស្រែចែង": { "district": "ជុំគីរី", "province": "កំពត" },
        "ស្រែក្នុង": { "district": "ជុំគីរី", "province": "កំពត" },
        "ស្រែសំរោង": { "district": "ជុំគីរី", "province": "កំពត" },
        "ត្រពាំងរាំង": { "district": "ជុំគីរី", "province": "កំពត" },
      
        "ដំណាក់សុក្រំ": { "district": "ដងទង់", "province": "កំពត" },
        "ដងទង់": { "district": "ដងទង់", "province": "កំពត" },
        "ខ្ជាយខាងជើង": { "district": "ដងទង់", "province": "កំពត" },
        "ខ្ជាយខាងត្បូង": { "district": "ដងទង់", "province": "កំពត" },
        "មានរិទ្ធិ": { "district": "ដងទង់", "province": "កំពត" },
        "ស្រែជាខាងជើង": { "district": "ដងទង់", "province": "កំពត" },
        "ស្រែជាខាងត្បូង": { "district": "ដងទង់", "province": "កំពត" },
        "ទទុង": { "district": "ដងទង់", "province": "កំពត" },
        "អង្គរមាស": { "district": "ដងទង់", "province": "កំពត" },
        "ល្អាង": { "district": "ដងទង់", "province": "កំពត" },
      
        "បឹងសាលាខាងជើង": { "district": "កំពង់ត្រាច", "province": "កំពត" },
        "បឹងសាលាខាងត្បូង": { "district": "កំពង់ត្រាច", "province": "កំពត" },
        "ដំណាក់កន្ទួតខាងជើង": { "district": "កំពង់ត្រាច", "province": "កំពត" },
        "ដំណាក់កន្ទួតខាងត្បូង": { "district": "កំពង់ត្រាច", "province": "កំពត" },
        "កំពង់ត្រាចខាងកើត": { "district": "កំពង់ត្រាច", "province": "កំពត" },
        "កំពង់ត្រាចខាងលិច": { "district": "កំពង់ត្រាច", "province": "កំពត" },
        "ប្រាសាទភ្នំខ្យង": { "district": "កំពង់ត្រាច", "province": "កំពត" },
        "ភ្នំប្រាសាទ": { "district": "កំពង់ត្រាច", "province": "កំពត" },
        "អង្គសុរភី": { "district": "កំពង់ត្រាច", "province": "កំពត" },
        "ព្រែកក្រឹស": { "district": "កំពង់ត្រាច", "province": "កំពត" },
        "ឫស្សីស្រុកខាងកើត": { "district": "កំពង់ត្រាច", "province": "កំពត" },
        "ឫស្សីស្រុកខាងលិច": { "district": "កំពង់ត្រាច", "province": "កំពត" },
        "ស្វាយទងខាងជើង": { "district": "កំពង់ត្រាច", "province": "កំពត" },
        "ស្វាយទងខាងត្បូង": { "district": "កំពង់ត្រាច", "province": "កំពត" },
      
        "បឹងទូក": { "district": "ទឹកឈូ", "province": "កំពត" },
        "ជុំគ្រៀល": { "district": "ទឹកឈូ", "province": "កំពត" },
        "កំពង់ក្រែង": { "district": "ទឹកឈូ", "province": "កំពត" },
        "កំពង់សំរោង": { "district": "ទឹកឈូ", "province": "កំពត" },
        "កណ្ដោល": { "district": "ទឹកឈូ", "province": "កំពត" },
        "កោះតូច": { "district": "ទឹកឈូ", "province": "កំពត" },
        "កូនសត្វ": { "district": "ទឹកឈូ", "province": "កំពត" },
        "ម៉ាក់ប្រាង្គ": { "district": "ទឹកឈូ", "province": "កំពត" },
        "ព្រែកត្នោត": { "district": "ទឹកឈូ", "province": "កំពត" },
        "ព្រៃឃ្មុំ": { "district": "ទឹកឈូ", "province": "កំពត" },
        "ព្រៃថ្នង": { "district": "ទឹកឈូ", "province": "កំពត" },
        "ស្ទឹងកែវ": { "district": "ទឹកឈូ", "province": "កំពត" },
        "ថ្មី": { "district": "ទឹកឈូ", "province": "កំពត" },
        "ត្រពាំងព្រីង": { "district": "ទឹកឈូ", "province": "កំពត" },
        "ត្រពាំងសង្កែ": { "district": "ទឹកឈូ", "province": "កំពត" },
        "ត្រពាំងធំ": { "district": "ទឹកឈូ", "province": "កំពត" },
      
        "កំពង់កណ្ដាល": { "district": "ក្រុងកំពត", "province": "កំពត" },
        "ក្រាំងអំពិល": { "district": "ក្រុងកំពត", "province": "កំពត" },
        "កំពង់បាយ": { "district": "ក្រុងកំពត", "province": "កំពត" },
        "អណ្ដូងខ្មែរ": { "district": "ក្រុងកំពត", "province": "កំពត" },
        "ត្រើយកោះ": { "district": "ក្រុងកំពត", "province": "កំពត" },

        ///កំពត [7]
        


        "កណ្ដាល": { "district": "កណ្ដាលស្ទឹង", "province": "កណ្តាល" },
        "អំពៅព្រៃ": { "district": "កណ្ដាលស្ទឹង", "province": "កណ្តាល" },
        "អន្លង់រមៀត": { "district": "កណ្ដាលស្ទឹង", "province": "កណ្តាល" },
        "បារគូ": { "district": "កណ្ដាលស្ទឹង", "province": "កណ្តាល" },
        "បឹងខ្យាង": { "district": "កណ្ដាលស្ទឹង", "province": "កណ្តាល" },
        "ជើងកើប": { "district": "កណ្ដាលស្ទឹង", "province": "កណ្តាល" },
        "ដើមឫស": { "district": "កណ្ដាលស្ទឹង", "province": "កណ្តាល" },
        "កណ្តោក": { "district": "កណ្ដាលស្ទឹង", "province": "កណ្តាល" },
        "ថ្មី": { "district": "កណ្ដាលស្ទឹង", "province": "កណ្តាល" },
        "គោកត្រប់": { "district": "កណ្ដាលស្ទឹង", "province": "កណ្តាល" },
        "ព្រះពុទ្ធ": { "district": "កណ្ដាលស្ទឹង", "province": "កណ្តាល" },
        "ព្រែករកា": { "district": "កណ្ដាលស្ទឹង", "province": "កណ្តាល" },
        "ព្រែកស្លែង": { "district": "កណ្ដាលស្ទឹង", "province": "កណ្តាល" },
        "រកា": { "district": "កណ្ដាលស្ទឹង", "province": "កណ្តាល" },
        "រលាំងកែន": { "district": "កណ្ដាលស្ទឹង", "province": "កណ្តាល" },
        "សៀមរាប": { "district": "កណ្ដាលស្ទឹង", "province": "កណ្តាល" },
        "ត្បែង": { "district": "កណ្ដាលស្ទឹង", "province": "កណ្តាល" },
        "ត្រពាំងវែង": { "district": "កណ្ដាលស្ទឹង", "province": "កណ្តាល" },
        "ទ្រា": { "district": "កណ្ដាលស្ទឹង", "province": "កណ្តាល" },
      
        "បន្ទាយដែក": { "district": "កៀនស្វាយ", "province": "កណ្តាល" },
        "ឈើទាល": { "district": "កៀនស្វាយ", "province": "កណ្តាល" },
        "ដីឥដ្ឋ": { "district": "កៀនស្វាយ", "province": "កណ្តាល" },
        "កំពង់ស្វាយ": { "district": "កៀនស្វាយ", "province": "កណ្តាល" },
        "គគីរ": { "district": "កៀនស្វាយ", "province": "កណ្តាល" },
        "គគីរធំ(កៀនស្វាយ)": { "district": "កៀនស្វាយ", "province": "កណ្តាល" },
        "ភូមិធំ": { "district": "កៀនស្វាយ", "province": "កណ្តាល" },
        "សំរោងធំ": { "district": "កៀនស្វាយ", "province": "កណ្តាល" },
      
        "ជ័យធំ": { "district": "ខ្សាច់កណ្ដាល", "province": "កណ្តាល" },
        "កំពង់ចំលង": { "district": "ខ្សាច់កណ្ដាល", "province": "កណ្តាល" },
        "កោះចូរ៉ាម": { "district": "ខ្សាច់កណ្ដាល", "province": "កណ្តាល" },
        "ព្រះប្រសប់": { "district": "ខ្សាច់កណ្ដាល", "province": "កណ្តាល" },
        "ព្រែកតាមាក់": { "district": "ខ្សាច់កណ្ដាល", "province": "កណ្តាល" },
        "ពុកឫស្សី": { "district": "ខ្សាច់កណ្ដាល", "province": "កណ្តាល" },
        "រកាជន្លឹង": { "district": "ខ្សាច់កណ្ដាល", "province": "កណ្តាល" },
        "សន្លុង": { "district": "ខ្សាច់កណ្ដាល", "province": "កណ្តាល" },
        "ស៊ីធរ": { "district": "ខ្សាច់កណ្ដាល", "province": "កណ្តាល" },
        "ស្វាយរមៀត": { "district": "ខ្សាច់កណ្ដាល", "province": "កណ្តាល" },
        "តាឯក": { "district": "ខ្សាច់កណ្ដាល", "province": "កណ្តាល" },
        "វិហារសួគ៌": { "district": "ខ្សាច់កណ្ដាល", "province": "កណ្តាល" },
      
        "បាក់ដាវ": { "district": "ក្រុងអរិយក្សត្រ", "province": "កណ្តាល" },
        "កោះឧកញ៉ាតី": { "district": "ក្រុងអរិយក្សត្រ", "province": "កណ្តាល" },
        "ព្រែកអំពិល": { "district": "ក្រុងអរិយក្សត្រ", "province": "កណ្តាល" },
        "ព្រែកលួង": { "district": "ក្រុងអរិយក្សត្រ", "province": "កណ្តាល" },
        "ព្រែកតាកូវ": { "district": "ក្រុងអរិយក្សត្រ", "province": "កណ្តាល" },
        "ស្វាយជ្រុំ": { "district": "ក្រុងអរិយក្សត្រ", "province": "កណ្តាល" },
      
        "កំពង់កុង": { "district": "កោះធំ", "province": "កណ្តាល" },
        "កោះធំ ក": { "district": "កោះធំ", "province": "កណ្តាល" },
        "កោះធំ ខ": { "district": "កោះធំ", "province": "កណ្តាល" },
        "លើកដែក": { "district": "កោះធំ", "province": "កណ្តាល" },
        "ពោធិ៍បាន": { "district": "កោះធំ", "province": "កណ្តាល" },
        "ព្រែកថ្មី": { "district": "កោះធំ", "province": "កណ្តាល" },
      
        "កំពង់ភ្នំ": { "district": "លើកដែក", "province": "កណ្តាល" },
        "ក្អមសំណ": { "district": "លើកដែក", "province": "កណ្តាល" },
        "ខ្ពបអាទាវ": { "district": "លើកដែក", "province": "កណ្តាល" },
        "ពាមរាំង": { "district": "លើកដែក", "province": "កណ្តាល" },
        "ព្រែកដាច់": { "district": "លើកដែក", "province": "កណ្តាល" },
        "ព្រែកទន្លាប់": { "district": "លើកដែក", "province": "កណ្តាល" },
        "សណ្ដារ": { "district": "លើកដែក", "province": "កណ្តាល" },
      
        "អរិយក្សត្រ": { "district": "ល្វាឯម", "province": "កណ្តាល" },
        "បារុង": { "district": "ល្វាឯម", "province": "កណ្តាល" },
        "បឹងគ្រំ": { "district": "ល្វាឯម", "province": "កណ្តាល" },
        "កោះកែវ": { "district": "ល្វាឯម", "province": "កណ្តាល" },
        "កោះរះ": { "district": "ល្វាឯម", "province": "កណ្តាល" },
        "ល្វាសរ": { "district": "ល្វាឯម", "province": "កណ្តាល" },
        "ពាមឧកញ៉ាអុង": { "district": "ល្វាឯម", "province": "កណ្តាល" },
        "ភូមិធំ": { "district": "ល្វាឯម", "province": "កណ្តាល" },
        "ព្រែកក្មេង": { "district": "ល្វាឯម", "province": "កណ្តាល" },
        "ព្រែករៃ": { "district": "ល្វាឯម", "province": "កណ្តាល" },
        "ព្រែកឫស្សី": { "district": "ល្វាឯម", "province": "កណ្តាល" },
        "សំបួរ": { "district": "ល្វាឯម", "province": "កណ្តាល" },
        "សារិកាកែវ": { "district": "ល្វាឯម", "province": "កណ្តាល" },
        "ថ្មគរ": { "district": "ល្វាឯម", "province": "កណ្តាល" },
        "ទឹកឃ្លាំង": { "district": "ល្វាឯម", "province": "កណ្តាល" },
      
        "ព្រែកអញ្ចាញ": { "district": "មុខកំពូល", "province": "កណ្តាល" },
        "ព្រែកដំបង": { "district": "មុខកំពូល", "province": "កណ្តាល" },
        "រកាកោងទី១": { "district": "មុខកំពូល", "province": "កណ្តាល" },
        "រកាកោងទី២": { "district": "មុខកំពូល", "province": "កណ្តាល" },
        "ឫស្សីជ្រោយ": { "district": "មុខកំពូល", "province": "កណ្តាល" },
        "សំបួរមាស": { "district": "មុខកំពូល", "province": "កណ្តាល" },
        "ស្វាយអំពារ": { "district": "មុខកំពូល", "province": "កណ្តាល" },
      
        "បែកចាន": { "district": "អង្គស្នួល", "province": "កណ្តាល" },
        "ឆក់ឈើនាង": { "district": "អង្គស្នួល", "province": "កណ្តាល" },
        "ដំណាក់អំពិល": { "district": "អង្គស្នួល", "province": "កណ្តាល" },
        "ក្រាំងម្កាក់": { "district": "អង្គស្នួល", "province": "កណ្តាល" },
        "លំហាច": { "district": "អង្គស្នួល", "province": "កណ្តាល" },
        "ម្កាក់": { "district": "អង្គស្នួល", "province": "កណ្តាល" },
        "ពើក": { "district": "អង្គស្នួល", "province": "កណ្តាល" },
        "ពន្សាំង": { "district": "អង្គស្នួល", "province": "កណ្តាល" },
        "ព្រៃពួច": { "district": "អង្គស្នួល", "province": "កណ្តាល" },
        "សំរោងលើ": { "district": "អង្គស្នួល", "province": "កណ្តាល" },
        "ទួលព្រេជ": { "district": "អង្គស្នួល", "province": "កណ្តាល" },
      
        "ឈ្វាំង": { "district": "ពញាឮ", "province": "កណ្តាល" },
        "ជ្រៃលាស់": { "district": "ពញាឮ", "province": "កណ្តាល" },
        "កំពង់ហ្លួង": { "district": "ពញាឮ", "province": "កណ្តាល" },
        "កំពង់អុស": { "district": "ពញាឮ", "province": "កណ្តាល" },
        "កោះចិន": { "district": "ពញាឮ", "province": "កណ្តាល" },
        "ភ្នំបាត": { "district": "ពញាឮ", "province": "កណ្តាល" },
        "ពញាឮ": { "district": "ពញាឮ", "province": "កណ្តាល" },
        "ព្រែកតាទែន": { "district": "ពញាឮ", "province": "កណ្តាល" },
        "ផ្សារដែក": { "district": "ពញាឮ", "province": "កណ្តាល" },
        "ទំនប់ធំ": { "district": "ពញាឮ", "province": "កណ្តាល" },
        "វិហារហ្លួង": { "district": "ពញាឮ", "province": "កណ្តាល" },
      
        "ខ្ពប": { "district": "ស្អាង", "province": "កណ្តាល" },
        "កោះអន្លង់ចិន": { "district": "ស្អាង", "province": "កណ្តាល" },
        "កោះខែល": { "district": "ស្អាង", "province": "កណ្តាល" },
        "កោះខ្សាច់ទន្លា": { "district": "ស្អាង", "province": "កណ្តាល" },
        "ក្រាំងយ៉ូវ": { "district": "ស្អាង", "province": "កណ្តាល" },
        "ប្រាសាទ": { "district": "ស្អាង", "province": "កណ្តាល" },
        "ព្រែអំពិល": { "district": "ស្អាង", "province": "កណ្តាល" },
        "ព្រែកគយ": { "district": "ស្អាង", "province": "កណ្តាល" },
        "រកាខ្ពស់": { "district": "ស្អាង", "province": "កណ្តាល" },
        "ស្អាងភ្នំ": { "district": "ស្អាង", "province": "កណ្តាល" },
        "សិត្បូ": { "district": "ស្អាង", "province": "កណ្តាល" },
        "ស្វាយប្រទាល": { "district": "ស្អាង", "province": "កណ្តាល" },
        "ស្វាយរលំ": { "district": "ស្អាង", "province": "កណ្តាល" },
        "តាលន់": { "district": "ស្អាង", "province": "កណ្តាល" },
        "ត្រើយស្លា": { "district": "ស្អាង", "province": "កណ្តាល" },
        "ទឹកវិល": { "district": "ស្អាង", "province": "កណ្តាល" },
      
        "តាក្ដុល": { "district": "ក្រុងតាខ្មៅ", "province": "កណ្តាល" },
        "ព្រែកឫស្សី": { "district": "ក្រុងតាខ្មៅ", "province": "កណ្តាល" },
        "ដើមមៀន": { "district": "ក្រុងតាខ្មៅ", "province": "កណ្តាល" },
        "តាខ្មៅ": { "district": "ក្រុងតាខ្មៅ", "province": "កណ្តាល" },
        "ព្រែកហូរ": { "district": "ក្រុងតាខ្មៅ", "province": "កណ្តាល" },
        "កំពង់សំណាញ់": { "district": "ក្រុងតាខ្មៅ", "province": "កណ្តាល" },
        "ស្វាយរលំ": { "district": "ក្រុងតាខ្មៅ", "province": "កណ្តាល" },
        "កោះអន្លង់ចិន": { "district": "ក្រុងតាខ្មៅ", "province": "កណ្តាល" },
        "សិត្បូ": { "district": "ក្រុងតាខ្មៅ", "province": "កណ្តាល" },
        "រកាខ្ពស់": { "district": "ក្រុងតាខ្មៅ", "province": "កណ្តាល" },
        
        //កណ្តាល [8]


        "អណ្ដូងទឹក": { "district": "បុទុមសាគរ", "province": "កោះកុង" },
        "កណ្ដោល": { "district": "បុទុមសាគរ", "province": "កោះកុង" },
        "តានូន": { "district": "បុទុមសាគរ", "province": "កោះកុង" },
        "ថ្មស": { "district": "បុទុមសាគរ", "province": "កោះកុង" },
        "កោះស្ដេច": { "district": "គីរីសាគរ", "province": "កោះកុង" },
        "ភ្ញីមាស": { "district": "គីរីសាគរ", "province": "កោះកុង" },
        "ព្រែកខ្សាច់": { "district": "គីរីសាគរ", "province": "កោះកុង" },
        "ជ្រោយប្រស់": { "district": "កោះកុង", "province": "កោះកុង" },
        "កោះកាពិ": { "district": "កោះកុង", "province": "កោះកុង" },
        "តាតៃក្រោម": { "district": "កោះកុង", "province": "កោះកុង" },
        "ត្រពាំងរូង": { "district": "កោះកុង", "province": "កោះកុង" },
        "ស្មាច់មានជ័យ": { "district": "ខេមរភូមិន្ទ", "province": "កោះកុង" },
        "ដងទង់": { "district": "ខេមរភូមិន្ទ", "province": "កោះកុង" },
        "ស្ទឹងវែង": { "district": "ខេមរភូមិន្ទ", "province": "កោះកុង" },
        "ប៉ាក់ខ្លង": { "district": "មណ្ឌលសីមា", "province": "កោះកុង" },
        "ពាមក្រសោប": { "district": "មណ្ឌលសីមា", "province": "កោះកុង" },
        "ទួលគគីរ": { "district": "មណ្ឌលសីមា", "province": "កោះកុង" },
        "បឹងព្រាវ": { "district": "ស្រែអំបិល", "province": "កោះកុង" },
        "ជីខក្រោម": { "district": "ស្រែអំបិល", "province": "កោះកុង" },
        "ជីខលើ": { "district": "ស្រែអំបិល", "province": "កោះកុង" },
        "ជ្រោយស្វាយ": { "district": "ស្រែអំបិល", "province": "កោះកុង" },
        "ដងពែង": { "district": "ស្រែអំបិល", "province": "កោះកុង" },
        "ស្រែអំបិល": { "district": "ស្រែអំបិល", "province": "កោះកុង" },
        "ជឺផាត": { "district": "ថ្មបាំង", "province": "កោះកុង" },
        "ប្រឡាយ": { "district": "ថ្មបាំង", "province": "កោះកុង" },
        "ជំនាប់": { "district": "ថ្មបាំង", "province": "កោះកុង" },
        "ថ្មដូនពៅ": { "district": "ថ្មបាំង", "province": "កោះកុង" },
        "ឫស្សីជ្រំ": { "district": "ថ្មបាំង", "province": "កោះកុង" },
        "តាទៃរីល": { "district": "ថ្មបាំង", "province": "កោះកុង" },

        //កោះកុង [9]



        "ឆ្លូង": { "district": "ឆ្លូង", "province": "ក្រចេះ" },
        "ដំរីផុង": { "district": "ឆ្លូង", "province": "ក្រចេះ" },
        "ហាន់ជ័យ": { "district": "ឆ្លូង", "province": "ក្រចេះ" },
        "កំពង់ដំរី": { "district": "ឆ្លូង", "province": "ក្រចេះ" },
        "កញ្ជរ": { "district": "ឆ្លូង", "province": "ក្រចេះ" },
        "ខ្សាច់អណ្ដែត": { "district": "ឆ្លូង", "province": "ក្រចេះ" },
        "ពង្រ": { "district": "ឆ្លូង", "province": "ក្រចេះ" },
        "ព្រែកសាម៉ាន់": { "district": "ឆ្លូង", "province": "ក្រចេះ" },
      
        "កន្ទួត": { "district": "ក្រចេះ", "province": "ក្រចេះ" },
        "គោលាប់": { "district": "ក្រចេះ", "province": "ក្រចេះ" },
        "កោះច្រែង": { "district": "ក្រចេះ", "province": "ក្រចេះ" },
        "កោះទ្រង់": { "district": "ក្រចេះ", "province": "ក្រចេះ" },
        "ក្រគរ": { "district": "ក្រចេះ", "province": "ក្រចេះ" },
        "ក្រចេះ": { "district": "ក្រចេះ", "province": "ក្រចេះ" },
        "អូរឫស្សី": { "district": "ក្រចេះ", "province": "ក្រចេះ" },
        "ដារ": { "district": "ក្រចេះ", "province": "ក្រចេះ" },
        "បុសលាវ": { "district": "ក្រចេះ", "province": "ក្រចេះ" },
        "ចង្ក្រង់": { "district": "ក្រចេះ", "province": "ក្រចេះ" },
        "រកាកណ្ដាល": { "district": "ក្រចេះ", "province": "ក្រចេះ" },
        "សំបុក": { "district": "ក្រចេះ", "province": "ក្រចេះ" },
        "ថ្មអណ្តើក": { "district": "ក្រចេះ", "province": "ក្រចេះ" },
        "ថ្មគ្រែ(ស្រុកក្រចេះ)": { "district": "ក្រចេះ", "province": "ក្រចេះ" },
        "ថ្មី": { "district": "ក្រចេះ", "province": "ក្រចេះ" },
      
        "ចំបក់": { "district": "ព្រែកប្រសព្វ", "province": "ក្រចេះ" },
        "ជ្រោយបន្ទាយ": { "district": "ព្រែកប្រសព្វ", "province": "ក្រចេះ" },
        "កំពង់គរ": { "district": "ព្រែកប្រសព្វ", "province": "ក្រចេះ" },
        "កោះតាស៊ុយ": { "district": "ព្រែកប្រសព្វ", "province": "ក្រចេះ" },
        "ព្រែកប្រសព្វ": { "district": "ព្រែកប្រសព្វ", "province": "ក្រចេះ" },
        "ឫស្សីកែវ": { "district": "ព្រែកប្រសព្វ", "province": "ក្រចេះ" },
        "សោប": { "district": "ព្រែកប្រសព្វ", "province": "ក្រចេះ" },
        "តាម៉ៅ": { "district": "ព្រែកប្រសព្វ", "province": "ក្រចេះ" },
      
        "ក្បាលដំរី": { "district": "សំបូរ", "province": "ក្រចេះ" },
        "កោះខ្ញែរ": { "district": "សំបូរ", "province": "ក្រចេះ" },
        "អូរគ្រៀង": { "district": "សំបូរ", "province": "ក្រចេះ" },
        "រលួសមានជ័យ": { "district": "សំបូរ", "province": "ក្រចេះ" },
        "កំពង់ចាម": { "district": "សំបូរ", "province": "ក្រចេះ" },
        "បឹងចារ": { "district": "សំបូរ", "province": "ក្រចេះ" },
        "សំបូរ": { "district": "សំបូរ", "province": "ក្រចេះ" },
        "សណ្តាន់": { "district": "សំបូរ", "province": "ក្រចេះ" },
        "ស្រែជិះ": { "district": "សំបូរ", "province": "ក្រចេះ" },
        "វឌ្ឍនៈ": { "district": "សំបូរ", "province": "ក្រចេះ" },
      
        "ឃ្សឹម": { "district": "ស្នួល", "province": "ក្រចេះ" },
        "ពីរធ្នូ": { "district": "ស្នួល", "province": "ក្រចេះ" },
        "ស្នួល": { "district": "ស្នួល", "province": "ក្រចេះ" },
        "ស្រែចារ": { "district": "ស្នួល", "province": "ក្រចេះ" },
        "ស្វាយជ្រះ": { "district": "ស្នួល", "province": "ក្រចេះ" },
        "គ្រញូងសែនជ័យ": { "district": "ស្នួល", "province": "ក្រចេះ" },
      
        "កន្ទួត": { "district": "ចិត្របុរី", "province": "ក្រចេះ" },
        "ថ្មអណ្តើក": { "district": "ចិត្របុរី", "province": "ក្រចេះ" },
        "កោះច្រែង": { "district": "ចិត្របុរី", "province": "ក្រចេះ" },
        "សំបុក": { "district": "ចិត្របុរី", "province": "ក្រចេះ" },
        "គោលាប់": { "district": "ចិត្របុរី", "province": "ក្រចេះ" },
        "ថ្មី": { "district": "ចិត្របុរី", "province": "ក្រចេះ" },
        "ដា": { "district": "ចិត្របុរី", "province": "ក្រចេះ" },
        "បុសលាវ": { "district": "ចិត្របុរី", "province": "ក្រចេះ" },
        "ចង្ក្រង់": { "district": "ចិត្របុរី", "province": "ក្រចេះ" },
        "ថ្មគ្រែ": { "district": "ចិត្របុរី", "province": "ក្រចេះ" },
        //ក្រចេះ [10]  



        "ចុងផ្លាស់": { "district": "កែវសីមា", "province": "មណ្ឌលគីរី" },
        "មេម៉ង់": { "district": "កែវសីមា", "province": "មណ្ឌលគីរី" },
        "ស្រែឈូក": { "district": "កែវសីមា", "province": "មណ្ឌលគីរី" },
        "ស្រែខ្ទុម": { "district": "កែវសីមា", "province": "មណ្ឌលគីរី" },
        "ស្រែព្រះ": { "district": "កែវសីមា", "province": "មណ្ឌលគីរី" },
      
        "ង៉ងឃីលិក": { "district": "កោះញែក", "province": "មណ្ឌលគីរី" },
        "អបួនលើ": { "district": "កោះញែក", "province": "មណ្ឌលគីរី" },
        "រយ៉": { "district": "កោះញែក", "province": "មណ្ឌលគីរី" },
        "សុខសាន្ត": { "district": "កោះញែក", "province": "មណ្ឌលគីរី" },
        "ស្រែហ៊ុយ": { "district": "កោះញែក", "province": "មណ្ឌលគីរី" },
        "ស្រែសង្គម": { "district": "កោះញែក", "province": "មណ្ឌលគីរី" },
      
        "ដាក់ដាំ": { "district": "អូររាំង", "province": "មណ្ឌលគីរី" },
        "សែនមនោរម្យ": { "district": "អូររាំង", "province": "មណ្ឌលគីរី" },
      
        "ក្រង់តេះ": { "district": "ពេជ្រចិន្តា", "province": "មណ្ឌលគីរី" },
        "ពូជ្រៃ": { "district": "ពេជ្រចិន្តា", "province": "មណ្ឌលគីរី" },
        "ស្រែអំពូម": { "district": "ពេជ្រចិន្តា", "province": "មណ្ឌលគីរី" },
        "ប៊ូស្រា": { "district": "ពេជ្រចិន្តា", "province": "មណ្ឌលគីរី" },
      
        "មនោរម្យ": { "district": "សែនមនោរម្យ", "province": "មណ្ឌលគីរី" },
        "សុខដុម": { "district": "សែនមនោរម្យ", "province": "មណ្ឌលគីរី" },
        "ស្ពានមានជ័យ": { "district": "សែនមនោរម្យ", "province": "មណ្ឌលគីរី" },
        "រមនា": { "district": "សែនមនោរម្យ", "province": "មណ្ឌលគីរី" },

        //មណ្ឌលគីរី [11]


        'ទន្លេបាសាក់': {'district': 'ចំការមន', 'province': 'ភ្នំពេញ'},
        'បឹងកេងកងទី១': {'district': 'បឹងកេងកង', 'province': 'ភ្នំពេញ'},
        'បឹងកេងកងទី២': {'district': 'បឹងកេងកង', 'province': 'ភ្នំពេញ'},
        'បឹងកេងកងទី៣': {'district': 'បឹងកេងកង', 'province': 'ភ្នំពេញ'},
        'អូឡាំពិក': {'district': 'ចំការមន', 'province': 'ភ្នំពេញ'},
        'ទូលស្វាយព្រៃទី១': {'district': 'ចំការមន', 'province': 'ភ្នំពេញ'},
        'ទូលស្វាយព្រៃទី២': {'district': 'ចំការមន', 'province': 'ភ្នំពេញ'},
        'ទំនប់ទឹក': {'district': 'បឹងកេងកង', 'province': 'ភ្នំពេញ'},
        'ទួលទំពូងទី១': {'district': 'ចំការមន', 'province': 'ភ្នំពេញ'},
        'ទួលទំពូងទី២': {'district': 'ចំការមន', 'province': 'ភ្នំពេញ'},
        'បឹងត្របែក': {'district': 'ចំការមន', 'province': 'ភ្នំពេញ'},
        'ផ្សារដើមថ្កូវ': {'district': 'ចំការមន', 'province': 'ភ្នំពេញ'},
        'ស្រះចក': {'district': 'ដូនពេញ', 'province': 'ភ្នំពេញ'},
        'វត្តភ្នំ': {'district': 'ដូនពេញ', 'province': 'ភ្នំពេញ'},
        'ផ្សារចាស់': {'district': 'ដូនពេញ', 'province': 'ភ្នំពេញ'},
        'ផ្សារកណ្ដាល១': {'district': 'ដូនពេញ', 'province': 'ភ្នំពេញ'},
        'ផ្សារកណ្ដាល២': {'district': 'ដូនពេញ', 'province': 'ភ្នំពេញ'},
        'ជ័យជំនះ': {'district': 'ដូនពេញ', 'province': 'ភ្នំពេញ'},
        'ចតុមុខ': {'district': 'ដូនពេញ', 'province': 'ភ្នំពេញ'},
        'ផ្សារថ្មី១': {'district': 'ដូនពេញ', 'province': 'ភ្នំពេញ'},
        'ផ្សារថ្មី២': {'district': 'ដូនពេញ', 'province': 'ភ្នំពេញ'},
        'ផ្សារថ្មី៣': {'district': 'ដូនពេញ', 'province': 'ភ្នំពេញ'},
        'បឹងរាំង': {'district': 'ដូនពេញ', 'province': 'ភ្នំពេញ'},
        'មនោរម្យ': {'district': 'ប្រាំពីរមករា', 'province': 'ភ្នំពេញ'},
        'មិត្តភាព': {'district': 'ប្រាំពីរមករា', 'province': 'ភ្នំពេញ'},
        'វាលវង់': {'district': 'ប្រាំពីរមករា', 'province': 'ភ្នំពេញ'},
        'អូរឫស្សី១': {'district': 'ប្រាំពីរមករា', 'province': 'ភ្នំពេញ'},
        'អូរឫស្សី២': {'district': 'ប្រាំពីរមករា', 'province': 'ភ្នំពេញ'},
        'អូរឫស្សី៣': {'district': 'ប្រាំពីរមករា', 'province': 'ភ្នំពេញ'},
        'អូរឫស្សី៤': {'district': 'ប្រាំពីរមករា', 'province': 'ភ្នំពេញ'},
        'បឹងព្រលិត': {'district': 'ប្រាំពីរមករា', 'province': 'ភ្នំពេញ'},
        'ផ្សារដេប៉ូទី១': {'district': 'ទួលគោក', 'province': 'ភ្នំពេញ'},
        'ផ្សារដេប៉ូទី២': {'district': 'ទួលគោក', 'province': 'ភ្នំពេញ'},
        'ផ្សារដេប៉ូទី៣': {'district': 'ទួលគោក', 'province': 'ភ្នំពេញ'},
        'ទឹកល្អក់ទី១': {'district': 'ទួលគោក', 'province': 'ភ្នំពេញ'},
        'ទឹកល្អក់ទី២': {'district': 'ទួលគោក', 'province': 'ភ្នំពេញ'},
        'ទឹកល្អក់ទី៣': {'district': 'ទួលគោក', 'province': 'ភ្នំពេញ'},
        'បឹងកក់ទី១': {'district': 'ទួលគោក', 'province': 'ភ្នំពេញ'},
        'បឹងកក់ទី២': {'district': 'ទួលគោក', 'province': 'ភ្នំពេញ'},
        'ផ្សារដើមគ': {'district': 'ទួលគោក', 'province': 'ភ្នំពេញ'},
        'បឹងសាឡាង': {'district': 'ទួលគោក', 'province': 'ភ្នំពេញ'},
        'ដង្កោ': {'district': 'ដង្កោ', 'province': 'ភ្នំពេញ'},
        'ពងទឹក': {'district': 'ដង្កោ', 'province': 'ភ្នំពេញ'},
        'ព្រែកកំពឹស': {'district': 'ដង្កោ', 'province': 'ភ្នំពេញ'},
        'ស្ពានថ្ម': {'district': 'ដង្កោ', 'province': 'ភ្នំពេញ'},
        'រលួស': {'district': 'ដង្កោ', 'province': 'ភ្នំពេញ'},
        'ទៀន': {'district': 'ដង្កោ', 'province': 'ភ្នំពេញ'},
        'គងនយ': {'district': 'ដង្កោ', 'province': 'ភ្នំពេញ'},
        'ព្រៃវែង': {'district': 'ដង្កោ', 'province': 'ភ្នំពេញ'},
        'ព្រៃសរ': {'district': 'ដង្កោ', 'province': 'ភ្នំពេញ'},
        'ក្រាំងពង្រ': {'district': 'ដង្កោ', 'province': 'ភ្នំពេញ'},
        'ប្រទះឡាង': {'district': 'កំបូល', 'province': 'ភ្នំពេញ'},
        'សាក់សំពៅ': {'district': 'ដង្កោ', 'province': 'ភ្នំពេញ'},
        'ជើងឯក': {'district': 'ដង្កោ', 'province': 'ភ្នំពេញ'},
        'ចាក់អង្រែលើ': {'district': 'មានជ័យ', 'province': 'ភ្នំពេញ'},
        'ចាក់អង្រែក្រោម': {'district': 'មានជ័យ', 'province': 'ភ្នំពេញ'},
        'ស្ទឹងមានជ័យទី១': {'district': 'មានជ័យ', 'province': 'ភ្នំពេញ'},
        'ស្ទឹងមានជ័យទី២': {'district': 'មានជ័យ', 'province': 'ភ្នំពេញ'},
        'ស្ទឹងមានជ័យទី៣': {'district': 'មានជ័យ', 'province': 'ភ្នំពេញ'},
        'បឹងទំពុនទី១': {'district': 'មានជ័យ', 'province': 'ភ្នំពេញ'},
        'បឹងទំពុនទី២': {'district': 'មានជ័យ', 'province': 'ភ្នំពេញ'},
        'ទួលសង្កែ': {'district': 'ឫស្សីកែវ', 'province': 'ភ្នំពេញ'},
        'ស្វាយប៉ាក': {'district': 'ឫស្សីកែវ', 'province': 'ភ្នំពេញ'},
        'គីឡូម៉ែត្រលេខប្រាំមួយ': {'district': 'ឫស្សីកែវ', 'province': 'ភ្នំពេញ'},
        'ឫស្សីកែវ': {'district': 'ឫស្សីកែវ', 'province': 'ភ្នំពេញ'},
        'ព្រែកលាភ': {'district': 'ឫស្សីកែវ', 'province': 'ភ្នំពេញ'},
        'ព្រែកតាសេក': {'district': 'ជ្រោយចង្វារ', 'province': 'ភ្នំពេញ'},
        'ជ្រោយចង្វារ': {'district': 'ជ្រោយចង្វារ', 'province': 'ភ្នំពេញ'},
        'ច្រាំងចំរេះ១': {'district': 'ឫស្សីកែវ', 'province': 'ភ្នំពេញ'},
        'ច្រាំងចំរេះ២': {'district': 'ឫស្សីកែវ', 'province': 'ភ្នំពេញ'},
        'កោះដាច់': {'district': 'ជ្រោយចង្វារ', 'province': 'ភ្នំពេញ'},
        'បាក់ខែង': {'district': 'ជ្រោយចង្វារ', 'province': 'ភ្នំពេញ'},
        'ភ្នំពេញថ្មី': {'district': 'សែនសុខ', 'province': 'ភ្នំពេញ'},
        'ទឹកថ្លា(ភ្នំពេញ)': {'district': 'សែនសុខ', 'province': 'ភ្នំពេញ'},
        'ឃ្មួញ': {'district': 'សែនសុខ', 'province': 'ភ្នំពេញ'},
        'ក្រាំងធ្នង់': {'district': 'សែនសុខ', 'province': 'ភ្នំពេញ'},
        'អូរបែកក្អម': {'district': 'សែនសុខ', 'province': 'ភ្នំពេញ'},
        'គោកឃ្លាង': {'district': 'សែនសុខ', 'province': 'ភ្នំពេញ'},
        'កាកាបទី១': {'district': 'ពោធិ៍សែនជ័យ', 'province': 'ភ្នំពេញ'},
        'កាកាបទី២': {'district': 'ពោធិ៍សែនជ័យ', 'province': 'ភ្នំពេញ'},
        'ចោមចៅទី២': {'district': 'ពោធិ៍សែនជ័យ', 'province': 'ភ្នំពេញ'},
        'ចោមចៅទី១': {'district': 'ពោធិ៍សែនជ័យ', 'province': 'ភ្នំពេញ'},
        'ចោមចៅទី៣': {'district': 'ពោធិ៍សែនជ័យ', 'province': 'ភ្នំពេញ'},
        'សំរោងក្រោម': {'district': 'ពោធិ៍សែនជ័យ', 'province': 'ភ្នំពេញ'},
        'ត្រពាំងក្រសាំង': {'district': 'ពោធិ៍សែនជ័យ', 'province': 'ភ្នំពេញ'},
        'ច្បារអំពៅទី១': {'district': 'ច្បារអំពៅ', 'province': 'ភ្នំពេញ'},
        'ច្បារអំពៅទី២': {'district': 'ច្បារអំពៅ', 'province': 'ភ្នំពេញ'},
        'និរោធ': {'district': 'ច្បារអំពៅ', 'province': 'ភ្នំពេញ'},
        'ព្រែកប្រា': {'district': 'ច្បារអំពៅ', 'province': 'ភ្នំពេញ'},
        'វាលស្បូវ': {'district': 'ច្បារអំពៅ', 'province': 'ភ្នំពេញ'},
        'ព្រែកឯង': {'district': 'ច្បារអំពៅ', 'province': 'ភ្នំពេញ'},
        'ក្បាលកោះ': {'district': 'ច្បារអំពៅ', 'province': 'ភ្នំពេញ'},
        'ព្រែកថ្មី': {'district': 'ច្បារអំពៅ', 'province': 'ភ្នំពេញ'},
        'ព្រែកលៀប': {'district': 'ជ្រោយចង្វារ', 'province': 'ភ្នំពេញ'},
        'ព្រែកព្នៅ': {'district': 'ព្រែកព្នៅ', 'province': 'ភ្នំពេញ'},
        'ពញាពន់': {'district': 'ព្រែកព្នៅ', 'province': 'ភ្នំពេញ'},
        'សំរោង': {'district': 'ព្រែកព្នៅ', 'province': 'ភ្នំពេញ'},
        'គោករកា': {'district': 'ព្រែកព្នៅ', 'province': 'ភ្នំពេញ'},
        'ពន្សាំង': {'district': 'ព្រែកព្នៅ', 'province': 'ភ្នំពេញ'},
        'អូរឡាំពិច': {'district': 'បឹងកេងកង', 'province': 'ភ្នំពេញ'},
        'ទួលស្វាយព្រៃទី១': {'district': 'បឹងកេងកង', 'province': 'ភ្នំពេញ'},
        'ទួលស្វាយព្រៃទី២': {'district': 'បឹងកេងកង', 'province': 'ភ្នំពេញ'},
        'កំបូល': {'district': 'កំបូល', 'province': 'ភ្នំពេញ'},
        'កន្ទោក': {'district': 'កំបូល', 'province': 'ភ្នំពេញ'},
        'ឳឡោក': {'district': 'កំបូល', 'province': 'ភ្នំពេញ'},
        'ស្នោរ': {'district': 'កំបូល', 'province': 'ភ្នំពេញ'},
        'ភ្លើងឆេះរទេះ': {'district': 'កំបូល', 'province': 'ភ្នំពេញ'},
        'បឹងធំ': {'district': 'កំបូល', 'province': 'ភ្នំពេញ'},
        'ប្រទះឡាង': {'district': 'កំបូល', 'province': 'ភ្នំពេញ'},
        //ភ្នំពេញ [12]

        "ស្អាង": { "district": "ជ័យសែន", "province": "ព្រះវិហារ" },
        "តស៊ូ": { "district": "ជ័យសែន", "province": "ព្រះវិហារ" },
        "ខ្យង": { "district": "ជ័យសែន", "province": "ព្រះវិហារ" },
        "ច្រាច់": { "district": "ជ័យសែន", "province": "ព្រះវិហារ" },
        "ធ្មា": { "district": "ជ័យសែន", "province": "ព្រះវិហារ" },
        "ពុទ្រា": { "district": "ជ័យសែន", "province": "ព្រះវិហារ" },
      
        "ឆែបមួយ": { "district": "ឆែប", "province": "ព្រះវិហារ" },
        "ឆែបពីរ": { "district": "ឆែប", "province": "ព្រះវិហារ" },
        "សង្កែមួយ": { "district": "ឆែប", "province": "ព្រះវិហារ" },
        "សង្កែពីរ": { "district": "ឆែប", "province": "ព្រះវិហារ" },
        "ម្លូព្រៃមួយ": { "district": "ឆែប", "province": "ព្រះវិហារ" },
        "ម្លូព្រៃពីរ": { "district": "ឆែប", "province": "ព្រះវិហារ" },
        "កំពង់ស្រឡៅមួយ": { "district": "ឆែប", "province": "ព្រះវិហារ" },
        "កំពង់ស្រឡៅពីរ": { "district": "ឆែប", "province": "ព្រះវិហារ" },
      
        "ជាំក្សាន្ដ": { "district": "ជាំក្សាន្ត", "province": "ព្រះវិហារ" },
        "ទឹកក្រហម": { "district": "ជាំក្សាន្ត", "province": "ព្រះវិហារ" },
        "ព្រីងធំ": { "district": "ជាំក្សាន្ត", "province": "ព្រះវិហារ" },
        "រំដោះស្រែ": { "district": "ជាំក្សាន្ត", "province": "ព្រះវិហារ" },
        "យាង": { "district": "ជាំក្សាន្ត", "province": "ព្រះវិហារ" },
        "កន្ទួត": { "district": "ជាំក្សាន្ត", "province": "ព្រះវិហារ" },
        "ស្រអែម": { "district": "ជាំក្សាន្ត", "province": "ព្រះវិហារ" },
        "មរកត": { "district": "ជាំក្សាន្ត", "province": "ព្រះវិហារ" },
      
        "គូលែនត្បូង": { "district": "គូលែន", "province": "ព្រះវិហារ" },
        "គូលែនជើង": { "district": "គូលែន", "province": "ព្រះវិហារ" },
        "ថ្មី": { "district": "គូលែន", "province": "ព្រះវិហារ" },
        "ភ្នំពេញ": { "district": "គូលែន", "province": "ព្រះវិហារ" },
        "ភ្នំត្បែងពីរ": { "district": "គូលែន", "province": "ព្រះវិហារ" },
        "ស្រយង់": { "district": "គូលែន", "province": "ព្រះវិហារ" },
      
        "របៀប": { "district": "រវៀង", "province": "ព្រះវិហារ" },
        "រស្មី": { "district": "រវៀង", "province": "ព្រះវិហារ" },
        "រហ័ស": { "district": "រវៀង", "province": "ព្រះវិហារ" },
        "រុងរឿង": { "district": "រវៀង", "province": "ព្រះវិហារ" },
        "រីករាយ": { "district": "រវៀង", "province": "ព្រះវិហារ" },
        "រួសរាន់": { "district": "រវៀង", "province": "ព្រះវិហារ" },
        "រតនៈ": { "district": "រវៀង", "province": "ព្រះវិហារ" },
        "រៀបរយ": { "district": "រវៀង", "province": "ព្រះវិហារ" },
        "រក្សា": { "district": "រវៀង", "province": "ព្រះវិហារ" },
        "រំដោះ": { "district": "រវៀង", "province": "ព្រះវិហារ" },
        "រមទម": { "district": "រវៀង", "province": "ព្រះវិហារ" },
        "រមណីយ": { "district": "រវៀង", "province": "ព្រះវិហារ" },
      
        "ចំរើន": { "district": "សង្គមថ្មី", "province": "ព្រះវិហារ" },
        "រអាង": { "district": "សង្គមថ្មី", "province": "ព្រះវិហារ" },
        "ភ្នំត្បែងមួយ": { "district": "សង្គមថ្មី", "province": "ព្រះវិហារ" },
        "ស្ដៅ": { "district": "សង្គមថ្មី", "province": "ព្រះវិហារ" },
        "រណសិរ្ស": { "district": "សង្គមថ្មី", "province": "ព្រះវិហារ" },
      
        "ឈានមុខ": { "district": "ត្បែងមានជ័យ", "province": "ព្រះវិហារ" },
        "ពោធិ៍": { "district": "ត្បែងមានជ័យ", "province": "ព្រះវិហារ" },
        "ប្រមេរុ": { "district": "ត្បែងមានជ័យ", "province": "ព្រះវិហារ" },
        "ព្រះឃ្លាំង": { "district": "ត្បែងមានជ័យ", "province": "ព្រះវិហារ" },
      
        "កំពង់ប្រណាក": { "district": "ក្រុងព្រះវិហារ", "province": "ព្រះវិហារ" },
        "ប៉ាលហាល": { "district": "ក្រុងព្រះវិហារ", "province": "ព្រះវិហារ" },

        //  ព្រះវិហារ [13]


        "បឹងព្រះ": { "district": "បាភ្នំ", "province": "ព្រៃវែង" },
        "ជើងភ្នំ": { "district": "បាភ្នំ", "province": "ព្រៃវែង" },
        "ឈើកាច់": { "district": "បាភ្នំ", "province": "ព្រៃវែង" },
        "រក្សជ័យ": { "district": "បាភ្នំ", "province": "ព្រៃវែង" },
        "រោងដំរី": { "district": "បាភ្នំ", "province": "ព្រៃវែង" },
        "ស្ដៅកោង": { "district": "បាភ្នំ", "province": "ព្រៃវែង" },
        "ស្ពឺ ក": { "district": "បាភ្នំ", "province": "ព្រៃវែង" },
        "ស្ពឺ ខ": { "district": "បាភ្នំ", "province": "ព្រៃវែង" },
        "ធាយ": { "district": "បាភ្នំ", "province": "ព្រៃវែង" },
      
        "ជាច": { "district": "កំចាយមារ", "province": "ព្រៃវែង" },
        "ដូនកឹង": { "district": "កំចាយមារ", "province": "ព្រៃវែង" },
        "ក្រញូង": { "district": "កំចាយមារ", "province": "ព្រៃវែង" },
        "ក្របៅ": { "district": "កំចាយមារ", "province": "ព្រៃវែង" },
        "ស៊ាងឃ្វាង": { "district": "កំចាយមារ", "province": "ព្រៃវែង" },
        "ស្មោងខាងជើង": { "district": "កំចាយមារ", "province": "ព្រៃវែង" },
        "ស្មោងខាងត្បូង": { "district": "កំចាយមារ", "province": "ព្រៃវែង" },
        "ត្របែក": { "district": "កំចាយមារ", "province": "ព្រៃវែង" },
      
        "អន្សោង": { "district": "កំពង់ត្របែក", "province": "ព្រៃវែង" },
        "ចាម": { "district": "កំពង់ត្របែក", "province": "ព្រៃវែង" },
        "ជាងដែក": { "district": "កំពង់ត្របែក", "province": "ព្រៃវែង" },
        "ជ្រៃ": { "district": "កំពង់ត្របែក", "province": "ព្រៃវែង" },
        "កន្សោមអក": { "district": "កំពង់ត្របែក", "province": "ព្រៃវែង" },
        "គោខ្ចក": { "district": "កំពង់ត្របែក", "province": "ព្រៃវែង" },
        "កំពង់ត្របែក": { "district": "កំពង់ត្របែក", "province": "ព្រៃវែង" },
        "ពាមមន្ទារ": { "district": "កំពង់ត្របែក", "province": "ព្រៃវែង" },
        "ប្រាសាទ": { "district": "កំពង់ត្របែក", "province": "ព្រៃវែង" },
        "ប្រធាតុ": { "district": "កំពង់ត្របែក", "province": "ព្រៃវែង" },
        "ព្រៃឈរ": { "district": "កំពង់ត្របែក", "province": "ព្រៃវែង" },
        "ព្រៃពោន": { "district": "កំពង់ត្របែក", "province": "ព្រៃវែង" },
        "ថ្កូវ": { "district": "កំពង់ត្របែក", "province": "ព្រៃវែង" },
      
        "ចុងអំពិល": { "district": "កញ្ច្រៀច", "province": "ព្រៃវែង" },
        "កញ្ជ្រៀច": { "district": "កញ្ច្រៀច", "province": "ព្រៃវែង" },
        "ក្ដឿងរាយ": { "district": "កញ្ច្រៀច", "province": "ព្រៃវែង" },
        "គោកគង់កើត": { "district": "កញ្ច្រៀច", "province": "ព្រៃវែង" },
        "គោកគង់លិច": { "district": "កញ្ច្រៀច", "province": "ព្រៃវែង" },
        "ព្រាល": { "district": "កញ្ច្រៀច", "province": "ព្រៃវែង" },
        "ថ្មពូន": { "district": "កញ្ច្រៀច", "province": "ព្រៃវែង" },
        "ត្នោត": { "district": "កញ្ច្រៀច", "province": "ព្រៃវែង" },
      
        "អង្គរសរ": { "district": "មេសាង", "province": "ព្រៃវែង" },
        "ច្រេស": { "district": "មេសាង", "province": "ព្រៃវែង" },
        "ជីផុច": { "district": "មេសាង", "province": "ព្រៃវែង" },
        "ព្រៃឃ្នេស": { "district": "មេសាង", "province": "ព្រៃវែង" },
        "ព្រៃរំដេង": { "district": "មេសាង", "province": "ព្រៃវែង" },
        "ព្រៃទទឹង": { "district": "មេសាង", "province": "ព្រៃវែង" },
        "ស្វាយជ្រុំ": { "district": "មេសាង", "province": "ព្រៃវែង" },
        "ត្រពាំងស្រែ": { "district": "មេសាង", "province": "ព្រៃវែង" },
      
        "អង្គរអង្គ": { "district": "ពាមជរ", "province": "ព្រៃវែង" },
        "កំពង់ប្រាសាទ": { "district": "ពាមជរ", "province": "ព្រៃវែង" },
        "កោះចេក": { "district": "ពាមជរ", "province": "ព្រៃវែង" },
        "កោះរកា": { "district": "ពាមជរ", "province": "ព្រៃវែង" },
        "កោះសំពៅ": { "district": "ពាមជរ", "province": "ព្រៃវែង" },
        "ក្រាំងតាយ៉ង": { "district": "ពាមជរ", "province": "ព្រៃវែង" },
        "ព្រែកក្របៅ": { "district": "ពាមជរ", "province": "ព្រៃវែង" },
        "ព្រែកសំបួរ": { "district": "ពាមជរ", "province": "ព្រៃវែង" },
        "ឫស្សីស្រុក": { "district": "ពាមជរ", "province": "ព្រៃវែង" },
        "ស្វាយភ្លោះ": { "district": "ពាមជរ", "province": "ព្រៃវែង" },
      
        "បាបោង": { "district": "ពាមរ", "province": "ព្រៃវែង" },
        "បន្លិចប្រាសាទ": { "district": "ពាមរ", "province": "ព្រៃវែង" },
        "អ្នកលឿង": { "district": "ពាមរ", "province": "ព្រៃវែង" },
        "ពាមមានជ័យ": { "district": "ពាមរ", "province": "ព្រៃវែង" },
        "ពាមរ​ក៏": { "district": "ពាមរ", "province": "ព្រៃវែង" },
        "ព្រែកខ្សាយ ក": { "district": "ពាមរ", "province": "ព្រៃវែង" },
        "ព្រែកខ្សាយ ខ": { "district": "ពាមរ", "province": "ព្រៃវែង" },
        "ព្រៃកណ្ដៀង": { "district": "ពាមរ", "province": "ព្រៃវែង" },
      
        "កំពង់ពពិល": { "district": "ពារាំង", "province": "ព្រៃវែង" },
        "កញ្ចំ": { "district": "ពារាំង", "province": "ព្រៃវែង" },
        "កំពង់ប្រាំង": { "district": "ពារាំង", "province": "ព្រៃវែង" },
        "មេសរប្រចាន់": { "district": "ពារាំង", "province": "ព្រៃវែង" },
        "ព្រៃព្នៅ": { "district": "ពារាំង", "province": "ព្រៃវែង" },
        "ព្រៃស្នៀត": { "district": "ពារាំង", "province": "ព្រៃវែង" },
        "ព្រៃស្រឡិត": { "district": "ពារាំង", "province": "ព្រៃវែង" },
        "រាប": { "district": "ពារាំង", "province": "ព្រៃវែង" },
        "រកា": { "district": "ពារាំង", "province": "ព្រៃវែង" },
      
        "អង្គររាជ្យ": { "district": "ព្រះស្ដេច", "province": "ព្រៃវែង" },
        "បន្ទាយចក្រី": { "district": "ព្រះស្ដេច", "province": "ព្រៃវែង" },
        "បឹងដោល": { "district": "ព្រះស្ដេច", "province": "ព្រៃវែង" },
        "ជៃកំពក": { "district": "ព្រះស្ដេច", "province": "ព្រៃវែង" },
        "កំពង់សឹង": { "district": "ព្រះស្ដេច", "province": "ព្រៃវែង" },
        "ក្រាំងស្វាយ": { "district": "ព្រះស្ដេច", "province": "ព្រៃវែង" },
        "ល្វា": { "district": "ព្រះស្ដេច", "province": "ព្រៃវែង" },
        "ព្រះស្តេច": { "district": "ព្រះស្ដេច", "province": "ព្រៃវែង" },
        "រាធរ": { "district": "ព្រះស្ដេច", "province": "ព្រៃវែង" },
        "រំចេក": { "district": "ព្រះស្ដេច", "province": "ព្រៃវែង" },
        "សេនារាជឧត្តម": { "district": "ព្រះស្ដេច", "province": "ព្រៃវែង" },
      
        "បារាយណ៍": { "district": "ក្រុងព្រៃវែង", "province": "ព្រៃវែង" },
        "ជើងទឹក": { "district": "ក្រុងព្រៃវែង", "province": "ព្រៃវែង" },
        "កំពង់លាវ": { "district": "ក្រុងព្រៃវែង", "province": "ព្រៃវែង" },
        "តាកោ": { "district": "ក្រុងព្រៃវែង", "province": "ព្រៃវែង" },
      
        "ពោធិ៍រៀង": { "district": "ពោធិ៍រៀង", "province": "ព្រៃវែង" },
        "កំពង់ឫស្សី": { "district": "ពោធិ៍រៀង", "province": "ព្រៃវែង" },
        "ព្រែកអន្ទះ": { "district": "ពោធិ៍រៀង", "province": "ព្រៃវែង" },
        "ព្រៃកជ្រៃ": { "district": "ពោធិ៍រៀង", "province": "ព្រៃវែង" },
        "ព្រៃកន្លោង": { "district": "ពោធិ៍រៀង", "province": "ព្រៃវែង" },
        "ព្រែកតាសរ": { "district": "ពោធិ៍រៀង", "province": "ព្រៃវែង" },
      
        "អំពិលក្រៅ": { "district": "ស៊ីធរកណ្ដាល", "province": "ព្រៃវែង" },
        "ជ្រៃឃ្មុំ": { "district": "ស៊ីធរកណ្ដាល", "province": "ព្រៃវែង" },
        "ល្វេ": { "district": "ស៊ីធរកណ្ដាល", "province": "ព្រៃវែង" },
        "ព្នៅទី១": { "district": "ស៊ីធរកណ្ដាល", "province": "ព្រៃវែង" },
        "ព្នៅទី២": { "district": "ស៊ីធរកណ្ដាល", "province": "ព្រៃវែង" },
        "ពោធិទី": { "district": "ស៊ីធរកណ្ដាល", "province": "ព្រៃវែង" },
        "ព្រែកចង្ក្រាន": { "district": "ស៊ីធរកណ្ដាល", "province": "ព្រៃវែង" },
        "ព្រែកដើមថ្នឹង": { "district": "ស៊ីធរកណ្ដាល", "province": "ព្រៃវែង" },
        "ព្រៃទឹង": { "district": "ស៊ីធរកណ្ដាល", "province": "ព្រៃវែង" },
        "រំលេច": { "district": "ស៊ីធរកណ្ដាល", "province": "ព្រៃវែង" },
        "ឫស្សីសាញ់": { "district": "ស៊ីធរកណ្ដាល", "province": "ព្រៃវែង" },
      
        "អង្គរទ្រេត": { "district": "ស្វាយអន្ទរ", "province": "ព្រៃវែង" },
        "ជាខ្លាង": { "district": "ស្វាយអន្ទរ", "province": "ព្រៃវែង" },
        "ជ្រៃ": { "district": "ស្វាយអន្ទរ", "province": "ព្រៃវែង" },
        "ដំរីពួន": { "district": "ស្វាយអន្ទរ", "province": "ព្រៃវែង" },
        "មេបុណ្យ": { "district": "ស្វាយអន្ទរ", "province": "ព្រៃវែង" },
        "ពានរោង": { "district": "ស្វាយអន្ទរ", "province": "ព្រៃវែង" },
        "ពពឺស": { "district": "ស្វាយអន្ទរ", "province": "ព្រៃវែង" },
        "ព្រៃខ្លា": { "district": "ស្វាយអន្ទរ", "province": "ព្រៃវែង" },
        "សំរោង": { "district": "ស្វាយអន្ទរ", "province": "ព្រៃវែង" },
        "ស្វាយអន្ទរ": { "district": "ស្វាយអន្ទរ", "province": "ព្រៃវែង" },
        "ទឹកថ្លា(ព្រៃវែង)": { "district": "ស្វាយអន្ទរ", "province": "ព្រៃវែង" },   
        //  ព្រៃវែង [14]


        "បាកាន": { "district": "បាកាន", "province": "ពោធិ៍សាត់" },
        "កណ្តៀង": { "district": "បាកាន", "province": "ពោធិ៍សាត់" },
        "ក្រគរ": { "district": "បាកាន", "province": "ពោធិ៍សាត់" },
        "ភ្នំក្រវាញ": { "district": "បាកាន", "province": "ពោធិ៍សាត់" },
        "ក្រុងពោធិ៍សាត់": { "district": "បាកាន", "province": "ពោធិ៍សាត់" },
        "វាលវែង": { "district": "បាកាន", "province": "ពោធិ៍សាត់" },
        "តាលោសែនជ័យ": { "district": "បាកាន", "province": "ពោធិ៍សាត់" },
      
        "អន្លង់វិល": { "district": "កណ្ដៀង", "province": "ពោធិ៍សាត់" },
        "កណ្ដៀង": { "district": "កណ្ដៀង", "province": "ពោធិ៍សាត់" },
        "កញ្ជរ": { "district": "កណ្ដៀង", "province": "ពោធិ៍សាត់" },
        "រាំងទិល": { "district": "កណ្ដៀង", "province": "ពោធិ៍សាត់" },
        "ស្រែស្ដុក": { "district": "កណ្ដៀង", "province": "ពោធិ៍សាត់" },
        "ស្វាយលួង": { "district": "កណ្ដៀង", "province": "ពោធិ៍សាត់" },
        "ស្យា": { "district": "កណ្ដៀង", "province": "ពោធិ៍សាត់" },
        "វាល": { "district": "កណ្ដៀង", "province": "ពោធិ៍សាត់" },
        "កោះជុំ": { "district": "កណ្ដៀង", "province": "ពោធិ៍សាត់" },
      
        "អន្លង់ត្នោត": { "district": "ក្រគរ", "province": "ពោធិ៍សាត់" },
        "អន្សាចំបក់": { "district": "ក្រគរ", "province": "ពោធិ៍សាត់" },
        "បឹងកន្ទួត": { "district": "ក្រគរ", "province": "ពោធិ៍សាត់" },
        "ឈើតុំ": { "district": "ក្រគរ", "province": "ពោធិ៍សាត់" },
        "កំពង់លួង": { "district": "ក្រគរ", "province": "ពោធិ៍សាត់" },
        "កំពង់ពោធិ៍": { "district": "ក្រគរ", "province": "ពោធិ៍សាត់" },
        "ក្បាលត្រាច": { "district": "ក្រគរ", "province": "ពោធិ៍សាត់" },
        "អូរសណ្ដាន់": { "district": "ក្រគរ", "province": "ពោធិ៍សាត់" },
        "ស្នាអន្សា": { "district": "ក្រគរ", "province": "ពោធិ៍សាត់" },
        "ស្វាយស": { "district": "ក្រគរ", "province": "ពោធិ៍សាត់" },
        "ត្នោតជុំ": { "district": "ក្រគរ", "province": "ពោធិ៍សាត់" },
      
        "បាក់ចិញ្ចៀន": { "district": "ភ្នំក្រវាញ", "province": "ពោធិ៍សាត់" },
        "លាច": { "district": "ភ្នំក្រវាញ", "province": "ពោធិ៍សាត់" },
        "ព្រងិល": { "district": "ភ្នំក្រវាញ", "province": "ពោធិ៍សាត់" },
        "រកាត": { "district": "ភ្នំក្រវាញ", "province": "ពោធិ៍សាត់" },
        "សន្ទ្រែ": { "district": "ភ្នំក្រវាញ", "province": "ពោធិ៍សាត់" },
        "សំរោង": { "district": "ភ្នំក្រវាញ", "province": "ពោធិ៍សាត់" },
      
        "ចំរើនផល": { "district": "ក្រុងពោធិ៍សាត់", "province": "ពោធិ៍សាត់" },
        "លលកស": { "district": "ក្រុងពោធិ៍សាត់", "province": "ពោធិ៍សាត់" },
        "ផ្ទះព្រៃ": { "district": "ក្រុងពោធិ៍សាត់", "province": "ពោធិ៍សាត់" },
        "ព្រៃញី": { "district": "ក្រុងពោធិ៍សាត់", "province": "ពោធិ៍សាត់" },
        "រលាប": { "district": "ក្រុងពោធិ៍សាត់", "province": "ពោធិ៍សាត់" },
        "ស្វាយអាត់": { "district": "ក្រុងពោធិ៍សាត់", "province": "ពោធិ៍សាត់" },
        "បន្ទាយដី": { "district": "ក្រុងពោធិ៍សាត់", "province": "ពោធិ៍សាត់" },
      
        "អន្លង់រាប": { "district": "វាលវែង", "province": "ពោធិ៍សាត់" },
        "ក្រពើពីរ": { "district": "វាលវែង", "province": "ពោធិ៍សាត់" },
        "អូរសោម": { "district": "វាលវែង", "province": "ពោធិ៍សាត់" },
        "ប្រម៉ោយ": { "district": "វាលវែង", "province": "ពោធិ៍សាត់" },
        "ថ្មដា": { "district": "វាលវែង", "province": "ពោធិ៍សាត់" },
      
        "តាលោ": { "district": "តាលោសែនជ័យ", "province": "ពោធិ៍សាត់" },
        "ផ្ទះរុង": { "district": "តាលោសែនជ័យ", "province": "ពោធិ៍សាត់" },
        //  ពោធិ៍សាត់ [15]


        "ម៉ាលិក​": { "district": "អណ្ដូងមាស", "province": "រតនគីរី" },
        "ញ៉ាង": { "district": "អណ្ដូងមាស", "province": "រតនគីរី" },
        "តាឡាវ": { "district": "អណ្ដូងមាស", "province": "រតនគីរី" },
        "ក្រុងបានលុង": { "district": "ក្រុងបានលុង", "province": "រតនគីរី" },
        "កាចាញ": { "district": "ក្រុងបានលុង", "province": "រតនគីរី" },
        "ឡាបានសៀក": { "district": "ក្រុងបានលុង", "province": "រតនគីរី" },
        "យក្ខឡោម": { "district": "ក្រុងបានលុង", "province": "រតនគីរី" },
        "បឹងកន្សែង": { "district": "ក្រុងបានលុង", "province": "រតនគីរី" },
        "បរកែវ": { "district": "បរកែវ", "province": "រតនគីរី" },
        "កក់": { "district": "បរកែវ", "province": "រតនគីរី" },
        "កិះចុង": { "district": "បរកែវ", "province": "រតនគីរី" },
        "ឡាមីញ": { "district": "បរកែវ", "province": "រតនគីរី" },
        "លុងឃុង": { "district": "បរកែវ", "province": "រតនគីរី" },
        "ស៊ើង": { "district": "បរកែវ", "province": "រតនគីរី" },
        "ទីងចាក់": { "district": "បរកែវ", "province": "រតនគីរី" },
        "កូនមុំ": { "district": "កូនមុំ", "province": "រតនគីរី" },
        "សិរីមង្គល": { "district": "កូនមុំ", "province": "រតនគីរី" },
        "ស្រែអង្គ្រង": { "district": "កូនមុំ", "province": "រតនគីរី" },
        "តាអង": { "district": "កូនមុំ", "province": "រតនគីរី" },
        "តឺន": { "district": "កូនមុំ", "province": "រតនគីរី" },
        "ត្រពាំងច្រេស": { "district": "កូនមុំ", "province": "រតនគីរី" },
        "ត្រពាំងក្រហម": { "district": "កូនមុំ", "province": "រតនគីរី" },
        "លំផាត់": { "district": "លំផាត់", "province": "រតនគីរី" },
        "ជ័យឧត្ដម": { "district": "លំផាត់", "province": "រតនគីរី" },
        "កាឡែង": { "district": "លំផាត់", "province": "រតនគីរី" },
        "ល្បាំង១": { "district": "លំផាត់", "province": "រតនគីរី" },
        "ល្បាំង២": { "district": "លំផាត់", "province": "រតនគីរី" },
        "បាតាង": { "district": "លំផាត់", "province": "រតនគីរី" },
        "សេដា": { "district": "លំផាត់", "province": "រតនគីរី" },
        "អូរជុំ": { "district": "អូរជុំ", "province": "រតនគីរី" },
        "ចាអ៊ុង": { "district": "អូរជុំ", "province": "រតនគីរី" },
        "ប៉ូយ": { "district": "អូរជុំ", "province": "រតនគីរី" },
        "ឯកភាព": { "district": "អូរជុំ", "province": "រតនគីរី" },
        "កាឡៃ": { "district": "អូរជុំ", "province": "រតនគីរី" },
        "អូរជុំ": { "district": "អូរជុំ", "province": "រតនគីរី" },
        "សាមគ្គី": { "district": "អូរជុំ", "province": "រតនគីរី" },
        "ល្អក់": { "district": "អូរជុំ", "province": "រតនគីរី" },
        "អូរយ៉ាដាវ": { "district": "អូរយ៉ាដាវ", "province": "រតនគីរី" },
        "បរខាំ": { "district": "អូរយ៉ាដាវ", "province": "រតនគីរី" },
        "លំជ័រ": { "district": "អូរយ៉ាដាវ", "province": "រតនគីរី" },
        "ប៉ក់ញ៉ៃ": { "district": "អូរយ៉ាដាវ", "province": "រតនគីរី" },
        "ប៉ាតេ": { "district": "អូរយ៉ាដាវ", "province": "រតនគីរី" },
        "សេសាន": { "district": "អូរយ៉ាដាវ", "province": "រតនគីរី" },
        "សោមធំ": { "district": "អូរយ៉ាដាវ", "province": "រតនគីរី" },
        "យ៉ាទុង": { "district": "អូរយ៉ាដាវ", "province": "រតនគីរី" },
        "តាវែង": { "district": "តាវែង", "province": "រតនគីរី" },
        "តាវែងលើ": { "district": "តាវែង", "province": "រតនគីរី" },
        "តាវែងក្រោម": { "district": "តាវែង", "province": "រតនគីរី" },
        "វ៉ឺនសៃ": { "district": "វ៉ឺនសៃ", "province": "រតនគីរី" },
        "ប៉ុង": { "district": "វ៉ឺនសៃ", "province": "រតនគីរី" },
        "ហាត់ប៉ក់": { "district": "វ៉ឺនសៃ", "province": "រតនគីរី" },
        "កាចូន": { "district": "វ៉ឺនសៃ", "province": "រតនគីរី" },
        "កោះប៉ង់": { "district": "វ៉ឺនសៃ", "province": "រតនគីរី" },
        "កោះពាក្យ": { "district": "វ៉ឺនសៃ", "province": "រតនគីរី" },
        "កុកឡាក់": { "district": "វ៉ឺនសៃ", "province": "រតនគីរី" },
        "ប៉ាកាឡាន់": { "district": "វ៉ឺនសៃ", "province": "រតនគីរី" },
        "ភ្នំកុក": { "district": "វ៉ឺនសៃ", "province": "រតនគីរី" },
        "វើនសៃ": { "district": "វ៉ឺនសៃ", "province": "រតនគីរី" },
        //  រតនគីរី [16]

        "ចារឈូក": { "district": "អង្គរជុំ", "province": "សៀមរាប" },
        "ដូនពេង": { "district": "អង្គរជុំ", "province": "សៀមរាប" },
        "គោកដូង": { "district": "អង្គរជុំ", "province": "សៀមរាប" },
        "គោល": { "district": "អង្គរជុំ", "province": "សៀមរាប" },
        "នគរភាស": { "district": "អង្គរជុំ", "province": "សៀមរាប" },
        "ស្រែខ្វាវ": { "district": "អង្គរជុំ", "province": "សៀមរាប" },
        "តាសោម": { "district": "អង្គរជុំ", "province": "សៀមរាប" },
        "ជប់តាត្រាវ": { "district": "អង្គរធំ", "province": "សៀមរាប" },
        "លាងដៃ": { "district": "អង្គរធំ", "province": "សៀមរាប" },
        "ពាក់ស្នែង": { "district": "អង្គរធំ", "province": "សៀមរាប" },
        "ស្វាយចេក": { "district": "អង្គរធំ", "province": "សៀមរាប" },
        "ខ្នារសណ្តាយ": { "district": "បន្ទាយស្រី", "province": "សៀមរាប" },
        "ឃុនរាម": { "district": "បន្ទាយស្រី", "province": "សៀមរាប" },
        "ព្រះដាក់": { "district": "បន្ទាយស្រី", "province": "សៀមរាប" },
        "រំចេក": { "district": "បន្ទាយស្រី", "province": "សៀមរាប" },
        "រុនតាឯក": { "district": "បន្ទាយស្រី", "province": "សៀមរាប" },
        "ត្បែង": { "district": "បន្ទាយស្រី", "province": "សៀមរាប" },
        "អង្គរជុំ": { "district": "ជីក្រែង", "province": "សៀមរាប" },
        "ជីក្រែង": { "district": "ជីក្រែង", "province": "សៀមរាប" },
        "កំពង់ក្តី": { "district": "ជីក្រែង", "province": "សៀមរាប" },
        "ខ្វាវ": { "district": "ជីក្រែង", "province": "សៀមរាប" },
        "គោកធ្លកក្រោម": { "district": "ជីក្រែង", "province": "សៀមរាប" },
        "គោកធ្លកលើ": { "district": "ជីក្រែង", "province": "សៀមរាប" },
        "ល្វែងឫស្សី": { "district": "ជីក្រែង", "province": "សៀមរាប" },
        "ពង្រក្រោម": { "district": "ជីក្រែង", "province": "សៀមរាប" },
        "ពង្រលើ": { "district": "ជីក្រែង", "province": "សៀមរាប" },
        "ឫស្សីលក": { "district": "ជីក្រែង", "province": "សៀមរាប" },
        "សង្វើយ": { "district": "ជីក្រែង", "province": "សៀមរាប" },
        "ស្ពានត្នោត": { "district": "ជីក្រែង", "province": "សៀមរាប" },
        "ចន្លាស់ដៃ": { "district": "ក្រឡាញ់", "province": "សៀមរាប" },
        "កំពង់ថ្កូវ": { "district": "ក្រឡាញ់", "province": "សៀមរាប" },
        "ក្រឡាញ់": { "district": "ក្រឡាញ់", "province": "សៀមរាប" },
        "ក្រូចគរ": { "district": "ក្រឡាញ់", "province": "សៀមរាប" },
        "រោងគោ": { "district": "ក្រឡាញ់", "province": "សៀមរាប" },
        "សំបួរ": { "district": "ក្រឡាញ់", "province": "សៀមរាប" },
        "សែនសុខ": { "district": "ក្រឡាញ់", "province": "សៀមរាប" },
        "ស្នួល": { "district": "ក្រឡាញ់", "province": "សៀមរាប" },
        "ស្រណាល": { "district": "ក្រឡាញ់", "province": "សៀមរាប" },
        "តាអាន": { "district": "ក្រឡាញ់", "province": "សៀមរាប" },
        "សសរស្តម្ភ": { "district": "ពួក", "province": "សៀមរាប" },
        "ដូនកែវ": { "district": "ពួក", "province": "សៀមរាប" },
        "ក្តីរុន": { "district": "ពួក", "province": "សៀមរាប" },
        "កែវពណ៌": { "district": "ពួក", "province": "សៀមរាប" },
        "ខ្នាត": { "district": "ពួក", "province": "សៀមរាប" },
        "ល្វា": { "district": "ពួក", "province": "សៀមរាប" },
        "មុខប៉ែន": { "district": "ពួក", "province": "សៀមរាប" },
        "ពោធិទ្រាយ": { "district": "ពួក", "province": "សៀមរាប" },
        "ពួក": { "district": "ពួក", "province": "សៀមរាប" },
        "ព្រៃជ្រូក": { "district": "ពួក", "province": "សៀមរាប" },
        "រើស": { "district": "ពួក", "province": "សៀមរាប" },
        "សំរោងយា": { "district": "ពួក", "province": "សៀមរាប" },
        "ត្រីញ័រ": { "district": "ពួក", "province": "សៀមរាប" },
        "យាង": { "district": "ពួក", "province": "សៀមរាប" },
        "អំពិល": { "district": "ប្រាសាទបាគង", "province": "សៀមរាប" },
        "បាគង": { "district": "ប្រាសាទបាគង", "province": "សៀមរាប" },
        "បល្ល័ង្គ": { "district": "ប្រាសាទបាគង", "province": "សៀមរាប" },
        "កំពង់ភ្លុក": { "district": "ប្រាសាទបាគង", "province": "សៀមរាប" },
        "កន្ទ្រាំង": { "district": "ប្រាសាទបាគង", "province": "សៀមរាប" },
        "កណ្តែក": { "district": "ប្រាសាទបាគង", "province": "សៀមរាប" },
        "មានជ័យ": { "district": "ប្រាសាទបាគង", "province": "សៀមរាប" },
        "រលួស": { "district": "ប្រាសាទបាគង", "province": "សៀមរាប" },
        "ត្រពាំងធំ": { "district": "ប្រាសាទបាគង", "province": "សៀមរាប" },
        "ស្លក្រាម": { "district": "ក្រុងសៀមរាប", "province": "សៀមរាប" },
        "ស្វាយដង្គំ": { "district": "ក្រុងសៀមរាប", "province": "សៀមរាប" },
        "គោកចក": { "district": "ក្រុងសៀមរាប", "province": "សៀមរាប" },
        "សាលាកំរើក": { "district": "ក្រុងសៀមរាប", "province": "សៀមរាប" },
        "នគរធំ": { "district": "ក្រុងសៀមរាប", "province": "សៀមរាប" },
        "ជ្រាវ": { "district": "ក្រុងសៀមរាប", "province": "សៀមរាប" },
        "ចុងឃ្នៀស": { "district": "ក្រុងសៀមរាប", "province": "សៀមរាប" },
        "សំបួរ": { "district": "ក្រុងសៀមរាប", "province": "សៀមរាប" },
        "សៀមរាប": { "district": "ក្រុងសៀមរាប", "province": "សៀមរាប" },
        "ស្រង៉ែ": { "district": "ក្រុងសៀមរាប", "province": "សៀមរាប" },
        "ក្របីរៀល": { "district": "ក្រុងសៀមរាប", "province": "សៀមរាប" },
        "ទឹកវិល": { "district": "ក្រុងសៀមរាប", "province": "សៀមរាប" },
        "ចាន់ស": { "district": "សូទ្រនិគម", "province": "សៀមរាប" },
        "ដំដែក": { "district": "សូទ្រនិគម", "province": "សៀមរាប" },
        "ដានរុន": { "district": "សូទ្រនិគម", "province": "សៀមរាប" },
        "កំពង់ឃ្លាំង": { "district": "សូទ្រនិគម", "province": "សៀមរាប" },
        "កៀនសង្កែ": { "district": "សូទ្រនិគម", "province": "សៀមរាប" },
        "ខ្ចាស់": { "district": "សូទ្រនិគម", "province": "សៀមរាប" },
        "ខ្នារពោធិ៍": { "district": "សូទ្រនិគម", "province": "សៀមរាប" },
        "ពពេល": { "district": "សូទ្រនិគម", "province": "សៀមរាប" },
        "សំរោង": { "district": "សូទ្រនិគម", "province": "សៀមរាប" },
        "តាយ៉ែក": { "district": "សូទ្រនិគម", "province": "សៀមរាប" },
        "ជ្រោយនាងងួន": { "district": "ស្រីស្នំ", "province": "សៀមរាប" },
        "ក្លាំងហាយ": { "district": "ស្រីស្នំ", "province": "សៀមរាប" },
        "ត្រាំសសរ": { "district": "ស្រីស្នំ", "province": "សៀមរាប" },
        "មោង": { "district": "ស្រីស្នំ", "province": "សៀមរាប" },
        "ប្រីយ៍": { "district": "ស្រីស្នំ", "province": "សៀមរាប" },
        "ស្លែងស្ពាន": { "district": "ស្រីស្នំ", "province": "សៀមរាប" },
        "បឹងមាលា": { "district": "ស្វាយលើ", "province": "សៀមរាប" },
        "កន្ទួត": { "district": "ស្វាយលើ", "province": "សៀមរាប" },
        "ខ្នងភ្នំ": { "district": "ស្វាយលើ", "province": "សៀមរាប" },
        "ស្វាយលើ": { "district": "ស្វាយលើ", "province": "សៀមរាប" },
        "តាសៀម": { "district": "ស្វាយលើ", "province": "សៀមរាប" },
        "ប្រាសាទ": { "district": "វ៉ារិន", "province": "សៀមរាប" },
        "ល្វាក្រាំង": { "district": "វ៉ារិន", "province": "សៀមរាប" },
        "ស្រែណូយ": { "district": "វ៉ារិន", "province": "សៀមរាប" },
        "ស្វាយស": { "district": "វ៉ារិន", "province": "សៀមរាប" },
        "វ៉ារិន": { "district": "វ៉ារិន", "province": "សៀមរាប" },
        "រុនតាឯក": { "district": "ក្រុងរុនតាឯក", "province": "សៀមរាប" },
        "បល្ល័ង្ក": { "district": "ក្រុងរុនតាឯក", "province": "សៀមរាប" },

        // សៀមរាប [  17 ]


        "មិត្តភាព": { "district": "ក្រុងព្រះសីហនុ", "province": "ព្រះសីហនុ" },
        "ព្រៃនប់": { "district": "ក្រុងព្រះសីហនុ", "province": "ព្រះសីហនុ" },
        "ស្ទឹងហាវ": { "district": "ក្រុងព្រះសីហនុ", "province": "ព្រះសីហនុ" },
        "កំពង់សីលា": { "district": "ក្រុងព្រះសីហនុ", "province": "ព្រះសីហនុ" },
      
        "អណ្ដូងថ្ម": { "district": "ព្រៃនប់", "province": "ព្រះសីហនុ" },
        "បឹងតាព្រហ្ម": { "district": "ព្រៃនប់", "province": "ព្រះសីហនុ" },
        "បិតត្រាំង": { "district": "ព្រៃនប់", "province": "ព្រះសីហនុ" },
        "ជើងគោ": { "district": "ព្រៃនប់", "province": "ព្រះសីហនុ" },
        "អូរជ្រៅ": { "district": "ព្រៃនប់", "province": "ព្រះសីហនុ" },
        "អូរឧញ៉ាហេង": { "district": "ព្រៃនប់", "province": "ព្រះសីហនុ" },
        "ព្រៃនប់": { "district": "ព្រៃនប់", "province": "ព្រះសីហនុ" },
        "រាម": { "district": "ព្រៃនប់", "province": "ព្រះសីហនុ" },
        "សាមគ្គី": { "district": "ព្រៃនប់", "province": "ព្រះសីហនុ" },
        "សំរុង": { "district": "ព្រៃនប់", "province": "ព្រះសីហនុ" },
        "ទឹកល្អក់": { "district": "ព្រៃនប់", "province": "ព្រះសីហនុ" },
        "ទឹកថ្លា": { "district": "ព្រៃនប់", "province": "ព្រះសីហនុ" },
        "ទួលទទឹង": { "district": "ព្រៃនប់", "province": "ព្រះសីហនុ" },
        "វាលរេញ": { "district": "ព្រៃនប់", "province": "ព្រះសីហនុ" },
        "តានៃ": { "district": "ព្រៃនប់", "province": "ព្រះសីហនុ" },
      
        "កំពេញ": { "district": "ស្ទឹងហាវ", "province": "ព្រះសីហនុ" },
        "អូរត្រេះ": { "district": "ស្ទឹងហាវ", "province": "ព្រះសីហនុ" },
        "ទំនប់រលក": { "district": "ស្ទឹងហាវ", "province": "ព្រះសីហនុ" },
      
        "ចំការហ្លួង": { "district": "កំពង់សិលា", "province": "ព្រះសីហនុ" },
        "កំពង់សីលា": { "district": "កំពង់សិលា", "province": "ព្រះសីហនុ" },
        "អូរបាក់រទេះ": { "district": "កំពង់សិលា", "province": "ព្រះសីហនុ" },
        "ស្ទឹងឆាយ": { "district": "កំពង់សិលា", "province": "ព្រះសីហនុ" },
      
        "កោះរ៉ុង": { "district": "កោះរ៉ុង", "province": "ព្រះសីហនុ" },
        "កំពង់សោម": { "district": "ក្រុងកំពង់សោម", "province": "ព្រះសីហនុ" },
        // សៀមរាបពរះសីហនុ [18]
      

    },
    districts: {
        "មង្គលបុរី": [
            "បន្ទាយនាង", "បត់ត្រង់", "ចំណោម", "គោកបល្ល័ង្គ", "គយម៉ែង", 
            "អូរប្រាសាទ", "ភ្នំតូច", "រហាត់ទឹក", "ឫស្សីក្រោក", "សំបួរ", 
            "ឃុំសឿ", "ឃុំស្រះរាំង", "ឃុំតាឡំ"
        ],
        "ភ្នំស្រុក": [
            "នាំតៅ", "ប៉ោយចារ", "ពន្លៃ", "ស្ពានស្រែង", 
            "ស្រះជីក", "ភ្នំដី"
        ],
        "ព្រះនេត្រព្រះ": [
            "ឈ្នួរមានជ័យ", 
            "ជប់វារី", 
            "ភ្នំលៀប", 
            "ប្រាសាទ", 
            "ព្រះនេត្រព្រះ", 
            "រហាល", 
            "ទានកាំ", 
            "ទឹកជោរ"
          ],
          "អូរជ្រៅ": [
            "ចង្ហា", "កូប", "គុត្តសត", "និមិត្ត", 
            "សំរោង", "សូភី", "សឹង្ហ", "ប៉ោយប៉ែត", "អូរបីជាន់"
          ],                                 //    "បន្ទាយមានជ័យ",(1)
          "សិរីសោភ័ណ": [
            "បុស្បូវ", "កំពង់ស្វាយ", "កោះពងសត្វ", "ម្កាក់", 
            "អូរអំបិល", "ភ្នៀត", "ព្រះពន្លា", "ទឹកថ្លា"
          ],
          "ថ្មពួក": [
            "បន្ទាយឆ្មារ", "គោករមៀត", "ថ្មពួក", "គោកកឋិន", 
            "គំរូ", "ភូមិថ្មី"
          ],
        "ស្វាយចេក": [
            "ផ្គាំ", "សារង្គ", "ស្លក្រាម", "ស្វាយចេក", "តាបែន", 
            "តាផូ", "ទ្រាស", "រលួស"
        ],
        "ម៉ាឡៃ": [
            "បឹងបេង", "ឃុំម៉ាឡៃ", "អូរសំព័រ", "អូរស្រឡៅ", 
            "ទួលពង្រ", "តាគង់"
        ],
        "ប៉ោយប៉ែត": [
            "និមិត្ត", "ប៉ោយប៉ែត", "ផ្សារកណ្ដាល", "អូរជ្រៅ", "អូរឬស្សី"
        ],

        "បាណន់": [
        "កន្ទឺ ១", "កន្ទឺ ២", "បាយដំរាំ", "ឈើទាល", "ចែងមានជ័យ", "ភ្នំសំពៅ", "ស្នឹង", "តាគ្រាម"
        ],
        "ថ្មគោល": [
            "តាពូង", "តាម៉ឺន", "អូរតាគី", "ជ្រៃ"
        ],
        "រុក្ខគីរី": [
            "អន្លង់រុន", "ជ្រោយស្តៅ", "បឹងព្រីង", "គោកឃ្មុំ", "បន្សាយត្រែង", "រូងជ្រៃ"
        ],
        "បវេល": [
            "បវេល", "ខ្នាចរមាស", "ល្វា", "ព្រៃខ្ពស់", "អំពិលប្រាំដើម", "ក្តុលតាហែន", "បឹងប្រាំ", "ឃ្លាំងមាស"
        ],
        "ឯកភ្នំ": [
            "ព្រែកនរិន្ទ", "សំរោងក្នុង", "ព្រែកខ្ពប", "ព្រែកហ្លួង", "ពាមឯក", "ព្រៃចាស់", "កោះជីវាំង"
        ],                                                              //    "បាត់ដំបង",(2)
        "ម៉ោងឫស្សី": [
            "ម៉ោង", "គារ", "ព្រៃស្វាយ", "ឫស្សីក្រាំង", "ជ្រៃ", "តាលាស់", "កកោះ", "ព្រៃតូច", "របស់មង្គល"                                        //    "បាត់ដំបង",(2)
        ],
        "រតនមណ្ឌល": [
            "ស្ដៅ", "អណ្ដើកហែប", "ផ្លូវមាស", "ត្រែង", "រស្មីសង្ហារ"
        ],
        "សង្កែ": [
            "អន្លង់វិល", "នរា", "តាប៉ុន", "រកា", "កំពង់ព្រះ", "កំពង់ព្រៀង", "រាំងកេសី", "អូរដំបង ១", "អូរដំបង ២", "វត្តតាមិម"
        ],
        "សំឡូត": [
            "ស៊ុង", "មានជ័យ", "សំឡូត", "កំពង់ល្ពៅ", "អូរសំរិល", "តាតោក", "តាសាញ"
        ],
        "សំពៅលូន": [
            "អង្គរបាន", "សិរីមានជ័យ", "សន្តិភាព", "តាសា្ត", "សំពៅលូន", "ជ្រៃសីមា"
        ],
        "ភ្នំព្រឹក": [
            "ភ្នំព្រឹក", "ពេជ្រចិន្ដា", "បួរ", "បារាំងធ្លាក់", "អូររំដួល"
        ],
        "កំរៀង": [
            "កំរៀង", "អូរដា", "បឹងរាំង", "ត្រាង", "តាសែន", "តាក្រី"
        ],
        "គាស់ក្រឡ": [
            "ឆ្នាល់មាន់", "ដូនបា", "ហប់", "គាស់ក្រឡ", "ព្រះផុស", "ធិបតី"
        ],

        "បាធាយ": [
                    "បាធាយ", "ច្បារអំពៅ", "ជាលា", "ជើងព្រៃ", "មេព្រីង", "ផ្អាវ", "សំបូរ", "សណ្ដែក", "តាំងក្រាំង", "តាំងក្រសាំង", "ត្រប់", "ទំនប់"
                    ],
                    "ចំការលើ": [
                        "បុសខ្នុរ", "ចំការអណ្តូង", "ជយោ", "ល្វាលើ", "ស្ពឺ", "ស្វាយទាប", "តាអុង", "តាប្រុក"
                    ],
                    "ជើងព្រៃ": [
                        "ខ្នុរដំបង", "គោករវៀង", "ផ្តៅជុំ", "ព្រៃចារ", "ព្រីងជ្រំ", "សំពងជ័យ", "ស្តើងជ័យ", "សូទិប", "ស្រម៉រ", "ត្រពាំងគរ"
                    ],
                    "កំពង់ចាម": [
                        "បឹងកុក", "កំពង់ចាម", "សំបួរមាស", "វាលវង់"
                    ],
                    "កំពង់សៀម": [
                        "អំពិល", "ហាន់ជ័យ", "កៀនជ្រៃ", "គគរ", "កោះមិត្ត", "កោះរកា", "កោះសំរោង", "កោះទន្ទឹម", "ក្រឡា", "អូរស្វាយ", "រអាង", "រំចេក", "ស្រក", "ប្រទាន", "វិហារធំ"
                    ],
                    "កងមាស": [
                        "អង្គរបាន", "កងតាណឹង", "ខ្ចៅ", "ពាមជីកង", "ព្រែកកុយ", "ព្រែកក្របៅ", "រាយប៉ាយ", "រកាអារ", "រកាគយ", "ស្តៅ", "សូរគង"
                                                                                                                                                                    //កំពង់ចាម (3)
                    ],
                    "កោះសូទិន": [
                        "កំពង់រាប", "កោះសូទិន", "ល្វេ", "មហាលាភ", "មហាខ្ញូង", "ពាមប្រធ្នោះ", "ពង្រ", "ព្រែកតានង់"
                    ],
                    "ព្រៃឈរ": [
                        "បារាយណ៍", "បឹងណាយ", "ជ្រៃវៀន", "ខ្វិតធំ", "គរ", "ក្រូច", "ល្វា", "មៀន", "ព្រៃឈរ", "សូរ្យសែន", "សំរោង", "ស្រង៉ែ", "ថ្មពូន", "តុងរ៉ុង", "ត្រពាំងព្រះ"
                    ],
                    "ស្រីសន្ធរ": [
                        "បារាយណ៍", "ជីបាល", "ខ្នារស", "កោះអណ្តែត", "មានជ័យ", "ផ្ទះកណ្តាល", "ប្រាំយ៉ាម", "ព្រែកដំបូក", "ព្រែកពោធិ", "ព្រែករំដេង", "ឫស្សីស្រុក", "ស្វាយពោធិ", "ស្វាយសាច់ភ្នំ", "ទងត្រឡាច"
                    ],
                    "ស្ទឹងត្រង់": [
                        "អារក្សត្នោត", "ដងក្តារ", "ខ្ពបតាងួន", "មេសរជ្រៃ", "អូរម្លូ", "ពាមកោះស្នា", "ព្រះអណ្តូង", "ព្រែកបាក់", "ព្រែកកក់", "សូភាស", "ទួលព្រះឃ្លាំង", "ទួលសំបួរ"
                    ],

          "បសេដ្ឋ": [
            "បសេដ្ឋ",
            "កាត់ភ្លុក",
            "និទាន",
            "ភក្ដី",
            "ភារីមានជ័យ",
            "ផុង",
            "ពោធិអង្ក្រង",
            "ពោធិ៍ចំរើន",
            "ពោធិ៍ម្រាល",
            "ស្វាយចចិប",
            "ទួលអំពិល",
            "ទួលសាលា",
            "កក់",
            "ស្វាយរំពារ",
            "ព្រះខែ"
            ],
            "ច្បារមន": [
            "ច្បារមន",
            "កណ្តោលដុំ",
            "រកាធំ",
            "ស្វាយក្រវ៉ាន់",
            "សុព័រទេព"
            ],
            "គងពិសី": [
            "អង្គពពេល",
            "ជង្រុក",
            "មហាឫស្សី",
            "ពេជ្រមុនី",
            "ព្រះនិព្វាន",
            "ព្រៃញាតិ",
            "ព្រៃវិហារ",
            "រកាកោះ",
            "ស្ដុក",
            "ស្នំក្រពើ",
            "ស្រង់",
            "ទឹកល្អក់",
            "វាល"
            ],
            "ឱរ៉ាល់": [
            "ហោងសំណំ",
            "រស្មីសាមគ្គី",
            "ត្រពាំងជោ",
            "សង្កែសាទប",
            "តាសាល"
            ],
            "ក្រុងឧដុង្គម៉ែជ័យ": [
            "វាំងចាស់",
            "វាលពង់",
            "ត្រាចទង",
            "ព្រះស្រែ",
            "ក្សេមក្សាន្ត",
            "ក្រាំងចេក",
            "ចាន់សែន",
            "ជំពូព្រឹក្ស",
            "ព្រៃក្រសាំង",
            "ភ្នំតូច",
            "យុទ្ធសាមគ្កី",
            "ក្សេមក្សាន្ត",
            "ជើងរាស់",
            "ដំណាក់រាំង",
            "ពាំងល្វា",
            "មានជ័យ"
            ],
            "ភ្នំស្រួច": [
            "ចំបក់",
            "ជាំសង្កែ",
            "ដំបូករូង",
            "គិរីវន្ត",
            "ក្រាំងដីវ៉ាយ",
            "មហាសាំង",
            "អូរ",
            "ព្រៃរំដួល",
            "ព្រៃក្មេង",
            "តាំងសំរោង",
            "តាំងស្យា",
            "ត្រែងត្រយឹង"
            ],
            "សំរោងទង": [
            "រលាំងចក",
            "កាហែង",
            "ខ្ទុំក្រាំង",
            "ក្រាំងអំពិល",
            "ព្នាយ",
            "រលាំងគ្រើល",
            "សំរោងទង",
            "សំបូរ",
            "សែងដី",
            "ស្គុះ",
            "តាំងក្រូច",
            "ធម្មតាអរ",
            "ត្រពាំងគង",
            "ទំព័រមាស",
            "វល្លិសរ"
            ],
            "ថ្ពង": [
            "អមលាំង",
            "មនោរម្យ",
            "ប្រាំបីមុម",
            "រុងរឿង",
            "ទ័ពមាន",
            "វាលពន់",
            "យាអង្គ"
            ],
            "បារាយណ៍": [
            "គង់សំរឹទ្ធឧត្ដម", "បល្ល័ង្ក", "បឹង", "ចើងដើង", "ច្រនាង", "ឈូកខ្សាច់",
            "ចុងដូង", "ជ្រលង", "គគីរធំ", "ក្រវ៉ា", "អណ្តូងពោធិ៍", "ពង្រ", "សូយោង",
            "ស្រឡៅ", "ស្វាយភ្លើង", "ត្នោតជុំ", "ទ្រៀល"
            ],
            "កំពង់ស្វាយ": [
                "ជ័យ", "ដំរីស្លាប់", "កំពង់គោ", "កំពង់ស្វាយ", "នីពេជ", "ផាត់សណ្តាយ",
                "សាន់គ", "ត្បែង", "ត្រពាំងឫស្សី", "ក្ដីដូង", "ព្រៃគុយ"
            ],
            "ស្ទឹងសែន": [
                "ព្រៃតាហ៊ូ", "អាចារ្យលាក់", "កំពង់ធំ", "ដំរីជាន់ខ្លា", "ស្រយ៉ូវ", "អូរកន្ធរ"
            ],
            "ប្រាសាទបល្ល័ង្ក": [
                "ដូង", "ក្រយា", "ផាន់ញើម", "សាគ្រាម", "សាលាវិស័យ", "សាមគ្គី", "ទួលគ្រើល"
            ],
            "ប្រាសាទសំបូរ": [
                "ឈូក", "គោល", "សំបូរណ៍", "ស្រើង", "តាំងក្រសៅ"
            ],
            "សណ្ដាន់": [
                "ឈើទាល", "ដងកាំបិត", "ក្លែង", "មានរិទ្ធ", "មានជ័យ", "ងន", "សណ្ដាន់",
                "សុចិត្រ", "ទំរីង"
            ],
            "សន្ទុក": [
                "បឹងល្វា", "ជ្រាប់", "កំពង់ថ្ម", "កកោះ", "ក្រយា", "ព្នៅ", "ប្រាសាទ",
                "តាំងក្រសាំង", "ទីពោ", "ត្បូងក្រពើ"
            ],
            "ស្ទោង": [
                "បន្ទាយស្ទោង", "ចំណាក្រោម", "ចំណាលើ", "កំពង់ចិនជើង", "កំពង់ចិនត្បូង",
                "ម្សាក្រង", "ពាមបាង", "ពពក", "ប្រឡាយ", "ព្រះដំរី", "រុងរឿង", "សំព្រោជ", "ទ្រា"
            ],
            "តាំងគោក": [
                "សូយោង", "ច្រនាង", "ជ្រលង", "អណ្តូងពោធិ៍", "ពង្រ", "ស្រឡៅ", "ស្វាយភ្លើង", "ទ្រៀល"
            ],


            "អង្គរជ័យ": [
            "អង្គភ្នំតូច", "អង្គរជ័យ", "ចំប៉ី", "ដំបូកខ្ពស់", "ដានគោម", "ដើមដូង", "ម្រោម", 
            "ភ្នំកុង", "ប្រភ្នំ", "សំឡាញ", "តានី"
            ],
            "បន្ទាយមាស": [
                "បន្ទាយមាសខាងកើត", "បន្ទាយមាសខាងលិច", "ព្រៃទន្លេ", "សំរោងក្រោម", "សំរោងលើ",
                "ស្ដេចគង់ខាងជើង", "ស្ដេចគង់ខាងលិច", "ស្ដេចគង់ខាងត្បូង", "ត្នោតចុងស្រង់", 
                "ត្រពាំងសាលាខាងកើត", "ត្រពាំងសាលាខាងលិច", "ទូកមាសខាងកើត", "ទូកមាសខាងលិច",
                "វត្ដអង្គខាងជើង", "វត្ដអង្គខាងត្បូង"
            ],
            "ឈូក": [
                "បានៀវ", "តាកែន", "បឹងនិមល", "ឈូក", "ដូនយ៉យ", "ក្រាំងស្បូវ", "ក្រាំងស្នាយ", 
                "ល្បើក", "ត្រពាំងភ្លាំង", "មានជ័យ", "នារាយណ៍", "សត្វពង", "ត្រពាំងបី", "ត្រមែង", "តេជោអភិវឌ្ឍន៍"
            ],
            "ជុំគីរី": [
                "ច្រេស", "ជំពូវន្ដ", "ស្នាយអញ្ជិត", "ស្រែចែង", "ស្រែក្នុង", "ស្រែសំរោង", "ត្រពាំងរាំង"
            ],
            "ដងទង់": [
                "ដំណាក់សុក្រំ", "ដងទង់", "ខ្ជាយខាងជើង", "ខ្ជាយខាងត្បូង", "មានរិទ្ធិ", "ស្រែជាខាងជើង", 
                "ស្រែជាខាងត្បូង", "ទទុង", "អង្គ រមាស", "ល្អាង"
            ],
            "កំពង់ត្រាច": [
                "បឹងសាលាខាងជើង", "បឹងសាលាខាងត្បូង", "ដំណាក់កន្ទួតខាងជើង", "ដំណាក់កន្ទួតខាងត្បូង",
                "កំពង់ត្រាចខាងកើត", "កំពង់ត្រាចខាងលិច", "ប្រាសាទភ្នំខ្យង", "ភ្នំប្រាសាទ", "អង្គសុរភី",
                "ព្រែកក្រឹស", "ឫស្សីស្រុកខាងកើត", "ឫស្សីស្រុកខាងលិច", "ស្វាយទងខាងជើង", "ស្វាយទងខាងត្បូង"
            ],
            "ទឹកឈូ": [
                "សង្កាត់បឹងទូក ក្រុងបូកគោ", "ជុំគ្រៀល", "កំពង់ក្រែង", "កំពង់សំរោង", "កណ្ដោល", "សង្កាត់កោះតូច ក្រុងបូកគោ",
                "កូនសត្វ", "ម៉ាក់ប្រាង្គ", "សង្កាត់ព្រែកត្នោត ក្រុងបូកគោ", "ព្រៃឃ្មុំ", "ព្រៃថ្នង", "ស្ទឹងកែវ",
                "ថ្មី", "ត្រពាំងព្រីង", "ត្រពាំងសង្កែ", "ត្រពាំងធំ"
            ],
            "ក្រុងកំពត": [
                "កំពង់កណ្ដាល", "ក្រាំងអំពិល", "កំពង់បាយ", "អណ្ដូងខ្មែរ", "ត្រើយកោះ"
            ],

            "កណ្ដាលស្ទឹង": [
                "អំពៅព្រៃ", "អន្លង់រមៀត", "បារគូ", "បឹងខ្យាង", "ជើងកើប", "ដើមឫស", "កណ្តោក",
                "ថ្មី", "គោកត្រប់", "ព្រះពុទ្ធ", "ព្រែករកា", "ព្រែកស្លែង", "រកា", "រលាំងកែន",
                "សៀមរាប", "ត្បែង", "ត្រពាំងវែង", "ទ្រា"
              ],
              "កៀនស្វាយ": [
                "បន្ទាយដែក", "ឈើទាល", "ដីឥដ្ឋ", "កំពង់ស្វាយ", "គគីរ", "គគីរធំ(កៀនស្វាយ)", "ភូមិធំ", "សំរោងធំ"
              ],
              "ខ្សាច់កណ្ដាល": [
                "ជ័យធំ", "កំពង់ចំលង", "កោះចូរ៉ាម", "ព្រះប្រសប់", "ព្រែកតាមាក់", "ពុកឫស្សី", "រកាជន្លឹង",
                "សន្លុង", "ស៊ីធរ", "ស្វាយរមៀត", "តាឯក", "វិហារសួគ៌"
              ],
              "ក្រុងអរិយក្សត្រ": [
                "សង្កាត់បាក់ដាវ", "សង្កាត់កោះឧកញ៉ាតី", "សង្កាត់ព្រែកអំពិល", "សង្កាត់ព្រែកលួង", 
                "សង្កាត់ព្រែកតាកូវ", "សង្កាត់ស្វាយជ្រុំ"
              ],
              "កោះធំ": [
                "កំពង់កុង", "កោះធំ ក", "កោះធំ ខ", "លើកដែក", "ពោធិ៍បាន", "ព្រែកថ្មី"
              ],
              "លើកដែក": [
                "កំពង់ភ្នំ", "ក្អមសំណ", "ខ្ពបអាទាវ", "ពាមរាំង", "ព្រែកដាច់", "ព្រែកទន្លាប់", "សណ្ដារ"
              ],
              "ល្វាឯម": [
                "សង្កាត់អរិយក្សត្រ", "សង្កាត់បារុង", "បឹងគ្រំ", "កោះកែវ", "កោះរះ", "ល្វាសរ",
                "សង្កាត់ពាមឧកញ៉ាអុង", "ភូមិធំ", "សង្កាត់ព្រែកក្មេង", "ព្រែករៃ", "ព្រែកឫស្សី", 
                "សំបួរ", "សង្កាត់សារិកាកែវ", "ថ្មគរ", "ទឹកឃ្លាំង"
              ],
              "មុខកំពូល": [
                "ព្រែកអញ្ចាញ", "ព្រែកដំបង", "រកាកោងទី១", "រកាកោងទី២", "ឫស្សីជ្រោយ", "សំបួរមាស", "ស្វាយអំពារ"
              ],
              "អង្គស្នួល": [
                "បែកចាន", "ឆក់ឈើនាង", "ដំណាក់អំពិល", "ក្រាំងម្កាក់", "លំហាច", "ម្កាក់",
                "ពើក", "ពន្សាំង", "ព្រៃពួច", "សំរោងលើ", "ទួលព្រេជ"
              ],
              "ពញាឮ": [
                "ឈ្វាំង", "ជ្រៃលាស់", "កំពង់ហ្លួង", "កំពង់អុស", "កោះចិន", "ភ្នំបាត", 
                "ពញាឮ", "ព្រែកតាទែន", "ផ្សារដែក", "ទំនប់ធំ", "វិហារហ្លួង"
              ],
              "ស្អាង": [
                "ខ្ពប", "កោះអន្លង់ចិន", "កោះខែល", "កោះខ្សាច់ទន្លា", "ក្រាំងយ៉ូវ", "ប្រាសាទ",
                "ព្រែអំបិល", "ព្រែកគយ", "រកាខ្ពស់", "ស្អាងភ្នំ", "សិត្បូ", "ស្វាយប្រទាល", 
                "ស្វាយរលំ", "តាលន់", "ត្រើយស្លា", "ទឹកវិល"
              ],
              "ក្រុងតាខ្មៅ": [
                "សង្កាត់តាក្ដុល", "សង្កាត់ព្រែកឫស្សី", "សង្កាត់ដើមមៀន", "សង្កាត់តាខ្មៅ",
                "សង្កាត់ព្រែកហូរ", "សង្កាត់កំពង់សំណាញ់", "សង្កាត់ស្វាយរលំ", 
                "សង្កាត់កោះអន្លង់ចិន", "សង្កាត់សិត្បូ", "សង្កាត់រកាខ្ពស់"
              ],
              "បុទុមសាគរ": [
                        "អណ្ដូងទឹក",
                        "កណ្ដោល",
                        "តានូន",
                        "ថ្មស"
                    ],
                    "គីរីសាគរ": [
                        "កោះស្ដេច",
                        "ភ្ញីមាស",
                        "ព្រែកខ្សាច់"
                    ],
                    "កោះកុង": [
                        "ជ្រោយប្រស់",
                        "កោះកាពិ",
                        "តាតៃក្រោម",
                        "ត្រពាំងរូង"
                    ],
                    "ខេមរភូមិន្ទ": [
                        "ស្មាច់មានជ័យ",
                        "ដងទង់",
                        "ស្ទឹងវែង"
                    ],
                    "មណ្ឌលសីមា": [
                        "ប៉ាក់ខ្លង",
                        "ពាមក្រសោប",
                        "ទួលគគីរ"
                    ],
                    "ស្រែអំបិល": [
                        "បឹងព្រាវ",
                        "ជីខក្រោម",
                        "ជីខលើ",
                        "ជ្រោយស្វាយ",
                        "ដងពែង",
                        "ស្រែអំបិល"
                    ],
                    "ថ្មបាំង": [
                        "ជឺផាត",
                        "ប្រឡាយ",
                        "ជំនាប់",
                        "ថ្មដូនពៅ",
                        "ឫស្សីជ្រំ",
                        "តាទៃរីល"
                    ],
          "ឆ្លូង": [
        "ឆ្លូង", "ដំរីផុង", "ហាន់ជ័យ", "កំពង់ដំរី", "កញ្ជរ", "ខ្សាច់អណ្ដែត", "ពង្រ", "ព្រែកសាម៉ាន់"
        ],
        "ក្រចេះ": [
            "កន្ទួត", "គោលាប់", "កោះច្រែង", "កោះទ្រង់", "ក្រគរ", "ក្រចេះ", "អូរឫស្សី", "ដារ",
            "បុសលាវ", "ចង្ក្រង់", "រកាកណ្ដាល", "សំបុក", "ថ្មអណ្តើក", "ថ្មគ្រែ(ស្រុកក្រចេះ)", "ថ្មី"
        ],
        "ព្រែកប្រសព្វ": [
            "ចំបក់", "ជ្រោយបន្ទាយ", "កំពង់គរ", "កោះតាស៊ុយ", "ព្រែកប្រសព្វ", "ឫស្សីកែវ", "សោប", "តាម៉ៅ"
        ],
        "សំបូរ": [
            "ក្បាលដំរី", "កោះខ្ញែរ", "អូរគ្រៀង", "រលួសមានជ័យ", "កំពង់ចាម", "បឹងចារ", "សំបូរ", "សណ្តាន់", "ស្រែជិះ", "វឌ្ឍនៈ"
        ],
        "ស្នួល": [
            "ឃ្សឹម", "ពីរធ្នូ", "ស្នួល", "ស្រែចារ", "ស្វាយជ្រះ", "គ្រញូងសែនជ័យ"
        ],
        "ចិត្របុរី": [
            "កន្ទួត", "ថ្មអណ្តើក", "កោះច្រែង", "សំបុក", "គោលាប់", "ថ្មី", "ដា", "បុសលាវ", "ចង្ក្រង់", "ថ្មគ្រែ"
        ],

        "កែវសីមា": [
            "ចុងផ្លាស់", "មេម៉ង់", "ស្រែឈូក", "ស្រែខ្ទុម", "ស្រែព្រះ"
          ],
          "កោះញែក": [
            "ង៉ងឃីលិក", "អបួនលើ", "រយ៉", "សុខសាន្ត", "ស្រែហ៊ុយ", "ស្រែសង្គម"
          ],
          "អូររាំង": [
            "ដាក់ដាំ", "សែនមនោរម្យ"
          ],
          "ពេជ្រចិន្តា": [
            "ក្រង់តេះ", "ពូជ្រៃ", "ស្រែអំពូម", "ប៊ូស្រា"
          ],
          "សែនមនោរម្យ": [
            "មនោរម្យ", "សុខដុម", "ស្ពានមានជ័យ", "រមនា"
          ],
          "ចំការមន": [
            "ទន្លេបាសាក់", "បឹងកេងកងទី១", "បឹងកេងកងទី២", "បឹងកេងកងទី៣",
            "អូឡាំពិក", "ទូលស្វាយព្រៃទី១", "ទូលស្វាយព្រៃទី២", "ទំនប់ទឹក",
            "ទួលទំពូងទី១", "ទួលទំពូងទី២", "បឹងត្របែក", "ផ្សារដើមថ្កូវ"
        ],
        "ដូនពេញ": [
            "ស្រះចក", "វត្តភ្នំ", "ផ្សារចាស់", "ផ្សារកណ្ដាល១", "ផ្សារកណ្ដាល២",
            "ជ័យជំនះ", "ចតុមុខ", "ផ្សារថ្មី១", "ផ្សារថ្មី២", "ផ្សារថ្មី៣", "បឹងរាំង"
        ],
        "ប្រាំពីរមករា": [
            "មនោរម្យ", "មិត្តភាព", "វាលវង់", "អូរឫស្សី១", "អូរឫស្សី២",
            "អូរឫស្សី៣", "អូរឫស្សី៤", "បឹងព្រលិត"
        ],
        "ទួលគោក": [
            "ផ្សារដេប៉ូទី១", "ផ្សារដេប៉ូទី២", "ផ្សារដេប៉ូទី៣", "ទឹកល្អក់ទី១",
            "ទឹកល្អក់ទី២", "ទឹកល្អក់ទី៣", "បឹងកក់ទី១", "បឹងកក់ទី២",
            "ផ្សារដើមគ", "បឹងសាឡាង"
        ],
        "ដង្កោ": [
            "ដង្កោ", "ពងទឹក", "ព្រែកកំពឹស", "ស្ពានថ្ម", "រលួស", "ទៀន", "គងនយ",
            "ព្រៃវែង", "ព្រៃសរ", "ក្រាំងពង្រ", "ប្រទះឡាង", "សាក់សំពៅ", "ជើងឯក"
        ],
        "មានជ័យ": [
            "ចាក់អង្រែលើ", "ចាក់អង្រែក្រោម", "ស្ទឹងមានជ័យទី១", "ស្ទឹងមានជ័យទី២",
            "ស្ទឹងមានជ័យទី៣", "បឹងទំពុនទី១", "បឹងទំពុនទី២"
        ],
        "ឫស្សីកែវ": [
            "ទួលសង្កែ", "ស្វាយប៉ាក", "គីឡូម៉ែត្រលេខប្រាំមួយ", "ឫស្សីកែវ",
            "ព្រែកលាភ", "ព្រែកតាសេក", "ជ្រោយចង្វារ", "ច្រាំងចំរេះ១", 
            "ច្រាំងចំរេះ២", "កោះដាច់", "បាក់ខែង"
        ],
        "សែនសុខ": [
            "ភ្នំពេញថ្មី", "ទឹកថ្លា(ភ្នំពេញ)", "ឃ្មួញ", "ក្រាំងធ្នង់", "អូរបែកក្អម", "គោកឃ្លាង"
        ],
        "ពោធិ៍សែនជ័យ": [
            "កាកាបទី១", "កាកាបទី២", "ចោមចៅទី២", "ចោមចៅទី១", "ចោមចៅទី២", 
            "ចោមចៅទី៣", "សំរោងក្រោម", "ត្រពាំងក្រសាំង"
        ],
        "ច្បារអំពៅ": [
            "ច្បារអំពៅទី១", "ច្បារអំពៅទី២", "និរោធ", "ព្រែកប្រា",
            "វាលស្បូវ", "ព្រែកឯង", "ក្បាលកោះ", "ព្រែកថ្មី"
        ],
        "ជ្រោយចង្វារ": [
            "ជ្រោយចង្វារ", "ព្រែកលៀប", "ព្រែកតាសេក", "បាក់ខែង", "កោះដាច់"
        ],
        "ព្រែកព្នៅ": [
            "ព្រែកព្នៅ", "ពញាពន់", "សំរោង", "គោករកា", "ពន្សាំង"
        ],
        "បឹងកេងកង": [
            "បឹងកេងកងទី១", "បឹងកេងកងទី២", "បឹងកេងកងទី៣",
            "អូរឡាំពិច", "ទំនប់ទឹក", "ទួលស្វាយព្រៃទី១", "ទួលស្វាយព្រៃទី២"
        ],
        "កំបូល": [
            "កំបូល", "កន្ទោក", "ឳឡោក", "ស្នោរ", "ភ្លើងឆេះរទេះ", "បឹងធំ", "ប្រទះឡាង"
        ],
        "ជ័យសែន": [
            "ស្អាង", "តស៊ូ", "ខ្យង", "ច្រាច់", "ធ្មា", "ពុទ្រា"
          ],
          "ឆែប": [
            "ឆែបមួយ", "ឆែបពីរ", "សង្កែមួយ", "សង្កែពីរ", "ម្លូព្រៃមួយ", "ម្លូព្រៃពីរ", "កំពង់ស្រឡៅមួយ", "កំពង់ស្រឡៅពីរ"
          ],
          "ជាំក្សាន្ត": [
            "ជាំក្សាន្ដ", "ទឹកក្រហម", "ព្រីងធំ", "រំដោះស្រែ", "យាង", "កន្ទួត", "ស្រអែម", "មរកត"
          ],
          "គូលែន": [
            "គូលែនត្បូង", "គូលែនជើង", "ថ្មី", "ភ្នំពេញ", "ភ្នំត្បែងពីរ", "ស្រយង់"
          ],
          "រវៀង": [
            "របៀប", "រស្មី", "រហ័ស", "រុងរឿង", "រីករាយ", "រួសរាន់", "រតនៈ", "រៀបរយ", "រក្សា", "រំដោះ", "រមទម", "រមណីយ"
          ],
          "សង្គមថ្មី": [
            "ចំរើន", "រអាង", "ភ្នំត្បែងមួយ", "ស្ដៅ", "រណសិរ្ស"
          ],
          "ត្បែងមានជ័យ": [
            "ឈានមុខ", "ពោធិ៍", "ប្រមេរុ", "ព្រះឃ្លាំង"
          ],
          "ក្រុងព្រះវិហារ": [
            "កំពង់ប្រណាក", "ប៉ាលហាល"
          ],
          "បាភ្នំ": [
            "បឹងព្រះ", 
            "ជើងភ្នំ", 
            "ឈើកាច់", 
            "រក្សជ័យ", 
            "រោងដំរី", 
            "ស្ដៅកោង", 
            "ស្ពឺ ក", 
            "ស្ពឺ ខ", 
            "ធាយ"
          ],
          "កំចាយមារ": [
            "ជាច", 
            "ដូនកឹង", 
            "ក្រញូង", 
            "ក្របៅ", 
            "ស៊ាងឃ្វាង", 
            "ស្មោងខាងជើង", 
            "ស្មោងខាងត្បូង", 
            "ត្របែក"
          ],
          "កំពង់ត្របែក": [
            "អន្សោង", 
            "ចាម", 
            "ជាងដែក", 
            "ជ្រៃ", 
            "កន្សោមអក", 
            "គោខ្ចក", 
            "កំពង់ត្របែក", 
            "ពាមមន្ទារ", 
            "ប្រាសាទ", 
            "ប្រធាតុ", 
            "ព្រៃឈរ", 
            "ព្រៃពោន", 
            "ថ្កូវ"
          ],
          "កញ្ច្រៀច": [
            "ចុងអំពិល", 
            "កញ្ច្រៀច", 
            "ក្ដឿងរាយ", 
            "គោកគង់កើត", 
            "គោកគង់លិច", 
            "ព្រាល", 
            "ថ្មពូន", 
            "ត្នោត"
          ],
          "មេសាង": [
            "អង្គរសរ", 
            "ច្រេស", 
            "ជីផុច", 
            "ព្រៃឃ្នេស", 
            "ព្រៃរំដេង", 
            "ព្រៃទទឹង", 
            "ស្វាយជ្រុំ", 
            "ត្រពាំងស្រែ"
          ],
          "ពាមជរ": [
            "អង្គរអង្គ", 
            "កំពង់ប្រាសាទ", 
            "កោះចេក", 
            "កោះរកា", 
            "កោះសំពៅ", 
            "ក្រាំងតាយ៉ង", 
            "ព្រែកក្របៅ", 
            "ព្រែកសំបួរ", 
            "ឫស្សីស្រុក", 
            "ស្វាយភ្លោះ"
          ],
          "ពាមរ": [
            "បាបោង", 
            "បន្លិចប្រាសាទ", 
            "អ្នកលឿង", 
            "ពាមមានជ័យ", 
            "ពាមរ ក៏", 
            "ព្រែកខ្សាយ ក", 
            "ព្រែកខ្សាយ ខ", 
            "ព្រៃកណ្ដៀង"
          ],
          "ពារាំង": [
            "កំពង់ពពិល", 
            "កញ្ចំ", 
            "កំពង់ប្រាំង", 
            "មេសរប្រចាន់", 
            "ព្រៃព្នៅ", 
            "ព្រៃស្នៀត", 
            "ព្រៃស្រឡិត", 
            "រាប", 
            "រកា"
          ],
          "ព្រះស្ដេច": [
            "អង្គររាជ្យ", 
            "បន្ទាយចក្រី", 
            "បឹងដោល", 
            "ជៃកំពក", 
            "កំពង់សឹង", 
            "ក្រាំងស្វាយ", 
            "ល្វា", 
            "ព្រះស្តេច", 
            "រាធរ", 
            "រំចេក", 
            "សេនារាជឧត្តម"
          ],
          "ក្រុងព្រៃវែង": [
            "សង្កាត់បារាយណ៍", 
            "សង្កាត់ជើងទឹក", 
            "សង្កាត់កំពង់លាវ", 
            "សង្កាត់តាកោ"
          ],
          "ពោធិ៍រៀង": [
            "ពោធិ៍រៀង", 
            "កំពង់ឫស្សី", 
            "ព្រែកអន្ទះ", 
            "ព្រៃកជ្រៃ", 
            "ព្រៃកន្លោង", 
            "ព្រែកតាសរ"
          ],
          "ស៊ីធរកណ្ដាល": [
            "អំពិលក្រៅ", 
            "ជ្រៃឃ្មុំ", 
            "ល្វេ", 
            "ព្នៅទី១", 
            "ព្នៅទី២", 
            "ពោធិទី", 
            "ព្រែកចង្ក្រាន", 
            "ព្រែកដើមថ្នឹង", 
            "ព្រៃទឹង", 
            "រំលេច", 
            "ឫស្សីសាញ់"
          ],
          "ស្វាយអន្ទរ": [
            "អង្គរទ្រេត", 
            "ជាខ្លាង", 
            "ជ្រៃ", 
            "ដំរីពួន", 
            "មេបុណ្យ", 
            "ពានរោង", 
            "ពពឺស", 
            "ព្រៃខ្លា", 
            "សំរោង", 
            "ស្វាយអន្ទរ", 
            "ទឹកថ្លា(ព្រៃវែង)"
          ],
          "បាកាន": [
            "បាកាន", "កណ្តៀង", "ក្រគរ", "ភ្នំក្រវាញ", "ក្រុងពោធិ៍សាត់", "វាលវែង", "តាលោសែនជ័យ"
          ],
          "កណ្ដៀង": [
            "អន្លង់វិល", "កណ្ដៀង", "កញ្ជរ", "រាំងទិល", "ស្រែស្ដុក", "ស្វាយលួង", "ស្យា", "វាល", "កោះជុំ"
          ],
          "ក្រគរ": [
            "អន្លង់ត្នោត", "អន្សាចំបក់", "បឹងកន្ទួត", "ឈើតុំ", "កំពង់លួង", "កំពង់ពោធិ៍", "ក្បាលត្រាច", "អូរសណ្ដាន់", "ស្នាអន្សា", "ស្វាយស", "ត្នោតជុំ"
          ],
          "ភ្នំក្រវាញ": [
            "បាក់ចិញ្ចៀន", "លាច", "ព្រងិល", "រកាត", "សន្ទ្រែ", "សំរោង"
          ],
          "ក្រុងពោធិ៍សាត់": [
            "ចំរើនផល", "លលកស", "ផ្ទះព្រៃ", "ព្រៃញី", "រលាប", "ស្វាយអាត់", "បន្ទាយដី"
          ],
          "វាលវែង": [
            "អន្លង់រាប", "ក្រពើពីរ", "អូរសោម", "ប្រម៉ោយ", "ថ្មដា"
          ],
          "តាលោសែនជ័យ": [
            "តាលោ", "ផ្ទះរុង"
          ],

          "អណ្ដូងមាស": [
            "ម៉ាលិក​", "ញ៉ាង", "តាឡាវ"
          ],
          "ក្រុងបានលុង": [
            "កាចាញ", "ឡាបានសៀក", "យក្ខឡោម", "បឹងកន្សែង"
          ],
          "បរកែវ": [
            "កក់", "កិះចុង", "ឡាមីញ", "លុងឃុង", "ស៊ើង", "ទីងចាក់"
          ],
          "កូនមុំ": [
            "សិរីមង្គល", "ស្រែអង្គ្រង", "តាអង", "តឺន", "ត្រពាំងច្រេស", "ត្រពាំងក្រហម"
          ],
          "លំផាត់": [
            "ជ័យឧត្ដម", "កាឡែង", "ល្បាំង១", "ល្បាំង២", "បាតាង", "សេដា"
          ],
          "អូរជុំ": [
            "ចាអ៊ុង", "ប៉ូយ", "ឯកភាព", "កាឡៃ", "អូរជុំ", "សាមគ្គី", "ល្អក់"
          ],
          "អូរយ៉ាដាវ": [
            "បរខាំ", "លំជ័រ", "ប៉ក់ញ៉ៃ", "ប៉ាតេ", "សេសាន", "សោមធំ", "យ៉ាទុង"
          ],
          "តាវែង": [
            "តាវែងលើ", "តាវែងក្រោម"
          ],
          "វ៉ឺនសៃ": [
            "ប៉ុង", "ហាត់ប៉ក់", "កាចូន", "កោះប៉ង់", "កោះពាក្យ", "កុកឡាក់", "ប៉ាកាឡាន់", "ភ្នំកុក", "វើនសៃ"
          ],
          "អង្គរជុំ": [
            "ចារឈូក", "ដូនពេង", "គោកដូង", "គោល", "នគរភាស", 
            "ស្រែខ្វាវ", "តាសោម"
          ],
          "អង្គរធំ": [
            "ជប់តាត្រាវ", "លាងដៃ", "ពាក់ស្នែង", "ស្វាយចេក"
          ],
          "បន្ទាយស្រី": [
            "ខ្នារសណ្តាយ", "ឃុនរាម", "ព្រះដាក់", "រំចេក", 
            "រុនតាឯក", "ត្បែង"
          ],
          "ជីក្រែង": [
            "អង្គរជុំ", "ជីក្រែង", "កំពង់ក្តី", "ខ្វាវ", 
            "គោកធ្លកក្រោម", "គោកធ្លកលើ", "ល្វែងឫស្សី", 
            "ពង្រក្រោម", "ពង្រលើ", "ឫស្សីលក", "សង្វើយ", 
            "ស្ពានត្នោត"
          ],
          "ក្រឡាញ់": [
            "ចន្លាស់ដៃ", "កំពង់ថ្កូវ", "ក្រឡាញ់", "ក្រូចគរ", 
            "រោងគោ", "សំបួរ", "សែនសុខ", "ស្នួល", "ស្រណាល", "តាអាន"
          ],
          "ពួក": [
            "សសរស្តម្ភ", "ដូនកែវ", "ក្តីរុន", "កែវពណ៌", 
            "ខ្នាត", "ល្វា", "មុខប៉ែន", "ពោធិទ្រាយ", "ពួក", 
            "ព្រៃជ្រូក", "រើស", "សំរោងយា", "ត្រីញ័រ", "យាង"
          ],
          "ប្រាសាទបាគង": [
            "អំពិល", "បាគង", "បល្ល័ង្គ", "កំពង់ភ្លុក", 
            "កន្ទ្រាំង", "កណ្តែក", "មានជ័យ", "រលួស", "ត្រពាំងធំ"
          ],
          "ក្រុងសៀមរាប": [
            "ស្លក្រាម", "ស្វាយដង្គំ", "គោកចក", "សាលាកំរើក", 
            "នគរធំ", "ជ្រាវ", "ចុងឃ្នៀស", "សំបួរ", "សៀមរាប", 
            "ស្រង៉ែ", "ក្របីរៀល", "ទឹកវិល"
          ],
          "សូទ្រនិគម": [
            "ចាន់ស", "ដំដែក", "ដានរុន", "កំពង់ឃ្លាំង", "កៀនសង្កែ", 
            "ខ្ចាស់", "ខ្នារពោធិ៍", "ពពេល", "សំរោង", "តាយ៉ែក"
          ],
          "ស្រីស្នំ": [
            "ជ្រោយនាងងួន", "ក្លាំងហាយ", "ត្រាំសសរ", "មោង", 
            "ប្រីយ៍", "ស្លែងស្ពាន"
          ],
          "ស្វាយលើ": [
            "បឹងមាលា", "កន្ទ្រាំ", "ខ្នងភ្នំ", "ស្វាយលើ", "តាសៀម"
          ],
          "វ៉ារិន": [
            "ប្រាសាទ", "ល្វាក្រាំង", "ស្រែណូយ", "ស្វាយស", "វ៉ារិន"
          ],
          "ក្រុងរុនតាឯក": [
            "រុនតាឯក", "បល្ល័ង"
          ],

    },
    provinces: {
        "បន្ទាយមានជ័យ": [
            "មង្គលបុរី", "ភ្នំស្រុក", "ព្រះនេត្រព្រះ", "អូរជ្រៅ", "សិរីសោភ័ណ", 
            "ថ្មពួក", "ស្វាយចេក", "ម៉ាឡៃ", "ប៉ោយប៉ែត"
        ],
        "បាត់ដំបង": [
            "បាណន់",
            "ថ្មគោល",
            "បាត់ដំបង",
            "បវេល",
            "ឯកភ្នំ",
            "ម៉ោងឫស្សី",
            "រតនមណ្ឌល",
            "សង្កែ",
            "សំឡូត",
            "សំពៅលូន",
            "ភ្នំព្រឹក",
            "កំរៀង",
            "គាស់ក្រឡ",
            "រុក្ខគីរី"
          ],
        "កំពង់ចាម": ["បាធាយ",
            "ចំការលើ",
            "ជើងព្រៃ",
            "កំពង់ចាម",
            "កំពង់សៀម",
            "កងមាស",
            "កោះសូទិន",
            "ព្រៃឈរ",
            "ស្រីសន្ធរ",
            "ស្ទឹងត្រង់",   
                         ],

        "កំពង់ឆ្នាំង": [
                "បរិបូណ៍",
                "ជលគីរី",
                "កំពង់ឆ្នាំង",
                "កំពង់លែង",
                "កំពង់ត្រឡាច",
                "រលាប្អៀរ",
                "សាមគ្គីមានជ័យ",
                "ទឹកផុស"
        ],
        "កំពង់ស្ពឺ": [
            "បសេដ្ឋ",
            "ច្បារមន",
            "គងពិសី",
            "ឱរ៉ាល់",
            "ឧដុង្គ",
            "ភ្នំស្រួច",
            "សំរោងទង",
            "ថ្ពង"
          ],

        "កំពង់ធំ": [
            "បារាយណ៍",
            "កំពង់ស្វាយ",
            "ស្ទឹងសែន",
            "ប្រាសាទបល្ល័ង្ក",
            "ប្រាសាទសំបូរ",
            "សណ្ដាន់",
            "សន្ទុក",
            "ស្ទោង",
            "តាំងគោក",
        ],
        "កំពត": [
            "អង្គរជ័យ",
            "បន្ទាយមាស",
            "ឈូក",
            "ជុំគីរី",
            "ដងទង់",
            "កំពង់ត្រាច",
            "ទឹកឈូ",
            "ក្រុងកំពត",
        ],
        "កណ្តាល":[
            "កណ្ដាលស្ទឹង",
            "កៀនស្វាយ",
            "ខ្សាច់កណ្ដាល",
            "ក្រុងអរិយក្សត្រ",
            "កោះធំ",
            "លើកដែក",       //    "កណ្តាល", (8)
            "ល្វាឯម",
            "មុខកំពូល",
            "អង្គស្នួល",
            "ពញាឮ",
            "ស្អាង",
            "ក្រុងតាខ្មៅ"
        ],
        "កោះកុង": [
            "បុទុមសាគរ",
            "គីរីសាគរ",
            "កោះកុង",
            "ខេមរភូមិន្ទ",
            "មណ្ឌលសីមា",
            "ស្រែអំបិល",
            "ថ្មបាំង"
        ],
        "ក្រចេះ": [
            "ឆ្លូង","ក្រចេះ", "ព្រែកប្រសព្វ","សំបូរ","ស្នួល" ,"ចិត្របុរី"
        ],
        "មណ្ឌលគីរី": [
            "កែវសីមា",  "កោះញែក", "អូររាំង", "ពេជ្រចិន្តា", "សែនមនោរម្យ"
        ],
        "ភ្នំពេញ": [
            "ចំការមន", "ដូនពេញ", "ប្រាំពីរមករា", "ទួលគោក", "ដង្កោ", "មានជ័យ",
            "ឫស្សីកែវ", "សែនសុខ", "ពោធិ៍សែនជ័យ", "ច្បារអំពៅ", "ជ្រោយចង្វារ",
            "ព្រែកព្នៅ", "បឹងកេងកង", "កំបូល"
        ],
        "ព្រះវិហារ":[
            "ជ័យសែន",
            "ឆែប",
            "ជាំក្សាន្ត",
            "គូលែន",
            "រវៀង",
            "សង្គមថ្មី",
            "ត្បែងមានជ័យ",
            "ក្រុងព្រះវិហារ"
         ],
         "ព្រៃវែង":[
            "បាភ្នំ",
            "កំចាយមារ",
            "កំពង់ត្របែក",
            "កញ្ច្រៀច",
            "មេសាង",
            "ពាមជរ",
            "ពាមរ",
            "ពារាំង",
            "ព្រះស្ដេច",
            "ក្រុងព្រៃវែង",
            "ពោធិ៍រៀង",
            "ស៊ីធរកណ្ដាល",
            "ស្វាយអន្ទរ"

         ],
         "ពោធិ៍សាត់": [
            "បាកាន",
            "កណ្ដៀង",
            "ក្រគរ",
            "ភ្នំក្រវាញ",
            "ក្រុងពោធិ៍សាត់",
            "វាលវែង",
            "តាលោសែនជ័យ"
         ], 
            "រតនគីរី":[
            "អណ្ដូងមាស",
            "ក្រុងបានលុង",
            "បរកែវ",
            "កូនមុំ",
            "លំផាត់",
            "អូរជុំ",
            "អូរយ៉ាដាវ",
            "តាវែង",
            "វ៉ឺនសៃ"
          ],
        "សៀមរាប":[
            "អង្គរជុំ",
            "អង្គរធំ",
            "បន្ទាយស្រី",
            "ជីក្រែង",
            "ក្រឡាញ់",
            "ពួក",
            "ប្រាសាទបាគង",
            "ក្រុងសៀមរាប",
            "សូទ្រនិគម",
            "ស្រីស្នំ",
            "ស្វាយលើ",
            "វ៉ារិន",
            "ក្រុងរុនតាឯក"
        ],
           
    }
};


