export const addressRelationships = {
    communes: {
        "បន្ទាយនាង": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "បត់ត្រង់": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ចំណោម": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "គោកបល្ល័ង្គ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "គយម៉ែង": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "អូរប្រាសាទ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ភ្នំតូច": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "រហាត់ទឹក": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ឫស្សីក្រោក": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "សំបួរ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ឃុំសឿ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ឃុំស្រះរាំង": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ឃុំតាឡំ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ឃុំណាំតៅ": { district: "2. ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ឃុំប៉ោយចារ": { district: "2. ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ឃុំពន្លៃ": { district: "2. ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ឃុំស្ពានស្រែង": { district: "2. ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ឃុំស្រះជីក": { district: "2. ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ឃុំភ្នំដី": { district: "2. ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" }

    








    },
    districts: {
      "មង្គលបុរី": [
        "បន្ទាយនាង",
        "បត់ត្រង់",
        "ចំណោម",
        "គោកបល្ល័ង្គ",
        "គយម៉ែង",
        "អូរប្រាសាទ",       //    "មង្គលបុរី", "បន្ទាយមានជ័យ" (1)
        "ភ្នំតូច",
        "រហាត់ទឹក",
        "ឫស្សីក្រោក",
        "សំបួរ",
        "សឿ",
        "ស្រះរាំង",
        "តាឡំ"





      ]
    },
    provinces: {
      "បន្ទាយមានជ័យ": ["មង្គលបុរី"]
    }
  };
  