export const addressRelationships = {
    communes: {
        "បន្ទាយនាង": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "បត់ត្រង់": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ចំណោម": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "គោកបល្ល័ង្គ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "គយម៉ែង": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "អូរប្រាសាទ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ភ្នំតូច": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "រហាត់ទឹក": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ឫស្សីក្រោក": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "សំបួរ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ឃុំសឿ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ឃុំស្រះរាំង": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ឃុំតាឡំ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ឃុំណាំតៅ": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ឃុំប៉ោយចារ": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ឃុំពន្លៃ": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ឃុំស្ពានស្រែង": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ឃុំស្រះជីក": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ឃុំភ្នំដី": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ឃុំឈ្នួរមានជ័យ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ឃុំជប់វារី": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ឃុំភ្នំលៀប": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ឃុំប្រាសាទ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ឃុំព្រះនេត្រព្រះ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ឃុំរហាល": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ឃុំទានកាំ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ឃុំទឹកជោរ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ឃុំចង្ហា": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "ឃុំកូប": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "ឃុំគុត្តសត": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "ឃុំនិមិត្ត": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "ឃុំសំរោង": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "ឃុំសូភី": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "ឃុំសឹង្ហ": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "ឃុំប៉ោយប៉ែត": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "ឃុំអូរបីជាន់": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "ឃុំបុស្បូវ": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ឃុំកំពង់ស្វាយ": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ឃុំកោះពងសត្វ": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ឃុំម្កាក់": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ឃុំអូរអំបិល": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ឃុំភ្នៀត": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ឃុំព្រះពន្លា": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ឃុំទឹកថ្លា": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ឃុំបន្ទាយឆ្មារ": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "ឃុំគោករមៀត": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "ឃុំថ្មពួក": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "ឃុំគោកកឋិន": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "ឃុំគំរូ": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "ឃុំភូមិថ្មី": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "ឃុំផ្គាំ": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "ឃុំសារង្គ": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "ឃុំស្លក្រាម": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "ឃុំស្វាយចេក": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "ឃុំតាបែន": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "ឃុំតាផូ": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "ឃុំទ្រាស": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "ឃុំរលួស": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "ឃុំបឹងបេង": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "ឃុំម៉ាឡៃ": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "ឃុំអូរសំព័រ": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "ឃុំអូរស្រឡៅ": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "ឃុំទួលពង្រ": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "ឃុំតាគង់": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "និមិត្ត": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },
        "ប៉ោយប៉ែត": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },
        "ផ្សារកណ្ដាល": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },
        "អូរជ្រៅ": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },
        "អូរឬស្សី": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },








    },
    districts: {
        "មង្គលបុរី": [
            "បន្ទាយនាង", "បត់ត្រង់", "ចំណោម", "គោកបល្ល័ង្គ", "គយម៉ែង", 
            "អូរប្រាសាទ", "ភ្នំតូច", "រហាត់ទឹក", "ឫស្សីក្រោក", "សំបួរ", 
            "ឃុំសឿ", "ឃុំស្រះរាំង", "ឃុំតាឡំ"
        ],
        "ភ្នំស្រុក": [
            "នាំតៅ", "ប៉ោយចារ", "ពន្លៃ", "ស្ពានស្រែង", 
            "ស្រះជីក", "ភ្នំដី"
        ],
        "ព្រះនេត្រព្រះ": [
            "ឈ្នួរមានជ័យ", 
            "ជប់វារី", 
            "ភ្នំលៀប", 
            "ប្រាសាទ", 
            "ព្រះនេត្រព្រះ", 
            "រហាល", 
            "ទានកាំ", 
            "ទឹកជោរ"
          ],
          "អូរជ្រៅ": [
            "ចង្ហា", "កូប", "គុត្តសត", "និមិត្ត", 
            "សំរោង", "សូភី", "សឹង្ហ", "ប៉ោយប៉ែត", "អូរបីជាន់"
          ],
          "សិរីសោភ័ណ": [
            "បុស្បូវ", "កំពង់ស្វាយ", "កោះពងសត្វ", "ម្កាក់", 
            "អូរអំបិល", "ភ្នៀត", "ព្រះពន្លា", "ទឹកថ្លា"
          ],
          "ថ្មពួក": [
            "បន្ទាយឆ្មារ", "គោករមៀត", "ថ្មពួក", "គោកកឋិន", 
            "គំរូ", "ភូមិថ្មី"
          ],
        "ស្វាយចេក": [
            "ផ្គាំ", "សារង្គ", "ស្លក្រាម", "ស្វាយចេក", "តាបែន", 
            "តាផូ", "ទ្រាស", "រលួស"
        ],
        "ម៉ាឡៃ": [
            "បឹងបេង", "ឃុំម៉ាឡៃ", "អូរសំព័រ", "អូរស្រឡៅ", 
            "ទួលពង្រ", "តាគង់"
        ],
        "ប៉ោយប៉ែត": [
            "និមិត្ត", "ប៉ោយប៉ែត", "ផ្សារកណ្ដាល", "អូរជ្រៅ", "អូរឬស្សី"
        ]
    },
    provinces: {
        "បន្ទាយមានជ័យ": [
            "មង្គលបុរី", "ភ្នំស្រុក", "ព្រះនេត្រព្រះ", "អូរជ្រៅ", "សិរីសោភ័ណ", 
            "ថ្មពួក", "ស្វាយចេក", "ម៉ាឡៃ", "ប៉ោយប៉ែត"
        ]
    }
};
