export const addressRelationships = {
    communes: {
        "បន្ទាយនាង": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "បត់ត្រង់": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ចំណោម": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "គោកបល្ល័ង្គ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "គយម៉ែង": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "អូរប្រាសាទ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ភ្នំតូច": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "រហាត់ទឹក": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ឫស្សីក្រោក": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "សំបួរ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "សឿ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ស្រះរាំង": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "តាឡំ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ណាំតៅ": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ប៉ោយចារ": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ពន្លៃ": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ស្ពានស្រែង": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ស្រះជីក": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ភ្នំដី": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ឈ្នួរមានជ័យ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ជប់វារី": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ឃុំភ្នំលៀប": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ប្រាសាទ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ព្រះនេត្រព្រះ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "រហាល": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ទានកាំ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ទឹកជោរ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ចង្ហា": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "កូប": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "គុត្តសត": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "និមិត្ត": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "សំរោង": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "សូភី": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "សឹង្ហ": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "ប៉ោយប៉ែត": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "អូរបីជាន់": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "បុស្បូវ": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "កំពង់ស្វាយ": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "កោះពងសត្វ": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ម្កាក": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "អូរអំបិល": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ភ្នៀត": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ឃុំព្រះពន្លា": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ទឹកថ្លា": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "បន្ទាយឆ្មារ": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "គោករមៀត": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "ថ្មពួក": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "គោកកឋិន": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "គំរូ": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "ភូមិថ្មី": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "ផ្គាំ": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "សារង្គ": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "ស្លក្រាម": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "ស្វាយចេក": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "តាបែន": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "តាផូ": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "ទ្រាស": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "រលួស": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "បឹងបេង": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "ម៉ាឡៃ": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "អូរសំព័រ": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "អូរស្រឡៅ": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "ទួលពង្រ": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "តាគង់": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "និមិត្ត": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },
        "ប៉ោយប៉ែត": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },
        "ផ្សារកណ្ដាល": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },
        "អូរជ្រៅ": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },
        "អូរឬស្សី": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },

        
        "កន្ទឺ ១": { district: "បាណន់", province: "បាត់ដំបង" },
        "កន្ទឺ ២": { district: "បាណន់", province: "បាត់ដំបង" },
        "បាយដំរាំ": { district: "បាណន់", province: "បាត់ដំបង" },
        "ឈើទាល": { district: "បាណន់", province: "បាត់ដំបង" },
        "ចែងមានជ័យ": { district: "បាណន់", province: "បាត់ដំបង" },
        "ភ្នំសំពៅ": { district: "បាណន់", province: "បាត់ដំបង" },
        "ស្នឹង": { district: "បាណន់", province: "បាត់ដំបង" },
        "តាគ្រាម": { district: "បាណន់", province: "បាត់ដំបង" },
        "តាពូង": { district: "ថ្មគោល", province: "បាត់ដំបង" },
        "តាម៉ឺន": { district: "ថ្មគោល", province: "បាត់ដំបង" },
        "អូរតាគី": { district: "ថ្មគោល", province: "បាត់ដំបង" },
        "ជ្រៃ": { district: "ថ្មគោល", province: "បាត់ដំបង" },
        "អន្លង់រុន": { district: "រុក្ខគីរី", province: "បាត់ដំបង" },
        "ជ្រោយស្តៅ": { district: "រុក្ខគីរី", province: "បាត់ដំបង" },
        "បឹងព្រីង": { district: "រុក្ខគីរី", province: "បាត់ដំបង" },
        "គោកឃ្មុំ": { district: "រុក្ខគីរី", province: "បាត់ដំបង" },
        "បន្សាយត្រែង": { district: "រុក្ខគីរី", province: "បាត់ដំបង" },
        "រូងជ្រៃ": { district: "រុក្ខគីរី", province: "បាត់ដំបង" },
        "បវេល": { district: "បវេល", province: "បាត់ដំបង" },
        "ខ្នាចរមាស": { district: "បវេល", province: "បាត់ដំបង" },
        "ល្វា": { district: "បវេល", province: "បាត់ដំបង" },
        "ព្រៃខ្ពស់": { district: "បវេល", province: "បាត់ដំបង" },
        "អំពិលប្រាំដើម": { district: "បវេល", province: "បាត់ដំបង" },
        "ក្តុលតាហែន": { district: "បវេល", province: "បាត់ដំបង" },
        "បឹងប្រាំ": { district: "បវេល", province: "បាត់ដំបង" },
        "ឃ្លាំងមាស": { district: "បវេល", province: "បាត់ដំបង" },
        "ព្រែកនរិន្ទ": { district: "ឯកភ្នំ", province: "បាត់ដំបង" },
        "សំរោងក្នុង": { district: "ឯកភ្នំ", province: "បាត់ដំបង" },
        "ព្រែកខ្ពប": { district: "ឯកភ្នំ", province: "បាត់ដំបង" },
        "ព្រែកហ្លួង": { district: "ឯកភ្នំ", province: "បាត់ដំបង" },
        "ពាមឯក": { district: "ឯកភ្នំ", province: "បាត់ដំបង" },
        "ព្រៃចាស់": { district: "ឯកភ្នំ", province: "បាត់ដំបង" },
        "កោះជីវាំង": { district: "ឯកភ្នំ", province: "បាត់ដំបង" },
        "ម៉ោង": { district: "ម៉ោងឫស្សី", province: "បាត់ដំបង" },
        "គារ": { district: "ម៉ោងឫស្សី", province: "បាត់ដំបង" },
        "ព្រៃស្វាយ": { district: "ម៉ោងឫស្សី", province: "បាត់ដំបង" },
        "ឫស្សីក្រាំង": { district: "ម៉ោងឫស្សី", province: "បាត់ដំបង" },
        "ជ្រៃ": { district: "ម៉ោងឫស្សី", province: "បាត់ដំបង" },
        "តាលាស់": { district: "ម៉ោងឫស្សី", province: "បាត់ដំបង" },
        "កកោះ": { district: "ម៉ោងឫស្សី", province: "បាត់ដំបង" },
        "ព្រៃតូច": { district: "ម៉ោងឫស្សី", province: "បាត់ដំបង" },
        "របស់មង្គល": { district: "ម៉ោងឫស្សី", province: "បាត់ដំបង" },
        "ស្ដៅ": { district: "រតនមណ្ឌល", province: "បាត់ដំបង" },
        "អណ្ដើកហែប": { district: "រតនមណ្ឌល", province: "បាត់ដំបង" },
        "ផ្លូវមាស": { district: "រតនមណ្ឌល", province: "បាត់ដំបង" },
        "ត្រែង": { district: "រតនមណ្ឌល", province: "បាត់ដំបង" },
        "រស្មីសង្ហារ": { district: "រតនមណ្ឌល", province: "បាត់ដំបង" },
        "អន្លង់វិល": { district: "សង្កែ", province: "បាត់ដំបង" },
        "នរា": { district: "សង្កែ", province: "បាត់ដំបង" },
        "តាប៉ុន": { district: "សង្កែ", province: "បាត់ដំបង" },
        "រកា": { district: "សង្កែ", province: "បាត់ដំបង" },
        "កំពង់ព្រះ": { district: "សង្កែ", province: "បាត់ដំបង" },
        "កំពង់ព្រៀង": { district: "សង្កែ", province: "បាត់ដំបង" },
        "រាំងកេសី": { district: "សង្កែ", province: "បាត់ដំបង" },
        "អូរដំបង ១": { district: "សង្កែ", province: "បាត់ដំបង" },
        "អូរដំបង ២": { district: "សង្កែ", province: "បាត់ដំបង" },
        "វត្តតាមិម": { district: "សង្កែ", province: "បាត់ដំបង" },
        "ស៊ុង": { district: "សំឡូត", province: "បាត់ដំបង" },
        "មានជ័យ": { district: "សំឡូត", province: "បាត់ដំបង" },
        "សំឡូត": { district: "សំឡូត", province: "បាត់ដំបង" },
        "កំពង់ល្ពៅ": { district: "សំឡូត", province: "បាត់ដំបង" },
        "អូរសំរិល": { district: "សំឡូត", province: "បាត់ដំបង" },
        "តាតោក": { district: "សំឡូត", province: "បាត់ដំបង" },
        "តាសាញ": { district: "សំឡូត", province: "បាត់ដំបង" },
        "អង្គរបាន": { district: "សំពៅលូន", province: "បាត់ដំបង" },
        "សិរីមានជ័យ": { district: "សំពៅលូន", province: "បាត់ដំបង" },
        "សន្តិភាព": { district: "សំពៅលូន", province: "បាត់ដំបង" },
        "តាសា្ត": { district: "សំពៅលូន", province: "បាត់ដំបង" },
        "សំពៅលូន": { district: "សំពៅលូន", province: "បាត់ដំបង" },
        "ជ្រៃសីមា": { district: "សំពៅលូន", province: "បាត់ដំបង" },
        "ភ្នំព្រឹក": { district: "ភ្នំព្រឹក", province: "បាត់ដំបង" },
        "ពេជ្រចិន្ដា": { district: "ភ្នំព្រឹក", province: "បាត់ដំបង" },
        "បួរ": { district: "ភ្នំព្រឹក", province: "បាត់ដំបង" },
        "បារាំងធ្លាក់": { district: "ភ្នំព្រឹក", province: "បាត់ដំបង" },
        "អូររំដួល": { district: "ភ្នំព្រឹក", province: "បាត់ដំបង" },
        "កំរៀង": { district: "កំរៀង", province: "បាត់ដំបង" },
        "អូរដា": { district: "កំរៀង", province: "បាត់ដំបង" },
        "បឹងរាំង": { district: "កំរៀង", province: "បាត់ដំបង" },
        "ត្រាង": { district: "កំរៀង", province: "បាត់ដំបង" },
        "តាសែន": { district: "កំរៀង", province: "បាត់ដំបង" },
        "តាក្រី": { district: "កំរៀង", province: "បាត់ដំបង" },
        "ឆ្នាល់មាន់": { district: "គាស់ក្រឡ", province: "បាត់ដំបង" },
        "ដូនបា": { district: "គាស់ក្រឡ", province: "បាត់ដំបង" },
        "ហប់": { district: "គាស់ក្រឡ", province: "បាត់ដំបង" },
        "គាស់ក្រឡ": { district: "គាស់ក្រឡ", province: "បាត់ដំបង" },
        "ព្រះផុស": { district: "គាស់ក្រឡ", province: "បាត់ដំបង" },
        "ធិបតី": { district: "គាស់ក្រឡ", province: "បាត់ដំបង" },
        












    },
    districts: {
        "មង្គលបុរី": [
            "បន្ទាយនាង", "បត់ត្រង់", "ចំណោម", "គោកបល្ល័ង្គ", "គយម៉ែង", 
            "អូរប្រាសាទ", "ភ្នំតូច", "រហាត់ទឹក", "ឫស្សីក្រោក", "សំបួរ", 
            "ឃុំសឿ", "ឃុំស្រះរាំង", "ឃុំតាឡំ"
        ],
        "ភ្នំស្រុក": [
            "នាំតៅ", "ប៉ោយចារ", "ពន្លៃ", "ស្ពានស្រែង", 
            "ស្រះជីក", "ភ្នំដី"
        ],
        "ព្រះនេត្រព្រះ": [
            "ឈ្នួរមានជ័យ", 
            "ជប់វារី", 
            "ភ្នំលៀប", 
            "ប្រាសាទ", 
            "ព្រះនេត្រព្រះ", 
            "រហាល", 
            "ទានកាំ", 
            "ទឹកជោរ"
          ],
          "អូរជ្រៅ": [
            "ចង្ហា", "កូប", "គុត្តសត", "និមិត្ត", 
            "សំរោង", "សូភី", "សឹង្ហ", "ប៉ោយប៉ែត", "អូរបីជាន់"
          ],                                 //    "បន្ទាយមានជ័យ",(1)
          "សិរីសោភ័ណ": [
            "បុស្បូវ", "កំពង់ស្វាយ", "កោះពងសត្វ", "ម្កាក់", 
            "អូរអំបិល", "ភ្នៀត", "ព្រះពន្លា", "ទឹកថ្លា"
          ],
          "ថ្មពួក": [
            "បន្ទាយឆ្មារ", "គោករមៀត", "ថ្មពួក", "គោកកឋិន", 
            "គំរូ", "ភូមិថ្មី"
          ],
        "ស្វាយចេក": [
            "ផ្គាំ", "សារង្គ", "ស្លក្រាម", "ស្វាយចេក", "តាបែន", 
            "តាផូ", "ទ្រាស", "រលួស"
        ],
        "ម៉ាឡៃ": [
            "បឹងបេង", "ឃុំម៉ាឡៃ", "អូរសំព័រ", "អូរស្រឡៅ", 
            "ទួលពង្រ", "តាគង់"
        ],
        "ប៉ោយប៉ែត": [
            "និមិត្ត", "ប៉ោយប៉ែត", "ផ្សារកណ្ដាល", "អូរជ្រៅ", "អូរឬស្សី"
        ],

        "បាណន់": [
        "កន្ទឺ ១", "កន្ទឺ ២", "បាយដំរាំ", "ឈើទាល", "ចែងមានជ័យ", "ភ្នំសំពៅ", "ស្នឹង", "តាគ្រាម"
        ],
        "ថ្មគោល": [
            "តាពូង", "តាម៉ឺន", "អូរតាគី", "ជ្រៃ"
        ],
        "រុក្ខគីរី": [
            "អន្លង់រុន", "ជ្រោយស្តៅ", "បឹងព្រីង", "គោកឃ្មុំ", "បន្សាយត្រែង", "រូងជ្រៃ"
        ],
        "បវេល": [
            "បវេល", "ខ្នាចរមាស", "ល្វា", "ព្រៃខ្ពស់", "អំពិលប្រាំដើម", "ក្តុលតាហែន", "បឹងប្រាំ", "ឃ្លាំងមាស"
        ],
        "ឯកភ្នំ": [
            "ព្រែកនរិន្ទ", "សំរោងក្នុង", "ព្រែកខ្ពប", "ព្រែកហ្លួង", "ពាមឯក", "ព្រៃចាស់", "កោះជីវាំង"
        ],
        "ម៉ោងឫស្សី": [
            "ម៉ោង", "គារ", "ព្រៃស្វាយ", "ឫស្សីក្រាំង", "ជ្រៃ", "តាលាស់", "កកោះ", "ព្រៃតូច", "របស់មង្គល"                                        //    "បាត់ដំបង",(2)
        ],
        "រតនមណ្ឌល": [
            "ស្ដៅ", "អណ្ដើកហែប", "ផ្លូវមាស", "ត្រែង", "រស្មីសង្ហារ"
        ],
        "សង្កែ": [
            "អន្លង់វិល", "នរា", "តាប៉ុន", "រកា", "កំពង់ព្រះ", "កំពង់ព្រៀង", "រាំងកេសី", "អូរដំបង ១", "អូរដំបង ២", "វត្តតាមិម"
        ],
        "សំឡូត": [
            "ស៊ុង", "មានជ័យ", "សំឡូត", "កំពង់ល្ពៅ", "អូរសំរិល", "តាតោក", "តាសាញ"
        ],
        "សំពៅលូន": [
            "អង្គរបាន", "សិរីមានជ័យ", "សន្តិភាព", "តាសា្ត", "សំពៅលូន", "ជ្រៃសីមា"
        ],
        "ភ្នំព្រឹក": [
            "ភ្នំព្រឹក", "ពេជ្រចិន្ដា", "បួរ", "បារាំងធ្លាក់", "អូររំដួល"
        ],
        "កំរៀង": [
            "កំរៀង", "អូរដា", "បឹងរាំង", "ត្រាង", "តាសែន", "តាក្រី"
        ],
        "គាស់ក្រឡ": [
            "ឆ្នាល់មាន់", "ដូនបា", "ហប់", "គាស់ក្រឡ", "ព្រះផុស", "ធិបតី"
        ]










    },
    provinces: {
        "បន្ទាយមានជ័យ": [
            "មង្គលបុរី", "ភ្នំស្រុក", "ព្រះនេត្រព្រះ", "អូរជ្រៅ", "សិរីសោភ័ណ", 
            "ថ្មពួក", "ស្វាយចេក", "ម៉ាឡៃ", "ប៉ោយប៉ែត"
        ],
        "បាត់ដំបង": [
            "បាណន់",
            "ថ្មគោល",
            "បាត់ដំបង",
            "បវេល",
            "ឯកភ្នំ",
            "ម៉ោងឫស្សី",
            "រតនមណ្ឌល",
            "សង្កែ",
            "សំឡូត",
            "សំពៅលូន",
            "ភ្នំព្រឹក",
            "កំរៀង",
            "គាស់ក្រឡ",
            "រុក្ខគីរី"
          ],
    }
};
