export const addressRelationships = {
    communes: {
        "បន្ទាយនាង": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "បត់ត្រង់": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ចំណោម": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "គោកបល្ល័ង្គ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "គយម៉ែង": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "អូរប្រាសាទ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ភ្នំតូច": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "រហាត់ទឹក": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ឫស្សីក្រោក": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "សំបួរ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "សឿ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ស្រះរាំង": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "តាឡំ": { district: "មង្គលបុរី", province: "បន្ទាយមានជ័យ" },
        "ណាំតៅ": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ប៉ោយចារ": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ពន្លៃ": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ស្ពានស្រែង": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ស្រះជីក": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ភ្នំដី": { district: "ភ្នំស្រុក", province: "បន្ទាយមានជ័យ" },
        "ឈ្នួរមានជ័យ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ជប់វារី": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ឃុំភ្នំលៀប": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ប្រាសាទ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ព្រះនេត្រព្រះ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "រហាល": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ទានកាំ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ទឹកជោរ": { district: "ព្រះនេត្រព្រះ", province: "បន្ទាយមានជ័យ" },
        "ចង្ហា": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "កូប": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "គុត្តសត": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "និមិត្ត": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "សំរោង": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "សូភី": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "សឹង្ហ": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "ប៉ោយប៉ែត": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "អូរបីជាន់": { district: "អូរជ្រៅ", province: "បន្ទាយមានជ័យ" },
        "បុស្បូវ": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "កំពង់ស្វាយ": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "កោះពងសត្វ": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ម្កាក់": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ឃុំអូរអំបិល": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ឃុំភ្នៀត": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ឃុំព្រះពន្លា": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ឃុំទឹកថ្លា": { district: "សិរីសោភ័ណ", province: "បន្ទាយមានជ័យ" },
        "ឃុំបន្ទាយឆ្មារ": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "ឃុំគោករមៀត": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "ឃុំថ្មពួក": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        គោកកឋិន": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "គំរូ": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "ភូមិថ្មី": { district: "ថ្មពួក", province: "បន្ទាយមានជ័យ" },
        "ផ្គាំ": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "សារង្គ": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "ស្លក្រាម": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "ស្វាយចេក": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "តាបែន": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "តាផូ": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "ទ្រាស": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "រលួស": { district: "ស្វាយចេក", province: "បន្ទាយមានជ័យ" },
        "បឹងបេង": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "ម៉ាឡៃ": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "អូរសំព័រ": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "អូរស្រឡៅ": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "ទួលពង្រ": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "តាគង់": { district: "ម៉ាឡៃ", province: "បន្ទាយមានជ័យ" },
        "និមិត្ត": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },
        "ប៉ោយប៉ែត": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },
        "ផ្សារកណ្ដាល": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },
        "អូរជ្រៅ": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },
        "អូរឬស្សី": { district: "ប៉ោយប៉ែត", province: "បន្ទាយមានជ័យ" },








    },
    districts: {
        "មង្គលបុរី": [
            "បន្ទាយនាង", "បត់ត្រង់", "ចំណោម", "គោកបល្ល័ង្គ", "គយម៉ែង", 
            "អូរប្រាសាទ", "ភ្នំតូច", "រហាត់ទឹក", "ឫស្សីក្រោក", "សំបួរ", 
            "ឃុំសឿ", "ឃុំស្រះរាំង", "ឃុំតាឡំ"
        ],
        "ភ្នំស្រុក": [
            "នាំតៅ", "ប៉ោយចារ", "ពន្លៃ", "ស្ពានស្រែង", 
            "ស្រះជីក", "ភ្នំដី"
        ],
        "ព្រះនេត្រព្រះ": [
            "ឈ្នួរមានជ័យ", 
            "ជប់វារី", 
            "ភ្នំលៀប", 
            "ប្រាសាទ", 
            "ព្រះនេត្រព្រះ", 
            "រហាល", 
            "ទានកាំ", 
            "ទឹកជោរ"
          ],
          "អូរជ្រៅ": [
            "ចង្ហា", "កូប", "គុត្តសត", "និមិត្ត", 
            "សំរោង", "សូភី", "សឹង្ហ", "ប៉ោយប៉ែត", "អូរបីជាន់"
          ],                                 //    "បន្ទាយមានជ័យ",(1)
          "សិរីសោភ័ណ": [
            "បុស្បូវ", "កំពង់ស្វាយ", "កោះពងសត្វ", "ម្កាក់", 
            "អូរអំបិល", "ភ្នៀត", "ព្រះពន្លា", "ទឹកថ្លា"
          ],
          "ថ្មពួក": [
            "បន្ទាយឆ្មារ", "គោករមៀត", "ថ្មពួក", "គោកកឋិន", 
            "គំរូ", "ភូមិថ្មី"
          ],
        "ស្វាយចេក": [
            "ផ្គាំ", "សារង្គ", "ស្លក្រាម", "ស្វាយចេក", "តាបែន", 
            "តាផូ", "ទ្រាស", "រលួស"
        ],
        "ម៉ាឡៃ": [
            "បឹងបេង", "ឃុំម៉ាឡៃ", "អូរសំព័រ", "អូរស្រឡៅ", 
            "ទួលពង្រ", "តាគង់"
        ],
        "ប៉ោយប៉ែត": [
            "និមិត្ត", "ប៉ោយប៉ែត", "ផ្សារកណ្ដាល", "អូរជ្រៅ", "អូរឬស្សី"
        ],









    },
    provinces: {
        "បន្ទាយមានជ័យ": [
            "មង្គលបុរី", "ភ្នំស្រុក", "ព្រះនេត្រព្រះ", "អូរជ្រៅ", "សិរីសោភ័ណ", 
            "ថ្មពួក", "ស្វាយចេក", "ម៉ាឡៃ", "ប៉ោយប៉ែត"
        ],
        "បាត់ដំបង": [
            "បាណន់",
            "ថ្មគោល",
            "បាត់ដំបង",
            "បវេល",
            "ឯកភ្នំ",
            "ម៉ោងឫស្សី",
            "រតនមណ្ឌល",
            "សង្កែ",
            "សំឡូត",
            "សំពៅលូន",
            "ភ្នំព្រឹក",
            "កំរៀង",
            "គាស់ក្រឡ",
            "រុក្ខគីរី"
          ],
    }
};
