export const commune = [
    "បន្ទាយនាង",
    "បត់ត្រង់",
    "ចំណោម",
    "គោកបល្ល័ង្គ",
    "គយម៉ែង",
    "អូរប្រាសាទ",
    "ភ្នំតូច",
    "រហាត់ទឹក",             //    "មង្គលបុរី", "បន្ទាយមានជ័យ" (1)
    "ឫស្សីក្រោក",
    "សំបួរ",                               //ឃុំ
    "សឿ",
    "ស្រះរាំង",
    "តាឡំ",
    "ឃុំណាំតៅ", 


    "ប៉ោយចារ",
    "ពន្លៃ",
    "ស្ពានស្រែង",
    "ស្រះជីក",
    "ភ្នំដី",
  
    "ឈ្នួរមានជ័យ",
    "ជប់វារី",
    "ភ្នំលៀប",
    "ប្រាសាទ",
    "ព្រះនេត្រព្រះ",
    "រហាល",
    "ទានកាំ",
    "ទឹកជោរ",
  
    "ចង្ហា",
    "កូប",
    "គុត្តសត",
    "និមិត្ត",
    "សំរោង",
    "សូភី",
    "សឹង្ហ",
    "ប៉ោយប៉ែត",
    "អូរបីជាន់",
  
    "បុស្បូវ",
    "កំពង់ស្វាយ",
    "កោះពងសត្វ",
    "ម្កាក់",
    "អូរអំបិល",
    "ភ្នៀត",
    "ព្រះពន្លា",
    "ទឹកថ្លា",
  
    "បន្ទាយឆ្មារ",
    "គោករមៀត",
    "ថ្មពួក",
    "គោកកឋិន",
    "គំរូ",
    "ភូមិថ្មី",
  
    "ផ្គាំ",
    "សារង្គ",
    "ស្លក្រាម",
    "ស្វាយចេក",
    "តាបែន",
    "តាផូ",
    "ទ្រាស",
    "រលួស",
  
    "បឹងបេង",
    "ម៉ាឡៃ",
    "អូរសំព័រ",
    "អូរស្រឡៅ",
    "ទួលពង្រ",
    "តាគង់",

    "និមិត្ត", 
    "ប៉ោយប៉ែត", 
    "ផ្សារកណ្ដាល",                                           //    "ប៉ោយប៉ែត", "បន្ទាយមានជ័យ" (9)
    "អូរជ្រៅ", 
    "អូរឬស្សី"

    /////// បន្ទាយមានជ័យ
    [
        "ប៉ោយចារ",
        "ពន្លៃ",
        "ស្ពានស្រែង",
        "ស្រះជីក",
        "ភ្នំដី",
      
        "ឈ្នួរមានជ័យ",
        "ជប់វារី",
        "ភ្នំលៀប",
        "ប្រាសាទ",
        "ព្រះនេត្រព្រះ",
        "រហាល",
        "ទានកាំ",
        "ទឹកជោរ",
      
        "ចង្ហា",
        "កូប",
        "គុត្តសត",
        "និមិត្ត",
        "សំរោង",
        "សូភី",
        "សឹង្ហ",
        "ប៉ោយប៉ែត",
        "អូរបីជាន់",
      
        "បុស្បូវ",
        "កំពង់ស្វាយ",
        "កោះពងសត្វ",
        "ម្កាក់",
        "អូរអំបិល",
        "ភ្នៀត",
        "ព្រះពន្លា",
        "ទឹកថ្លា",
      
        "បន្ទាយឆ្មារ",
        "គោករមៀត",
        "ថ្មពួក",
        "គោកកឋិន",
        "គំរូ",
        "ភូមិថ្មី",
      
        "ផ្គាំ",
        "សារង្គ",
        "ស្លក្រាម",
        "ស្វាយចេក",
        "តាបែន",
        "តាផូ",
        "ទ្រាស",
        "រលួស",
      
        "បឹងបេង",
        "ម៉ាឡៃ",
        "អូរសំព័រ",
        "អូរស្រឡៅ",
        "ទួលពង្រ",
        "តាគង់"
      ]
      


    
];
