export const commune = [
    "បន្ទាយនាង",
    "បត់ត្រង់",
    "ចំណោម",
    "គោកបល្ល័ង្គ",
    "គយម៉ែង",
    "អូរប្រាសាទ",
    "ភ្នំតូច",
    "រហាត់ទឹក",             //    "មង្គលបុរី", "បន្ទាយមានជ័យ" (1)
    "ឫស្សីក្រោក",
    "សំបួរ",                               //ឃុំ
    "សឿ",
    "ស្រះរាំង",
    "តាឡំ",
    "ឃុំណាំតៅ", 



    "ឃុំប៉ោយចារ", 
    "ឃុំពន្លៃ",                     //    "ភ្នំស្រុក", "បន្ទាយមានជ័យ" (2)
    "ឃុំស្ពានស្រែង",                              
    "ឃុំស្រះជីក", 
    "ឃុំភ្នំដី",



    "ឃុំឈ្នួរមានជ័យ", 
    "ឃុំជប់វារី", 
    "ឃុំភ្នំលៀប", 
    "ឃុំប្រាសាទ", 
    "ឃុំព្រះនេត្រព្រះ",             //    "ព្រះនេត្រព្រះ", "បន្ទាយមានជ័យ" (3)
    "ឃុំរហាល", 
    "ឃុំទានកាំ", 
    "ឃុំទឹកជោរ",

    "ឃុំចង្ហា", 
    "ឃុំកូប", 
    "ឃុំគុត្តសត", 
    "ឃុំនិមិត្ត", 
    "ឃុំសំរោង",                 //    "អូរជ្រៅ", "បន្ទាយមានជ័យ" (4)
    "ឃុំសូភី", 
    "ឃុំសឹង្ហ", 
    "ឃុំប៉ោយប៉ែត", 
    "ឃុំអូរបីជាន់",

    "ឃុំបុស្បូវ", 
    "ឃុំកំពង់ស្វាយ", 
    "ឃុំកោះពងសត្វ", 
    "ឃុំម្កាក់", 
    "ឃុំអូរអំបិល",                      //    //    "សិរីសោភ័ណ", "បន្ទាយមានជ័យ" (5)
    "ឃុំភ្នៀត", 
    "ឃុំព្រះពន្លា", 
    "ឃុំទឹកថ្លា",

    "ឃុំបន្ទាយឆ្មារ", 
    "ឃុំគោករមៀត", 
    "ឃុំថ្មពួក",                                 //    "ថ្មពួក", "បន្ទាយមានជ័យ" (6)
    "ឃុំគោកកឋិន", 
    "ឃុំគំរូ", 
    "ឃុំភូមិថ្មី",

    "ឃុំផ្គាំ", 
    "ឃុំសារង្គ", 
    "ឃុំស្លក្រាម", 
    "ឃុំស្វាយចេក",                           //    "ស្វាយចេក", "បន្ទាយមានជ័យ" (7)
    "ឃុំតាបែន", 
    "ឃុំតាផូ", 
    "ឃុំទ្រាស", 
    "ឃុំរលួស"
,
    "ឃុំបឹងបេង", 
    "ឃុំម៉ាឡៃ", 
    "ឃុំអូរសំព័រ",                         //    "ម៉ាឡៃ", "បន្ទាយមានជ័យ" (8)
    "ឃុំអូរស្រឡៅ", 
    "ឃុំទួលពង្រ", 
    "ឃុំតាគង់",

    "និមិត្ត", 
    "ប៉ោយប៉ែត", 
    "ផ្សារកណ្ដាល",                                           //    "ប", "បន្ទាយមានជ័យ" (9)
    "អូរជ្រៅ", 
    "អូរឬស្សី"



];
