export const commune = [
    "បន្ទាយនាង",
    "បត់ត្រង់",
    "ចំណោម",
    "គោកបល្ល័ង្គ",
    "គយម៉ែង",
    "អូរប្រាសាទ",
    "ភ្នំតូច",
    "រហាត់ទឹក",             //    "មង្គលបុរី", "បន្ទាយមានជ័យ" (1)
    "ឫស្សីក្រោក",
    "សំបួរ",                               //ឃុំ
    "សឿ",
    "ស្រះរាំង",
    "តាឡំ",
    "ឃុំណាំតៅ", 



"ឃុំប៉ោយចារ", 
"ឃុំពន្លៃ",                     //    "ភ្នំស្រុក", "បន្ទាយមានជ័យ" (2)
"ឃុំស្ពានស្រែង",                              
"ឃុំស្រះជីក", 
"ឃុំភ្នំដី",



"ឃុំឈ្នួរមានជ័យ", 
"ឃុំជប់វារី", 
"ឃុំភ្នំលៀប", 
"ឃុំប្រាសាទ", 
"ឃុំព្រះនេត្រព្រះ",             //
"ឃុំរហាល", 
"ឃុំទានកាំ", 
"ឃុំទឹកជោរ"







];
