export const district = [
    "មង្គលបុរី",
    "ភ្នំស្រុក",
    "ព្រះនេត្រព្រះ",
    "អូរជ្រៅ",
    "សិរីសោភ័ណ",                  //    "បន្ទាយមានជ័យ",(1)
    "ថ្មពួក",
    "ស្វាយចេក",
    "ម៉ាឡៃ",
    "ប៉ោយប៉ែត",
    
    
    "បាណន់",
    "ថ្មគោល",
    "បាត់ដំបង",
    "បវេល",
    "ឯកភ្នំ",
    "ម៉ោងឫស្សី",
    "រតនមណ្ឌល",                //បាត់ដំបង (2)
    "សង្កែ",
    "សំឡូត",
    "សំពៅលូន",
    "ភ្នំព្រឹក",
    "កំរៀង",
    "គាស់ក្រឡ",
    "រុក្ខគីរី",

    "បាធាយ",
    "ចំការលើ",
    "ជើងព្រៃ",
    "កំពង់ចាម",
    "កំពង់សៀម",              //កំពង់ចាម (3)
    "កងមាស",
    "កោះសូទិន",
    "ព្រៃឈរ",
    "ស្រីសន្ធរ",
    "ស្ទឹងត្រង់",

    "បរិបូណ៍",
    "ជលគីរី",
    "កំពង់ឆ្នាំង",
    "កំពង់លែង",              //កំពង់ឆ្នាំង (4)
    "កំពង់ត្រឡាច",
    "រលាប្អៀរ",
    "សាមគ្គីមានជ័យ",
    "ទឹកផុស",




    "បសេដ្ឋ",
    "ច្បារមន",
    "គងពិសី",
    "ឱរ៉ាល់",            //    "កំពង់ស្ពឺ", (5)
    "ឧដុង្គ",
    "ភ្នំស្រួច",
    "សំរោងទង",
    "ថ្ពង",


    "បារាយណ៍",
    "កំពង់ស្វាយ",
    "ស្ទឹងសែន",
    "ប្រាសាទបល្ល័ង្ក",     //    "កំពង់ធំ", (6)  
    "ប្រាសាទសំបូរ",
    "សណ្ដាន់",
    "សន្ទុក",
    "ស្ទោង",
    "តាំងគោក",


    "អង្គរជ័យ",
    "បន្ទាយមាស",
    "ឈូក",
    "ជុំគីរី",             // "កំពត", (7)  
    "ដងទង់",
    "កំពង់ត្រាច",
    "ទឹកឈូ",
    "ក្រុងកំពត",

    "កណ្ដាលស្ទឹង",
    "កៀនស្វាយ",
    "ខ្សាច់កណ្ដាល",
    "ក្រុងអរិយក្សត្រ",
    "កោះធំ",
    "លើកដែក",       //    "កណ្តាល", (8)
    "ល្វាឯម",
    "មុខកំពូល",
    "អង្គស្នួល",
    "ពញាឮ",
    "ស្អាង",
    "ក្រុងតាខ្មៅ",

    "បុទុមសាគរ",
    "គីរីសាគរ",
    "កោះកុង",
    "ខេមរភូមិន្ទ",      //    "កោះកុង", (9)	
    "មណ្ឌលសីមា",
    "ស្រែអំបិល",
    "ថ្មបាំង",

    "ឆ្លូង",
    "ក្រចេះ", 
    "ព្រែកប្រសព្វ",
    "សំបូរ",
    "ស្នួល" ,
    "ចិត្របុរី",





  ];
  
