export const district = [
    "មង្គលបុរី",
    "ភ្នំស្រុក",
    "ព្រះនេត្រព្រះ",
    "អូរជ្រៅ",
    "សិរីសោភ័ណ",                  //    "បន្ទាយមានជ័យ",(1)
    "ថ្មពួក",
    "ស្វាយចេក",
    "ម៉ាឡៃ",
    "ប៉ោយប៉ែត",
    
    
    "បាណន់",
    "ថ្មគោល",
    "បាត់ដំបង",
    "បវេល",
    "ឯកភ្នំ",
    "ម៉ោងឫស្សី",
    "រតនមណ្ឌល",                //បាត់ដំបង (2)
    "សង្កែ",
    "សំឡូត",
    "សំពៅលូន",
    "ភ្នំព្រឹក",
    "កំរៀង",
    "គាស់ក្រឡ",
    "រុក្ខគីរី",

    "បាធាយ",
    "ចំការលើ",
    "ជើងព្រៃ",
    "កំពង់ចាម",
    "កំពង់សៀម",              //កំពង់ចាម (3)
    "កងមាស",
    "កោះសូទិន",
    "ព្រៃឈរ",
    "ស្រីសន្ធរ",
    "ស្ទឹងត្រង់",

    "បរិបូណ៍",
    "ជលគីរី",
    "កំពង់ឆ្នាំង",
    "កំពង់លែង",              //កំពង់ឆ្នាំង (4)
    "កំពង់ត្រឡាច",
    "រលាប្អៀរ",
    "សាមគ្គីមានជ័យ",
    "ទឹកផុស",


    "បសេដ្ឋ",
    "ច្បារមន",
    "គងពិសី",
    "ឱរ៉ាល់",                //កំពង់ស្ពឺ (5)
    "ឧដុង្គ",
    "ភ្នំស្រួច",
    "សំរោងទង",
    "ថ្ពង",


    "បារាយណ៍",
    "កំពង់ស្វាយ",
    "ស្ទឹងសែន",
    "ប្រាសាទបល្ល័ង្ក",
    "ប្រាសាទសំបូរ",
    "សណ្ដាន់",
    "សន្ទុក",
    "ស្ទោង",
    "តាំងគោក",

    "គង់សំរឹទ្ធឧត្ដម",
    "បល្ល័ង្ក",
    "គង់សំរឹទ្ធឧត្ដម",
    "បឹង",
    "ចើងដើង",
    "ច្រនាង",
    "ឈូកខ្សាច់",
    "ចុងដូង",
    "ជ្រលង",
    "គគីរធំ",
    "ក្រវ៉ា",
    "អណ្តូងពោធិ៍",
    "ពង្រ",
    "សូយោង",
    "ស្រឡៅ",
    "ស្វាយភ្លើង",
    "ត្នោតជុំ",
    "ទ្រៀល",

    "ជ័យ​",
    "ដំរីស្លាប់​",
    "កំពង់គោ​",
    "កំពង់ស្វាយ​",
    "នីពេជ​",
    "ផាត់សណ្តាយ​",
    "សាន់គ​",
    "ត្បែង​",
    "ត្រពាំងឫស្សី​",
    "ក្ដីដូង​",
    "ព្រៃគុយ",
                  //កំពង់ធំ (6)

                  









  ];
  
