export const district = [
    "មង្គលបុរី",
    "ភ្នំស្រុក",
    "ព្រះនេត្រព្រះ",
    "អូរជ្រៅ",
    "សិរីសោភ័ណ",                  //    "បន្ទាយមានជ័យ",(1)
    "ថ្មពួក",
    "ស្វាយចេក",
    "ម៉ាឡៃ",
    "ប៉ោយប៉ែត",
    
    
    "បាណន់",
    "ថ្មគោល",
    "បាត់ដំបង",
    "បវេល",
    "ឯកភ្នំ",
    "ម៉ោងឫស្សី",
    "រតនមណ្ឌល",                //បាត់ដំបង (2)
    "សង្កែ",
    "សំឡូត",
    "សំពៅលូន",
    "ភ្នំព្រឹក",
    "កំរៀង",
    "គាស់ក្រឡ",
    "រុក្ខគីរី",

    "បាធាយ",
    "ចំការលើ",
    "ជើងព្រៃ",
    "កំពង់ចាម",
    "កំពង់សៀម",              //កំពង់ចាម (3)
    "កងមាស",
    "កោះសូទិន",
    "ព្រៃឈរ",
    "ស្រីសន្ធរ",
    "ស្ទឹងត្រង់",

    "បរិបូណ៍",
    "ជលគីរី",
    "កំពង់ឆ្នាំង",
    "កំពង់លែង",              //កំពង់ឆ្នាំង (4)
    "កំពង់ត្រឡាច",
    "រលាប្អៀរ",
    "សាមគ្គីមានជ័យ",
    "ទឹកផុស",




    "បសេដ្ឋ",
    "ច្បារមន",
    "គងពិសី",
    "ឱរ៉ាល់",            //    "កំពង់ស្ពឺ", (5)
    "ឧដុង្គ",
    "ភ្នំស្រួច",
    "សំរោងទង",
    "ថ្ពង",


    "បារាយណ៍",
    "កំពង់ស្វាយ",
    "ស្ទឹងសែន",
    "ប្រាសាទបល្ល័ង្ក",     //    "កំពង់ធំ", (6)  
    "ប្រាសាទសំបូរ",
    "សណ្ដាន់",
    "សន្ទុក",
    "ស្ទោង",
    "តាំងគោក",


    "អង្គរជ័យ",
    "បន្ទាយមាស",
    "ឈូក",
    "ជុំគីរី",             // "កំពត", (7)  
    "ដងទង់",
    "កំពង់ត្រាច",
    "ទឹកឈូ",
    "ក្រុងកំពត",

    "កណ្ដាលស្ទឹង",
    "កៀនស្វាយ",
    "ខ្សាច់កណ្ដាល",
    "ក្រុងអរិយក្សត្រ",
    "កោះធំ",
    "លើកដែក",       //    "កណ្តាល", (8)
    "ល្វាឯម",
    "មុខកំពូល",
    "អង្គស្នួល",
    "ពញាឮ",
    "ស្អាង",
    "ក្រុងតាខ្មៅ",

    "បុទុមសាគរ",
    "គីរីសាគរ",
    "កោះកុង",
    "ខេមរភូមិន្ទ",      //    "កោះកុង", (9)	
    "មណ្ឌលសីមា",
    "ស្រែអំបិល",
    "ថ្មបាំង",

    "ឆ្លូង",
    "ក្រចេះ", 
    "ព្រែកប្រសព្វ",     //    "ក្រចេះ", (10)
    "សំបូរ",
    "ស្នួល" ,
    "ចិត្របុរី",


    "កែវសីមា", 
   "កោះញែក",
    "អូររាំង",         //    "មណ្ឌលគីរី", (11)
    "ពេជ្រចិន្តា",
    "សែនមនោរម្យ",


    "ចំការមន", "ដូនពេញ", "ប្រាំពីរមករា", "ទួលគោក", "ដង្កោ", "មានជ័យ",
    "ឫស្សីកែវ", "សែនសុខ", "ពោធិ៍សែនជ័យ", "ច្បារអំពៅ", "ជ្រោយចង្វារ",        //    "ភ្នំពេញ", (12)
    "ព្រែកព្នៅ", "បឹងកេងកង", "កំបូល",


    "ជ័យសែន",
    "ឆែប",
    "ជាំក្សាន្ត",
    "គូលែន",          //    "ព្រះវិហារ", (13) 
    "រវៀង",
    "សង្គមថ្មី",
    "ត្បែងមានជ័យ",
    "ក្រុងព្រះវិហារ",

    "បាភ្នំ",
    "កំចាយមារ",
    "កំពង់ត្របែក",
    "កញ្ច្រៀច",
    "មេសាង",
    "ពាមជរ",
    "ពាមរ",
    "ពារាំង",           //    "ព្រៃវែង", (14)
    "ព្រះស្ដេច",
    "ក្រុងព្រៃវែង",
    "ពោធិ៍រៀង",
    "ស៊ីធរកណ្ដាល",
    "ស្វាយអន្ទរ",


    "បាកាន",
    "កណ្ដៀង",
    "ក្រគរ",         //    "ពោធិ៍សាត់", (15)
    "ភ្នំក្រវាញ",
    "ក្រុងពោធិ៍សាត់",
    "វាលវែង",
    "តាលោសែនជ័យ",


    "អណ្ដូងមាស",
    "ក្រុងបានលុង",
    "បរកែវ",
    "កូនមុំ",
    "លំផាត់",        //    "រតនគីរី ៉"(16)
    "អូរជុំ",
    "អូរយ៉ាដាវ",
    "តាវែង",
    "វ៉ឺនសៃ",



    "អង្គរជុំ",
    "អង្គរធំ",
    "បន្ទាយស្រី",
    "ជីក្រែង",
    "ក្រឡាញ់",     //    "សៀមរាប", (17)  
    "ពួក",
    "ប្រាសាទបាគង",
    "ក្រុងសៀមរាប",
    "សូទ្រនិគម",
    "ស្រីស្នំ",
    "ស្វាយលើ",
    "វ៉ារិន",
    "ក្រុងរុនតាឯក",

    "ក្រុងព្រះសីហនុ",
    "ព្រៃនប់",     //    "ព្រះសីហនុ", (18)
    "ស្ទឹងហាវ",
    "កំពង់សិលា",
    "កោះរ៉ុង",

    "សេសាន",
    "សៀមបូក",
    "សៀមប៉ាង",     //    "ស្ទឹងត្រែង", (19)
    "ក្រុងស្ទឹងត្រែង",
    "ថាឡាបរិវ៉ាត់",
    "បុរីអូរស្វាយសែនជ័យ"

  ];
  
