export const district = [
    "មង្គលបុរី",
    "ភ្នំស្រុក",
    "ព្រះនេត្រព្រះ",
    "អូរជ្រៅ",
    "សិរីសោភ័ណ",                  //    "បន្ទាយមានជ័យ",(1)
    "ថ្មពួក",
    "ស្វាយចេក",
    "ម៉ាឡៃ",
    "ប៉ោយប៉ែត",
    
    
    "បាណន់",
    "ថ្មគោល",
    "បាត់ដំបង",
    "បវេល",
    "ឯកភ្នំ",
    "ម៉ោងឫស្សី",
    "រតនមណ្ឌល",                //បាត់ដំបង (2)
    "សង្កែ",
    "សំឡូត",
    "សំពៅលូន",
    "ភ្នំព្រឹក",
    "កំរៀង",
    "គាស់ក្រឡ",
    "រុក្ខគីរី",

    "បាធាយ",
"ចំការលើ",
"ជើងព្រៃ",
"កំពង់ចាម",
"កំពង់សៀម",
"កងមាស",
"កោះសូទិន",
"ព្រៃឈរ",
"ស្រីសន្ធរ",
"ស្ទឹងត្រង់"













  ];
  
